{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Example exercise"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Run the Cell Below Before Preforming the Excersizes\n",
    "This cell creates a Neo4j graph database from a SQL query. You do not need to understand how it works right now, but you are welcome to look through this code if you are intrested. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Clear Imports\n",
      "<_mysql.connection open to 'localhost' at 2de7970>\n",
      "<MySQLdb.cursors.DictCursor object at 0x7f41c2460a90>\n",
      "Clear Database Connection\n",
      "Found 200 rows\n",
      "Clear SQL Query\n",
      "<Graph uri=u'http://localhost:7474/db/data/'>\n",
      "Clear Create Neo DB\n",
      "Clear Population\n",
      "Clear Employee Relatiponships Part 1\n",
      "Clear Employee Relatiponships Part 2\n",
      "Neo4j Database Loaded\n"
     ]
    }
   ],
   "source": [
    "# Imports \n",
    "import sys\n",
    "from py2neo import neo4j, Graph, Relationship\n",
    "from py2neo.cypher import CypherWriter\n",
    "import MySQLdb\n",
    "\n",
    "print \"Clear Imports\"\n",
    "# Create MySQL connection\n",
    "user = \"lcdebaca\"\n",
    "password = \"qbRUy*uW7bUffBcBUBD7\"\n",
    "database = \"starmetrics\"\n",
    "\n",
    "# invoke the connect() function, passing parameters in variables.\n",
    "db = MySQLdb.connect( user = user, passwd = password, db = database )\n",
    "\n",
    "# output basic database connection info.\n",
    "print( db )\n",
    "\n",
    "cursor = db.cursor( MySQLdb.cursors.DictCursor )\n",
    "# Print Curser\n",
    "print(cursor)\n",
    "\n",
    "print \"Clear Database Connection\"\n",
    "\n",
    "# Collecting data from SQL \n",
    "\n",
    "# The Following is a Query of the starmetrics database\n",
    "# It collects the following variables for Purdue University between the \n",
    "#years 2008 - 2012:  \n",
    "#From the employee Table: id, employeeid, uniqueawardnumber, employeeoccupation\n",
    "#From the occupation Table: occupationalclassification \n",
    "\n",
    "# NOTE I LIMIT TO 200 BECAUSE THE REST OF THE NOTEBOOK WONT RUN OTHERWISE \n",
    "sql_select = \"SElECT employee.employeeid, employee.uniqueawardnumber, employee.occupation_orig, \\\n",
    "occupation.occupationalclassification \\\n",
    "FROM starmetrics.employee \\\n",
    "INNER JOIN starmetrics.occupation ON \\\n",
    "starmetrics.employee.occupation_orig = occupation.occupation_orig \\\n",
    "WHERE starmetrics.employee.university = 'purdue' AND starmetrics.employee.year BETWEEN 2008 AND 2012 LIMIT 200;\"\n",
    "\n",
    "result_count = cursor.execute(sql_select);\n",
    "\n",
    "# Count the number of rows returned \n",
    "print(\"Found \" + str(result_count) + \" rows\")\n",
    "\n",
    "# Store the results of the Query in a list\n",
    "results = cursor.fetchall()\n",
    "\n",
    "print \"Clear SQL Query\"\n",
    "\n",
    "# Create connection to the Neo4jsdatabase using defaults\n",
    "# note, I imported Graph when I imported py2neo\n",
    "graph_db = Graph()\n",
    "print graph_db\n",
    "\n",
    "# Create The Neo4j Database \n",
    "graph_db.create()\n",
    "\n",
    "#Jsut to make sure the new database is empty, this code will delete all exsiting nodes and relationships \n",
    "graph_db.delete_all()\n",
    "\n",
    "# Force nodes to have unique employeeids and uniqueawardnumber\n",
    "#graph_db.schema.create_uniqueness_constraint(\"employeeid\", \"uniqueawardnumber\")\n",
    "\n",
    "print \"Clear Create Neo DB\"\n",
    "\n",
    "# Above I saved the results of the SQL Query into a list called results\n",
    "# Below I iterate over that list, create properties based on the varibles in the SQL database,\n",
    "# and finaly create an 'employee' node with those properties\n",
    "\n",
    "for employee in results:\n",
    "    id_num = employee['employeeid']\n",
    "    occ_orig = employee['occupation_orig']\n",
    "    occ_class = employee['occupationalclassification']\n",
    "    award_num = employee['uniqueawardnumber']\n",
    "    # Wee tiny bit of data cleaning\n",
    "    if award_num[0] == \"'\":\n",
    "        award_num = award_num[1:len(award_num)]\n",
    "\n",
    "    # Create a node with above infomation (This node is not in the Graph yet though)\n",
    "    new_employee_node = neo4j.Node(\"Employee\", employeeid = id_num, occcupation_orig = occ_orig, \\\n",
    "                      occupationalclassification = occ_class)\n",
    "    new_award_node = neo4j.Node(\"Award\", uniqueawardnumber = award_num)\n",
    "    \n",
    "    new_employee = False\n",
    "    new_award    = False\n",
    "    # Check to see that the employee is not already in the graph \n",
    "    if graph_db.find_one(\"Employee\", \"employeeid\", id_num) == None:\n",
    "        new_employee = True\n",
    "        graph_db.create( new_employee_node )\n",
    "    \n",
    "        \n",
    "    \n",
    "    # Check to see that the award is not already in the graph \n",
    "    if graph_db.find_one(\"Award\", \"uniqueawardnumber\", award_num) == None:\n",
    "        new_award = True\n",
    "        graph_db.create( new_award_node )\n",
    "   \n",
    "    # Add relationships between the employees and the awards \n",
    "    # if noth bothe employee and the award are new, create a realtionship between them\n",
    "    if (new_employee & new_award):\n",
    "        new_relationship = Relationship(new_employee_node, \"worked_on\", new_award_node)\n",
    "        graph_db.create( new_relationship )\n",
    "    # if jus t he employee is new, then the award must already exisit \n",
    "    elif (new_employee):\n",
    "        # find the exsisting award node \n",
    "        exsitsting_award_node = graph_db.find_one(\"Award\", \"uniqueawardnumber\", award_num)\n",
    "        # Create realtionship between that node and the new employee\n",
    "        new_relationship = Relationship(new_employee_node, \"worked_on\", exsitsting_award_node)\n",
    "        graph_db.create( new_relationship )\n",
    "    \n",
    "print \"Clear Population\"\n",
    "\n",
    "# When looking at Employees and Awards, each Award has one to many Employees. So the quickest way to find a group of \n",
    "#employees that worked together is to find individual awards \n",
    "\n",
    "# for this we will use a straingt cypher command \n",
    "# Note, these cypher commands return RecordList Objects, Not Lists \n",
    "\n",
    "# Notice that we are asking Cypher to return n.uniqueawardnumber AS uniqueawardnumber\n",
    "# doingthis will allow us to access this attribute as:  print awards_record[1].uniqueawardnumber\n",
    "awards_record = graph_db.cypher.execute(\"MATCH (n:Award) RETURN n, n.uniqueawardnumber AS uniqueawardnumber;\")\n",
    "\n",
    "# Get length of Record \n",
    "awards_record_len = graph_db.cypher.execute(\"MATCH (n:Award) RETURN COUNT(*) AS count\")\n",
    "\n",
    "# Get the number of returned nodes as a number \n",
    "awards_record_len = awards_record_len[0].count\n",
    "\n",
    "# The Cypher returned a RecordList Object, but a list would be easiest to work with;\n",
    "\n",
    "\"\"\"\n",
    "The following loop wil add every award number to a list ( I don't need the whole object to find the\n",
    "employees who worked on that award )\n",
    "\n",
    "Note, I find while loops work better for this work than for loops \n",
    "\"\"\"\n",
    "count = 0\n",
    "awards = []\n",
    "while count < awards_record_len:\n",
    "    awards.append(str(awards_record[count].uniqueawardnumber))\n",
    "    count += 1 \n",
    "    \n",
    "print \"Clear Employee Relatiponships Part 1\" \n",
    "\n",
    "# Next we want to get a list of employees that worked on each of those awards \n",
    "\n",
    "# for every award in our award list; \n",
    "count = 0 \n",
    "while count < len(awards):\n",
    "    # Create a Cypher Query that collects the employees that have \"worked_on\" that award;\n",
    "    tx = graph_db.cypher.begin()\n",
    "    statment = \"MATCH (n)-[r:worked_on]->(m {uniqueawardnumber:{NUM}}) RETURN n.employeeid AS employeeid;\"\n",
    "    # This bit of code subsitutes NUM for the award number contained in out awards list \n",
    "    tx.append(statment, {\"NUM\": awards[count]})\n",
    "    relivent_employees_record = tx.commit()\n",
    "    \n",
    "    # Create a Query that collects the number employees that have \"worked_on\" that award;\n",
    "    tx = graph_db.cypher.begin()\n",
    "    statment = \"MATCH (n)-[r:worked_on]->(m {uniqueawardnumber:{NUM}}) RETURN Count(*) AS count;\"\n",
    "    tx.append(statment, {\"NUM\": awards[count]})\n",
    "    relivent_employees_record_len = tx.commit()\n",
    "    \n",
    "    # Get the number of returned nodes as a number (Cuz remember, the cypher Returns a RecordList)\n",
    "    relivent_employees_record_len = relivent_employees_record_len[0][0].count\n",
    "    \n",
    "    #print relivent_employees_record\n",
    "    #print relivent_employees_record[0][0].employeeid\n",
    "\n",
    "    \n",
    "    #I want emplyees in a list, not a Record Object, \n",
    "    i = 0\n",
    "    relivent_employees = []\n",
    "    while i < relivent_employees_record_len:\n",
    "        relivent_employees.append(str(relivent_employees_record[0][i].employeeid))\n",
    "        i += 1\n",
    "    \n",
    "    # Next create Relatioships between the employees'\n",
    "    \"\"\"\n",
    "    What I'm doing here is saying connect the first employee with each employee that follows it in the list,\n",
    "    then repete the process with the next employee until you reach the end of the list \n",
    "    \n",
    "    There is a bug in the logic here\n",
    "    \"\"\"\n",
    "    current_employee = 0 \n",
    "    while current_employee < len(relivent_employees):\n",
    "        next_employee = current_employee + 1 \n",
    "        while next_employee < len(relivent_employees):\n",
    "            tx = graph_db.cypher.begin()\n",
    "            statment = \"MATCH (n {employeeid: {NUM1}}), (m {employeeid: {NUM2}}) \\\n",
    "            CREATE (n)-[r:worked_with]->(m) RETURN r;\"  \n",
    "            tx.append(statment, {\"NUM1\": relivent_employees[current_employee], \"NUM2\": relivent_employees[next_employee]})\n",
    "            tx.commit()\n",
    "            next_employee += 1 \n",
    "        current_employee += 1\n",
    "    \n",
    "\n",
    "    #DONT COMMENT THIS OUT REN\n",
    "    count += 1\n",
    "print \"Clear Employee Relatiponships Part 2\" \n",
    "\n",
    "print \"Neo4j Database Loaded\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### The cell below is intended for you to test Cypher Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 180,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | b                                                                                                                   \n",
       "---+----------------------------------------------------------------------------------------------------------------------\n",
       " 1 | (n271401:Employee {employeeid:\"90023086\",occcupation_orig:\"FACULTY\",occupationalclassification:\"Faculty\"})          \n",
       " 2 | (n271403:Employee {employeeid:\"90002600\",occcupation_orig:\"GRADUATE\",occupationalclassification:\"Graduate Student\"})\n",
       " 3 | (n271404:Employee {employeeid:\"12363\",occcupation_orig:\"UNDERGRAD\",occupationalclassification:\"Undergraduate\"})     "
      ]
     },
     "execution_count": 180,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.cypher.execute(\"MATCH (n {employeeid:'704'}) -[r:worked_with] -> (b) RETURN b;\") "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Introduction to Neo4j and Cypher\n",
    "## What is a Graph Database?"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " When you think of data, you probably imagine an excel table where each row is an individual observation or data point. \n",
    "For example, \n",
    "\n",
    "|name | age | employee_id|\n",
    "|-----|-----|------------|\n",
    "|Joe  |  34 |   12345    |\n",
    "|Ann  |  54 |   12346    |\n",
    "    \n",
    "In a graph database, that row is more like a ball. \n",
    "\n",
    "\n",
    "##### (node: Employee {name:Joe, age: 34, employee_id: 12345})\n",
    "\n",
    "This ball is called a \"node\" in Neo4j. In fact, the little parentheses around Joe's information are designed to help the user think of Joe's information as a little ball. \n",
    "\n",
    "All the information about Joe is still there, but it's just not in a flat table format. Instead of storing each peice of Joe's information in a variable column, Joe's information is stored as **properties**, ie name, age, employee_id.\n",
    "Joe's node also has a **label**, *Employee*, to identify this node as belonging to an employee.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Neo4j uses the Cypher Query Language to get information out of the Database. \n",
    "\n",
    "##### Components of a simple Cypher Query:\n",
    "+ MATCH      \n",
    "     - Essentially the same thing as SELECT in SQL \n",
    "+ (n)        \n",
    "    - Any node (the n is just a variable, could be any letter) \n",
    "+ RETURN     \n",
    "    - Needed in every query \n",
    "+ LIMIT      \n",
    "    - Same as in SQL \n",
    "\n",
    "The following query will return 20 nodes from the database:  \n",
    "##### graph_db.cypher.execute(\"MATCH (n) RETURN n LIMIT 20\")\n",
    "\n",
    "If you look at the results, you might notice the some nodes have n0000:Employee and other have n0000:Award.\n",
    "This is because some of the nodes describe the data of an employee and thus have the Employee label while others describe awards and are thus labels appropriately \n",
    "\n",
    "If I wanted to query just Award nodes, I would run this query;  \n",
    "##### graph_db.cypher.execute(\"MATCH (n:Award) RETURN n LIMIT 20\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Part A (X points) - Cypher Query language"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    " Write a Query that returns 10 Employee nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "metadata": {
    "collapsed": false,
    "nbgrader": {
     "grade": false,
     "grade_id": "squares",
     "locked": false,
     "solution": true
    }
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'graph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-181-a00c476aa673>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[0mgraph\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mcypher\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mexecute\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"MATCH (n:Employee) RETURN n LIMIT 10\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m: name 'graph' is not defined"
     ]
    }
   ],
   "source": [
    "graph.cypher.execute(\"MATCH (n:Employee) RETURN n LIMIT 10\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "\"\"\"\n",
    "Your query should return a RecordList of employee nodes like the following one. \n",
    "(Note, this is not a python list, it is a RecordList object)  \n",
    "\n",
    "    | n                                                                                                                   \n",
    "----+----------------------------------------------------------------------------------------------------------------------\n",
    "  1 | (n269757:Employee {employeeid:\"90009387\",occcupation_orig:\"UNDERGRAD\",occupationalclassification:\"Undergraduate\"})  \n",
    "  2 | (n269759:Employee {employeeid:\"90027173\",occcupation_orig:\"GRADUATE\",occupationalclassification:\"Graduate Student\"})\n",
    "  3 | (n269761:Employee {employeeid:\"90014540\",occcupation_orig:\"FACULTY\",occupationalclassification:\"Faculty\"})          \n",
    "  4 | (n269762:Employee {employeeid:\"90022062\",occcupation_orig:\"GRADUATE\",occupationalclassification:\"Graduate Student\"})\n",
    "  5 | (n269763:Employee {employeeid:\"90003312\",occcupation_orig:\"GRADUATE\",occupationalclassification:\"Graduate Student\"})\n",
    "  6 | (n269764:Employee {employeeid:\"90026679\",occcupation_orig:\"FACULTY\",occupationalclassification:\"Faculty\"})          \n",
    "  7 | (n269766:Employee {employeeid:\"90017693\",occcupation_orig:\"FACULTY\",occupationalclassification:\"Faculty\"})          \n",
    "  8 | (n269767:Employee {employeeid:\"90028696\",occcupation_orig:\"FACULTY\",occupationalclassification:\"Faculty\"})          \n",
    "  9 | (n269769:Employee {employeeid:\"90013819\",occcupation_orig:\"FACULTY\",occupationalclassification:\"Faculty\"})          \n",
    " 10 | (n269771:Employee {employeeid:\"15226\",occcupation_orig:\"GRADUATE\",occupationalclassification:\"Graduate Student\"}) \n",
    " \n",
    " \"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What makes graph databases like Neo4j special is the ability to create relationships between nodes:\n",
    "\n",
    "For instance, the database has two types of relationships; worked_on and worked_with.  \n",
    " + Employees have a *worked_on* relationship with nodes which represent awards on which the employee has worked.   \n",
    " + Employees have a *worked_with* relationship with nodes that represent employees that worked on the same award\n",
    "\n",
    "To view what this looks like, this query will return 5 instances of the pattern where an employee worked_on an award, and return the relationship. \n",
    "\n",
    "#### graph_db.cypher.execute(\"MATCH (e)-[r:worked_on]->(a) RETURN  r LIMIT 5;\")\n",
    "\n",
    "If you look at this query you kinda see a pattern of (node1) -[relationship]-> (node2). You can imagine that this is one ball with an arrow pointing to another ball. Each ball is a node of data and the arrow is a relationship.  What this query is asking the the database to do is go through all the nodes and relationships and find the pattern where one node has a realtionship pointing to another node and that realtionship has the label \"worked_on\".  \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "Write a Query that returns 15 instances of employees that worked on the same grant. Return both employee nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "graph_db.cypher.execute(\"MATCH (a)-[r:worked_with]->(b) RETURN a, b LIMIT 15;\") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "nbgrader": {
     "grade": true,
     "grade_id": "correct_squares",
     "locked": true,
     "points": 1,
     "solution": false
    }
   },
   "outputs": [],
   "source": [
    "\"\"\"\n",
    "Your query should return a RecordList of employee nodes. (Note, this is not a python list, it is a RecordList object)  \n",
    "\n",
    "    | a                    | b                   \n",
    "----+----------------------+----------------------\n",
    "  1 | (n269825:`90003312`) | (n269826:`90022062`)\n",
    "  2 | (n269827:`90003312`) | (n269828:`90014540`)\n",
    "  3 | (n269829:`90003312`) | (n269830:`90027173`)\n",
    "  4 | (n269831:`90022062`) | (n269832:`90014540`)\n",
    "  5 | (n269833:`90022062`) | (n269834:`90027173`)\n",
    "  6 | (n269835:`90014540`) | (n269836:`90027173`)\n",
    "  7 | (n269837:`90017693`) | (n269838:`90026679`)\n",
    "  8 | (n269839:`2623`)     | (n269840:`15226`)   \n",
    "  9 | (n269841:`2623`)     | (n269842:`90013819`)\n",
    " 10 | (n269843:`15226`)    | (n269844:`90013819`)\n",
    " 11 | (n269845:`90026924`) | (n269846:`10622`)   \n",
    " 12 | (n269847:`90026924`) | (n269848:`90001300`)\n",
    " 13 | (n269849:`90026924`) | (n269850:`90003242`)\n",
    " 14 | (n269851:`90026924`) | (n269852:`90007913`)\n",
    " 15 | (n269853:`10622`)    | (n269854:`90001300`)\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "https://www.wakari.io/sharing/bundle/nvikram/Basics%20of%20Networkx?has_login=False\n",
    "http://patrick-fuller.com/igraph/examples/ipython.html"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "nbgrader": {
     "grade": true,
     "grade_id": "squares_invalid_input",
     "locked": true,
     "points": 1,
     "solution": false
    }
   },
   "source": [
    "## Neo4j and Networkx "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "This would all be so much cooler if you could see the data, right?\n",
    "\n",
    "But first, we have to convert our neo4j database into a networks objects \n",
    "Pulling data from a cypher query into networkx objects with example"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def recordlist_to_list(recordlist, record_property, len_of_recordlist = 1):\n",
    "    \"\"\"\n",
    "    Used to convert the result of a cypher query into a python list. \n",
    "    The Cypher Query should return a single property of the node as an alias, ie \n",
    "    graph_db.cypher.execute(\"MATCH (n) RETURN n.record_property AS record_property  \n",
    "    \n",
    "    Parameters\n",
    "    --------------------------------\n",
    "    recordlist: A RecordList object returned by a Cypher.execute command \n",
    "    record_property: The property that was returned by the Cypher.execute command as an alias \n",
    "    len_of_recordlist: the number of nodes returned by the Cypher.execute command. Defaluted to 1\n",
    "    \"\"\"\n",
    "    \n",
    "    count = 0\n",
    "    final_list = []\n",
    "    while count < len_of_recordlist:\n",
    "        command = \"recordlist[\" + str(count) + \"][0]\" +\"['\" + record_property +\"']\"      \n",
    "        final_list.append( eval(command))\n",
    "        count += 1 \n",
    "    return final_list\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "00.070 03-C-NE-PU\n",
      "90003312\n",
      "90022062\n",
      "90014540\n",
      "90027173\n"
     ]
    }
   ],
   "source": [
    "## Collect a collection of nodes to display\n",
    "# maybe i'll make this a subgraph later '\n",
    "\n",
    "# Get a award node (I picked a random Award number to seach for)\n",
    "# Notice that this Query return only the award number\n",
    "specific_award_node = graph_db.cypher.execute(\"MATCH (m {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN m;\")\n",
    "\n",
    "# Collect all the employees that worked on that award\n",
    "# Notice that this Query return only the employee id number \n",
    "associated_employees = graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN n;\") \n",
    "\n",
    "# Count number of employees that worked on that Awars ( this will be used below )\n",
    "num_associtated_employees = graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN COUNT(n);\") \n",
    "\n",
    "# Remember, all the queries above return RecordList objects, which is a little awkward to deal with. So i'm going to use \n",
    "# the function I created, record_to_list(),to convert the infomation I want into a python list \n",
    "\n",
    "# First, I convert the award node ( Note, because the award numbers are unique, I know there are only one of these)\n",
    "specific_award_node = recordlist_to_list(specific_award_node, 'uniqueawardnumber')\n",
    "\n",
    "# Next , I  need the number of Employees who worked on that project \n",
    "num_associtated_employees = graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->\\\n",
    "(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN n;\").to_subgraph().order\n",
    "\n",
    "\n",
    "# Finally, I use the number of employees who worked on that node \n",
    "associated_employees = recordlist_to_list(associated_employees, \"employeeid\", num_associtated_employees)\n",
    "\n",
    "\n",
    "#print award node\n",
    "for item in specific_award_node:\n",
    "    print item\n",
    "\n",
    "#print associated_employees\n",
    "for item in associated_employees:\n",
    "    print item\n",
    "    \n",
    "############################################\n",
    "#NOTE, in order to get the number of nodes returned by the, \n",
    "# graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN n.employeeid AS employeeid;\") \n",
    "#Command I could call .to_subgraph on it \n",
    "# This will convert that reselt into a subgraph\n",
    "# then calling .order will return the number of nodes in that result \n",
    "# But make sure recordlist_list still recives and recordlist as a parameter otherwise we wont get our infomation\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "At this point we have two lists \n",
    "\n",
    "+ specific_award_node is a list of length one that contains the award number of a particular award \n",
    "+ associated_employees is a list of length four that contains the employees that worked on that node \n",
    "\n",
    "Now lets create some Networkx objects from these list a display a plot of what this looks like "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[u'00.070 03-C-NE-PU', None, u'90022062', u'90003312', u'90027173', u'90014540']\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd8AAAFBCAYAAAA2bKVrAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xt8z3Xj//HnznZkM2PLKRpqDUlhXGpciWUkUnJIpUiH\ny5XDVCquDt/Eb64u5xqZQyTWhBxiDMkpzGGkVA4jx7GzHT6v3x/LtCSHtvc2e9xvt926+bxPr8/7\nn0fv9+d9sDPGGAEAAMvYl/QAAAAob4gvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIA\nYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74A\nAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgv\nAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHi\nCwCAxYgvAAAWI74AUE4ZY0p6COUW8QWAcsJms2n58uVq89BDcvf2loOjo5wqVJBfzZoaOny4Dh06\nVNJDLDfsDP/rAwA3vU/nztUrr76qdDc3pT30kBQSInl5STk50vHjcl6+XPYrV6pFSIiip0xRjRo1\nSnrINzXiCwA3uVHvvKMPJk9WxquvSkFBkp3dn8+YlSWHBQtUcdkyrVu5UkFBQdYOtBwhvgBwE5sw\ncaIixoxRRmSk5ONzbQutXKnKM2dq56ZNql69evEOsJziN18AKCX27dunNm3aqFKlSgoMDFRsbGzB\ntNWrV6tBgwZyd3dXmzZtdPjw4ULLRkREyNfXV76+vho+fLgk6dixYxoyfLgy/P2l/v2ljh2ll16S\n9u27tODs2VJY2KW/9u2l0aOV/I9/aMCgQZo/f75CQkLk7u6u0NDQQttcv369PD09C/3Z29vriy++\nkCTNmzdPDRo0UMWKFeXr66tHHnlEx44dK6a9V7Zw5AsApUBubq7uuOMODRw4UP/617+0du1ahYeH\na8eOHfL29lbdunU1ffp0hYeHa8SIEVq/fr2+/fZbSdLUqVM1btw4xcXFSZIeeOABvfzyy0r69VeN\n3rBB2fXrS23aSN7e0tKlUlSUNHeu5Op6+UCio6Vdu6RRo1ShVy9Ff/SR7O3ttW/fPsXFxWnNmjVX\n/A7x8fEKDw/XiRMn5OrqqiNHjsjFxUV+fn5KT09X//79lZubq3nz5hXLPixLOPIFgFJg//79On78\nuAYNGiQ7OzuFhoaqZcuWmjVrlmJiYhQcHKyuXbvK2dlZI0eOVEJCgg4cOCBJio6O1pAhQxQQEKCA\ngAANGTJEn3zyiSZMnarsxx+XunXLP+VsZ5d/9JubKx09evkgjJFWrJAefFDy8JBCQ7V3/35169ZN\n/v7+V/0OM2bM0KOPPirX36Jeo0YN+fn5/bZqIwcHh2taT3lAfAGglLLZbNqzZ48SExPVsGHDgs/d\n3Nx02223ae/evZKkxMRENWrUqGB6w4YNtXv3buVWqiTVrVt4pT/+mH+F8y23XL7BXbukc+ek1q0l\nSVnt2mnG3LnXNNb09HQtXLhQTz75ZKHPN2zYoEqVKsnLy0uHDx/W6NGjr2l9NzviCwClQP369eXn\n56cxY8YoJydHK1eu1Lp165SRkaG0tDRVrFix0PxeXl5KTU2VpMume3l5KTMzU3bVqhXeSHq69N57\nUt++kpvb5YNYsUK67z6pQoX8f1etqrOnTl3T+GNiYlSlShW1/i3cF7Vq1Urnzp3T0aNH5eTkpKFD\nh17T+m52xBcASgEnJyfFxsZq6dKl8vf3V2RkpLp3767q1avLw8NDKSkpheY/f/68PD09Jemy6efP\nn1eFChVkHBwuLXDhgvTaa/m3GvXocfkAsrKkdevyTzlf5OCgvNzcaxp/dHS0+vTpc8XpAQEBevvt\ntzVz5sxrWt/NjvgCQCkRHBystWvX6vTp01q+fLkOHjyoZs2aKSgoSAkJCQXzpaen6+DBgwX34QYF\nBWnnzp0F0xMSElS7dm3ZnT+f/0F2tjRihFS1qjR48J9vfP36/IduNG586bOUFHn8dkRtd6V7gyUd\nOXJE8fHxfxlfScrJyZHbnx1xl0PEFwBKid27dysrK0sZGRkaO3asTpw4ob59++rhhx/Wnj17FBMT\no6ysLI0aNUqNGzdWvXr1JEl9+vRRZGSkjh07pqSkJEVGRurZZ59V9vffS6dPSyNH5p9Kjoi48sZX\nrpTatSv0kf2GDWpz333KyspSTk6ObDabLly4oJycnELzzZo1Sy1bttStt95a6PNPP/1UR44ckSQd\nOnRIr7/+urp27fr3d9RNgPgCQCkxa9YsBQQEqGrVqlqzZo2+/vprOTk5qUqVKlq4cKFef/11+fj4\naNu2bYVu1+nfv7/Cw8MVHByshg0bKjw8XP/+97/18MMPyy46Wtq0Sdq2TQoPv3Q/7+7dlzZ86pS0\nc2fh+OblyXXpUjWoU0dubm4aOHCg1q9fL1dXV/Xv3/+ycf/xQisp/0KwkJAQeXh46P7771eLFi30\nwQcfFPl+K4u4zxcAblLbtm3TfZ07K+OTTyRn5+tbeMMG3R4bq8Rt24pncOUcR74AcJNq2rSp2rRo\nIdcxYySb7doXPHJErh9+qPHcFlRsiC8A3MTmz5ql2mfOSG+8kX/h1dV8/71chwzR+NGj1bZt2+If\nYDnFaWcApUZmZqaOHz+u1NRUeXh4yN/fn6tj/6akpCTde++9qnHbbdq1f7+yw8KUFxYmValyaSZj\npB075L5kicz27Zr9ySfq0qVLyQ26HCC+AErcnj17FDlhgubNnSsHT0/Zu7nJlpGhvNRUdXv0UQ1+\n6aVCT3DCtcnIyNA//vEPde/eXREREdqzZ4/GTZyouXPnyrlGjfxbi7Kzlfvrr/L18NCwl15S7969\nC+4fRvEhvgBKzJkzZ/Rwjx76LiFBOQ89pNywMMnX99IMZ8/KYelSuXz1lYIbNNCXn31W8Kxg/DWb\nzabHHntMbm5umjFjRqH7dFNTU7V7926dO3dOzs7OqlatmoKCgv7yXl4ULeILoEQcO3ZMzVq31sl7\n71X2009Ljo5XnjkvT04zZ8p3/Xptjo9XjRo1rBtoGfXmm28qLi5Oq1evlouLS0kPB39AfAFYLj09\nXU1CQvTTPfcot1eva17O4bPPVDM+Xjs3bZKXl1cxjrBs+/TTT/X6669r8+bNnCkopbjaGcBVFfVL\n3j/6+GMddnVV7k8/SY8++ucvef/22/zPwsOlrl2lsWOVFx6u4/7+mjh5si5cuKCnn35aFStWlL+/\nv8aNG1dou3l5eRoxYoRuueUWeXl5qUmTJgXPP46OjlbTpk1VsWJF1ahRQxEREcrLyyumvWetzZs3\na9CgQfryyy8Jb2lmAOAv5OTkmMDAQDNu3Dhjs9lMXFyccXd3NwcOHDCnTp0yXl5eZsGCBebChQtm\n6NChpnnz5gXLTpkyxdSvX98kJSWZpKQkc8cdd5jJkyebgLp1jd56y+iFF4wWLjSKizMaPNioYkWj\nZcuM1qwxGjHC6IMPjFasMFq82KhZM6NOnYwmTTJ+NWuaYcOGmdatW5tz586Zffv2mWrVqpnly5cX\nbPv11183bdu2NYcPHzbGGLN3716TlZVljDFm8uTJZsOGDSYnJ8ckJSWZu+++27z//vvW7thicPjw\nYRMQEGAWL15c0kPBVXDaGcBf2rNnj1q0aFHw+jpJevDBB9WsWTNVr15dM2fO1IYNGyTlX13r6+ur\nnTt3ql69egoJCdHTTz+tfv36SZI++eQTjRkzRkdyc5U2dWr+y91/r2NHadw4KTDw8oGsXy/NmCFF\nRcnjhRfkcvKk5s2bp3/+85+SpLfeeksHDhzQ3LlzlZycrJo1a2rXrl2XPW/4z4wbN05r1qzRl19+\neWM7qRRIS0tTq1at1Lt3bw2+0ssTUGpw2hnAdfs7L3n/8eBBpbVufXl4/+ol75KUkCDVri3Z2Smt\nRQudOXPmsnVf3O7u3bvl6Oiozz//XP7+/qpfv74mTZp0xe8THx+vO++88zr3Qulhs9nUu3dv3X33\n3XrllVdKeji4BsQXwF8q6pe852RnS97ehTdytZe8b9uW/9adp5/O//dv8/xx3Re3e/ToUZ0/f14/\n/PCDfvnlFy1YsEAjR47UqlWrLlv19OnTtX37dg0ZMuR6d02pMWLECJ09e1aTJ0/mdqEygvgC+EtF\n/ZJ3Ryenwhu42kveExOld9+VRo26dFT8221Jf1z3xe26urpKyr/dxsXFRcHBwXr88cf11VdfFVp1\nbGysXnvtNS1btkw+Pj7Xv3NKgVmzZumzzz7TwoUL5Xy9L09AiSG+AK6qKF/yXsXXV3anT+d/cLWX\nvP/wQ/70iAjprrsufZ6RITd398vWffHU8e9Phf/e748Kly9frueee05LliwpGG9Zs3HjRg0ePFiL\nFy+W7+8fToLSr6Sv+AJQ+u3atctkZmaa9PR0M2bMGFOnTh2TnZ1tTp48aSpWrGgWLlxoMjMzzdCh\nQ02LFi0KlpsyZYq5/fbbTVJSkjl69Ki54447zNChQ417rVpGK1catWhh1KqV0apV+Vc4//5v+nQj\nb+/8q6J//3lcnHGuWdN06dLF3HfffSY5OdkkJiaaatWqmRUrVhRsu3Xr1qZ///7mwoULJjEx0fj5\n+Zm4uDhjjDGrV682Pj4+Zv369Zbvy6Lyyy+/GH9/f/PVV1+V9FBwA4gvgKsaOnSo8fb2Nh4eHiYs\nLMwcPHiwYNqqVatMgwYNjKurqwkNDTWHDh0qtOywYcOMj4+P8fHxMREREcZms5lbg4KMnn/eyM7O\nqEIFI1fXS3//+19+ZNu3N7K3Lzzt1luNPvzQuFWubDw9PU3t2rWNm5ubqVq1qhk3blyh7SYlJZn2\n7dsbDw8PU6dOHfPRRx8VTAsNDTVOTk7Gw8Oj4C8sLKx4d2IRSklJMcHBwZd9Z5Qd3GoEwHJTpkzR\n4E8+Ucb//Z9kfx2/fhkj1zfe0Hvduumpp57Sp59+qqioKJ05c0bPPPOMnnrqKVWvXr34Bl4K5OXl\nqUuXLqpWrZqmTp3KBVZlFPEFYLkLFy6oRWio9taooewBAy6/7ejPGCOnadNU//vvtWXduoKLqiRp\n+/btmjZtmubNm6fmzZurX79+6tixo5z+eHHXTSAiIkJbtmzRihUruMCqDCO+AErE2bNn1SI0VIdr\n1VLW889Lv4vpZTIz5fLxx7rl++/17Zo1V3xsYkZGhhYsWKCoqCj98MMPevLJJ/XMM88o8M8e2lEG\nzZgxQ++88442b96sypUrl/Rw8DdwtTOAEuHj46PvvvlG7d3c5NKjh1zGj5d++aXwTIcPy3niRFV4\n4gn9095e2zdu/MvnFbu5ualPnz5at26d1q5dK5vNplatWun+++/X7NmzlZmZWbxfqhht2LBBw4YN\n05IlSwjvTYAjXwAl7siRI5o4ZYqmREUpIz1dTu7uyk1Pl4urq/o/84xeGDBAtWvXvqF1Z2dna/Hi\nxYqKitKWLVvUo0cP9evXT40bNy7aL1GMfv75Z4WEhCg6Olrt2rUr6eGgCBBfAKWGMUYpKSlKSUmR\nl5eXPD09ZX89F2RdxeHDh/XJJ59o2rRpqlq1qvr166cePXqU6tcTpqSkKCQkRAMGDNCLL75Y0sNB\nESG+AMqdvLw8ff3114qKitKqVavUpUsX9evXTyEhIaXq6uG8vDx16tRJtWrV0sSJE0vV2PD3EF8A\n5drJkyc1c+ZMRUVFyd7eXv369VPv3r1VpUqVkh6aBg8erISEBC1btuymvHK7PCO+AKD8U94bNmxQ\nVFSUFi1apHbt2unZZ59V27Zti/TU97WKiorSmDFjtGnTJnn/8UUUKPOILwD8wblz5zR37twif4BH\ndna2YmNjtWzhQp09eVL2dnby9fdX5x491KFDBzk4OEiS1q5dq8cee0zr169XvXr1iuIroZQhvgDw\nF7Zv366oqCjNmzdPLVq00LPPPquHHnrouk4DnzlzRh+OHauPJ0/W7TabuqemqqokIylJ0mxPT51w\ncdGAQYMUFh6udu3aac6cOWrbtm1xfS2UMOILANfgRh/g8eOPP6rDfffpvjNn9MqFC7rjCvNtk/R+\nhQqKs9kU8Z//KCIiosi/A0oP4gsA12n//v2aNm2aZs6cqdtvv139+vVT165dCz3yUpKOHj2qkMaN\n9VpysgbYbFddr5E00t5en9eooW927OC33psY8QWAG/THB3g88cQT6tevnxo1aiRjjFo1bqxOe/cq\nIi/vutY7yNlZR0JDtXD58mIaOUoa8QWAInD48GFNnz5d06dPV9WqVdW2bVvNHz9eP2ZkXPdzfDMk\n1XBx0Xf799/wk71QuhFfAChCFx/g8XK/fno6KUnDb3A9/3Z2VoWXXtL/jR1bpOND6UB8AaCIpaam\nqoafnw5mZelGX4FwQFIrT0+dOH+eJ1vdhHirEQAUsWPHjqmKo+MNh1eS6knKyMpSWlpaUQ0LpQjx\nBYAilp6eLvcieCqWh6Mj8b1JEV8AKGKenp5KvYZbi64mJSenVL9xCTeO+AJAEatevbqS8/KU9DfW\nsUNSJXf3y+4dxs2B+AJAEXN1ddUTTzyhj397VvON+J+Dg/IcHVWnTh0NHTpUW7duFdfH3jy42hkA\nisHevXvV7p579Etmpq73ZYDnJN3q4qLEn3/WqVOnNH/+fM2fP185OTnq3r27unfvriZNmnAVdBlG\nfAGgmHQMDVXgt99q3IUL17yMTVJPV1d5dOmij+fMKfjcGKOEhISCEBtjCkLcuHFjQlzGEF8AKCbJ\nyclqddddejgpSe/k5upqecyVNNDFRXsbNNCqb7+94u+9xhjt2LGjIMQODg4FIW7YsCEhLgOILwAU\no19//VWNAgN1x4ULejUnR//U5Rfb5EpaLGmsu7s8mzTR50uXytPT85rWb4zRd999VxBiFxeXghDf\neeedhLiUIr4AUIw+/PBDzZkzR08/9ZSmjB2r9BMn1D0jQ37GyEg6Zm+vuRUqqGbdunp+2DA9/vjj\ncnR0vKFtGWO0devWghC7u7sXhDgoKKhovxj+FuILAMVk165datu2rTZt2qS6devKGKNNmzZp+Vdf\n6eyvv8re3l6VAwLUqXNnNW7cuEi3bYzR5s2bNX/+fH3++eeqWLGiunfvrkcffVS33357kW4L14/4\nAkAxyMzMVNOmTRUREaE+ffqU6FhsNps2bdpUEOLKlSsXHBHXq1evRMdWXhFfACgGL774os6cOaNP\nP/20VP3uarPZtHHjRs2fP18LFiyQn59fwRFxYGBgkW4rKytLCxcu1DebN+v0uXNyq1BBdWrUUO9e\nvXTrrbcW6bbKGuILAEVs8eLFeumll7Rz505VqlSppIdzRXl5efrmm28KQhwQEFAQ4rp1697weo8e\nPar/jh+vj6ZPl6lbV2lNmkgeHlJ2tpyTkmS/erXuufdevfqvf6lDhw5F+I3KDuILAEXo+PHjuuuu\nu7RgwQK1atWqpIdzzfLy8rR+/XrNnz9fCxcuVI0aNQpCfD1HqRs3blRYly7KvO8+ZXfqJFWvfvlM\nFy5Ia9bIfe5c9e7cWRPGjZPD33gaWFlEfAGgiNhsNnXo0EHNmzfXqFGjSno4Nyw3N1fr1q3T/Pnz\nFRMTo9q1axeEuFatWldcbuvWrbq/fXtlDBsmNWt29Q2lpcntzTf1aNOm+mTq1FJ1er648WxnACgi\nH374oVJTU/XGG2+U9FCuat++fWrTpo0qVaqkwMBAxcbGFkyLj4/XwIEDNWvWLAUFBWnQoEE6cOCA\nmjZtqubNm6tNmzby8fGRr6+vhg8fLklKSUlRu/BwZTRsKE2dKv3zn1J09JUHMHq01KmTMl54QQvi\n4/VxVJT69u0rFxcXeXp6ytPTU15eXn/6POuZM2fK3t5e06ZNK/T5uHHj5O/vr4oVK+qZZ55RdnZ2\n0eysYkB8AaAI7Ny5U++9957mzJlzw/fpWiU3N1edO3dWp06dlJycrI8++ki9evXSDz/8oNOnT+uR\nRx7Ru+++q+TkZN1zzz0aP368PvroIx07dkzNmjXT9u3bJUm1a9fWjBkz9P7772vmzJnKueMOqXlz\nacCA/P9eye7d0vHjkp2d5Oqq9Bde0H8++EB2dnaKiIhQamqqUlNTlZKSctnRcHJyst57773LHiCy\nYsUKjR49WnFxcTp06JB++uknvfXWW8Wy/4oC8QWAvykjI0M9evTQuHHjysRVvPv379fx48c1aNAg\n2dnZKTQ0VC1bttSsWbMUExOj4OBgde3aVc7Ozho5cqQSEhJ04MABOTk5aevWrRo7dqxOnDihd955\nR4GBgRoxYoQGv/GG0sPDpQcflO69V3Jz+/ON5+VJ48dLL78sXTyqDQ7WeeX/Xn61X0JfffVV/etf\n/1LlypULzRsdHa1+/frp9ttvV6VKlfTmm29qxowZRbPDigHxBYC/afDgwbr77rvVq1evkh7KDbPZ\nbNqzZ48SExPVsGHDgs/d3Nx02223ae/evZKkxMRENWrUSE5OTmrfvr3++9//ysXFRfaentK1PCjk\n88+lRo2kOnUufWZnp7SOHbV3/35NmjRJlStXVtOmTRUTE1No0S1btmj79u0aMGDAb4tdOvK9OK6L\nGjZsqBMnTig5OflGdkexI74A8DcsWrRIK1as0MSJE0t6KNesfv368vPz05gxY5STk6OVK1dq3bp1\nysjIUFpamipWrFhofi8vL6WmpkrSZdO9vLyUmZkph+Dg/NPIf+XkSWnJEumppy6fdvvtsjk66scf\nf9SpU6f09ttvq2/fvtq4caOk/KuxX3jhBU2YMOFPL8z6s3FJKhh3aUN8AeAGHTt2TP3799fs2bMv\nC1Zp5uTkpNjYWC1dulT+/v6KjIxU9+7dVb16dXl4eCglJaXQ/OfPny940cMfp58/f17Ozs7KrVDh\n6hueMEHq0yf/lPTFU8YX/+vmptzcXHl7e8ve3l4dOnRQz549C45+J02apIYNG+ree+8tWN3vTzv/\n2bgkXfMLKqxGfAHgBthsNvXp00fPP/+8QkJCSno41y04OFhr167V6dOntXz5ch08eFDNmjVTUFCQ\nEhISCuZLT0/XwYMHC17MEBQUpJ07dxZMT0hIUPXq1eWYlXX1je7YIU2ZInXtKnXrlv/Ziy9KcXFS\nRobcPTyuuGhcXJy++OIL+fv7y9/fXxs3btTgwYP18ssvX3FcVatWlbe39/XsFsuU7kvyAKCUioyM\nVFZWll5//fWSHsoN2b17twIDA2Wz2TRp0iSdOHFCffv21blz5zR06FDFxMQoLCxMo0aNUuPGjQue\nAd2nTx9FRkYqLCxMxhhFRkbq4Ycf1tRFi/KPYm22/IuqLv5lZ0uOjpK9vTR7dv50KX/ebt2k996T\n6taVVq6Ul5ub0tLS5ObmplWrVmnOnDlasmSJJGnGjBm6cOHCb4saPfLII3r00Uf1zDPPFIyrb9++\n6tmzp6pVq6a3335bT/3Z6e1SgvgCwHXavn27PvjgA23ZsqXU31Z0JbNmzVJUVJRycnLUunVrff31\n13JyclKVKlW0cOFCvfjii+rVq5eaN2+uefPmFSzXv39//fTTTwoODpYkPfvss3rvvfc0NzZWaXv2\nSEuXSitXXtrQ7NlSRET+VdB/PDVvZ5f/mZOTPJYsUZ6Tk6pXry5jjOrUqaOoqCi1bt1aki47re/s\n7CwvL6+C08oPPvighg0bptDQUGVmZqpbt26l+kEnPOEKAK5Denq6mjRpopEjR6pHjx4lPZxSI3Lc\nOL2xbJkyXnvt+hdOTFS1sWOV9OOPsrcvH7+Glo9vCQBF5N///reaNWtGeP/g6aeekuOOHdLWrde3\nYGam3CZO1KuvvFJuwisRXwC4Zl988YVWr16tCRMmlPRQSp1KlSpp6RdfyO3996XfXfj0lzIz5faf\n/+ihJk300gsvFO8ASxlOOwPANTh69Kjuvvtuffnll2p2LS8NKKfi4uLUuXt3ZYWFKTc8XKpS5fKZ\ncnOlDRvkPmeOurRurelTpsjJycn6wZYg4gsAV5GXl6cHHnhAbdq00YgRI0p6OKXewYMH9cG4cZo9\nZ47sGjVS+u/e5+uQlCSXlSvVoF49DX/5ZXXr1q1cvc3oIuILAFcxevRoLV26VGvWrCl37539O9LS\n0jR79myt37JFp5OT5e7mpltvuUVPP/lkwX3D5RXxBVCu/fTTT1q/fr2Sk5Pl6OgoPz8/tW/fvuDx\nhNu2bVNYWJi2bdummjVrlvBocbMomzeoAcDfkJeXp2XLlumD8eO1detWOd5zj7I9PWWflyenU6eU\n+9xzevzxx9X/qafUu3dvTZgwgfCiSHHkC6BcOXfunB7s3FmJJ08qrXNnKTRUcnEpPNOpU3Jctkxm\n4ULdUbeuEr77rlz+LoniQ3wBlBvnz59X01atdLhBA2UPGCBd7ffbs2fl9sYb6t2mjSb/738EGEWG\n+3wBlBudH3tMRwIDlT1w4NXDK0k+PsoYPVqzli3TxEmTin+AKDeIL4BSad++fWrTpo0qVaqkwMBA\nxcbGFkxbvXq1GjRoIHd3d7Vp00aHDx8utGxERIR8fX3l6+ur4cOHS5K2bt2qbXv36kLXrtIrr0gd\nOkhPPil9992lBXfskJ55RgoPlzp1koYOlU6fVsbw4Xrz3Xc1ePBg1axZU15eXqpevbpeeeUV5ebm\nFiz+3HPPqUGDBnJwcFB0dHShMUVHR6tp06aqWLGiatSooYiICOXl5RXDnkNZQHwBlDq5ubnq3Lmz\nOnXqpOTkZH300Ufq1auXfvjhB50+fVqPPPKI3n33XSUnJ6tp06Z67LHHCpadOnWqFi1apF27dmnX\nrl1avHixpk6dqrHjxyvzoYfy36JTr560aFF+aEeOlH5796tq15bef19avFiKiZFuu0364APpttuU\n6+en2rVrKzExUSkpKdqyZYtWrlypqKiogm03btxYkyZNUpMmTS47RZ2ZmakPP/xQZ86c0ebNm7V6\n9WqNHTtPDrJNAAALJklEQVTWgr2J0oj4Aih19u/fr+PHj2vQoEGys7NTaGioWrZsqVmzZikmJkbB\nwcHq2rWrnJ2dNXLkSCUkJOjAgQOS8o8whwwZooCAAAUEBGjIkCGKiorSl4sWydawofTDD1LfvpKz\ns9S6tVSnjhQfn79hb+9LT2Sy2fJfg1e5siQptWNHzY6Jkcdv75w1xsje3l7+/v4F4x44cKDatGmj\nCn/yYvkBAwaoZcuWcnR0VEBAgHr27Klvvvmm+HYiSjXiC6BMsNls2rNnjxITE9WwYcOCz93c3HTb\nbbdp7969kqTExEQ1atSoYHrDhg2VmJgol9q1pTNnpIAAydX10orr1pV++eXSv0+cyD/t3KGDtGlT\n/qlnSbrnHu3ZsUPvv/++PD09VaNGDXXs2FGdO3e+oe8THx+vO++884aWRdlHfAGUOvXr15efn5/G\njBmjnJwcrVy5UuvWrVNGRobS0tIue7erl5eXUlNTJemy6V5eXsrMzMx/vGFmpuTuXnhj7u75n19U\ntWr+aefY2Pwwjx6d/7mHhzJTUxUREaHU1FR99913mjNnjmJiYq77+02fPl3bt2/XkCFDrntZ3ByI\nL4BSx8nJSbGxsVq6dKn8/f0VGRmp7t27q3r16vLw8FBKSkqh+c+fP1/wUvU/Tj9//rxcXV2l7Oz8\nI9709MIbS0uT3NwuH4SnpzRggPTtt/nLZGfL0cWl4Lfcu+66SwMHDtSsWbOu67vFxsbqtdde07Jl\ny+Tj43Ndy+LmQXwBlErBwcFau3atTp8+reXLl+vgwYNq1qyZgoKClJCQUDBfenq6Dh48WPCs4KCg\nIO383SvtEhISVK9ePeUcPSrVrCkdP174SPfgwfwLrf5MXp5kZyc5OUmHD8v3d7/vSlJOTo7c/3gk\n/ReWL1+u5557TkuWLCn3zzYu74gvgFJp9+7dysrKUkZGhsaOHasTJ06ob9++evjhh7Vnzx7FxMQo\nKytLo0aNUuPGjVWvXj1JUp8+fRQZGaljx44pKSlJkZGRev7551XrllukY8fyr2COjs4/El63Tvr5\n5/wLryRp/XrpyJH8i63OnZMmTpSaN5ecneWydKnuDgrSuXPnZIzRli1bNGnSJD3yyCMFY87JyVFW\nVpZsNpuys7OVlZWli88xiouLU8+ePRUTE6OmTZtavj9RyhgAKIWGDh1qvL29jYeHhwkLCzMHDx4s\nmLZq1SrToEED4+rqakJDQ82hQ4cKLTts2DDj4+NjfHx8TEREhDHGmBkzZhiPkBCjuXONGjc2cnEx\nqlnT6P/9P6M1a/L/Xn7ZyN/fqEIFoypVjDp2NPryS6PFi42zp6cJDQ01Pj4+xtPT09x5551m2rRp\nhbZ73333GTs7O2Nvb2/s7OyMnZ2diY+PN8YYExoaapycnIyHh0fBX1hYWDHvRZRWPF4SQLmQmZkp\n/1q1dH74cKlJk+ta1mnyZHWQtOizz4pncCh3OO0MoFxwdXVV7Pz5cn33XWnfvmtezn7+fFX97jtN\n5/GSKEIc+QIoV5YsWaLH+vZVRu/eUrt2he/5/b2TJ+U8Z46q7d+vdStXqlatWtYOFDc14gug3Nmx\nY4eGvPGGNn7zjWwPPKDsli0lL6/8q5tPnJD711/LJCSoV69eev8//5G3t3dJDxk3GeILoNw6dOiQ\nJkyerK/i4nT+3Dk5Ojqqip+fnn3iCfXs2fO6biMCrgfxBQDAYlxwBQCAxYgvAAAWI74AAFiM+AIA\nYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74A\nAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgv\nAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHi\nCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM\n+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAW\nI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCA\nxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIA\nYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74A\nAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFiM+AIAYDHiCwCAxYgv\nAAAWI74AAFiM+AIAYDHiCwCAxYgvAAAWI74AAFjMsaQHUBxyc3OVnJys1NRUeXl5ydvbWw4ODiU9\nLAAAJN1kR74HDhzQC4MGqVKVKqpZr54a/uMfqh4YKO9q1TR0+HAdOnSopIcIAIDsjDGmpAfxd509\ne1aP9u6tjZs2Ka99e+V07Cj5+1+a4fBhOS9ZIvuvv9YDDzygOdOmydPTs+QGDAAo18p8fI8dO6bm\n99+vE02aKPvppyVn5yvPnJkpl8mTVevQIX27Zo18fHysGygAAL8p0/FNS0tTk5AQ/Xzvvcrt1eva\nFjJGzlOm6M6jR7UxLk4uLi7FO0gAAP6gTP/mO2HiRB319VVuz57XvpCdnbL799f3ubmaPXt28Q0O\nAIArKLNHvnl5eQqoU0cnX31VatDg+lewZYtumzNHB3bulJ2dXdEPEACAKyizR74rVqxQpofHjYVX\nkpo21fHkZG3ZsqVoBwYAwFWU2fh+Hhur1Pvvv/EV2NsrIzRUXyxaVGRjAgDgWpTZ+B4/fVqqXPlv\nrcN4e+v4qVNFNCIAAK5NmY1vkeC3XgBACSiz8a1aubJ09uzfWofd2bOq5utbRCMCAODalNn4dg0P\nl2d8/I2vwGaTW3y8OnXsWHSDAgDgGpTZ+D700ENySU6Wvv/+xlawY4f8PDwUEhJStAMDAOAqymx8\nHRwc9PLzz6vCggXS9d6qbIzcFizQsBdf5B5fAIDlyuxDNiQpJSVFjZo105H771feY49d20LGyGn6\ndDX4/nttjo+Xq6tr8Q4SAIA/KNPxlaTDhw+r+f3363SrVsrp00dy/ItXFGdny2XqVAXs26fN8fGq\nUqWKdQMFAOA3Zfa080U1a9ZUwubNuufYMbn27CmH6Gjpj/fu/vqrnKKi5PrEE2qdk6Md335LeAEA\nJabMH/n+3p49ezRu4kTN/fRT2bm6ysHNTXnp6bLLydFTTz6plwcOVGBgYEkPEwBQzt1U8b3owoUL\nOnnypFJTU+Xl5SU/Pz85/9V7fgEAsNBNGV8AAEqzMv+bLwAAZQ3xBQDAYsQXAACLEV8AACxGfAEA\nsBjxBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8A\nACxGfAEAsBjxBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQX\nAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8AACxGfAEAsBjx\nBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8AACxGfAEAsBjxBQDAYsQXAACLEV8AACxG\nfAEAsBjxBQDAYsQXAACL/X8HHOhj/agZKwAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f41c16b0050>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Creating Networks Objects \n",
    "\n",
    "#Imports that should really be at the top of the notebook \n",
    "import networkx as nx\n",
    "# Allows plots to be showed inline \n",
    "%matplotlib inline\n",
    "# Matplotlib is the default package for\n",
    "# rendering the graphs\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "# Create the Networkx Graph \n",
    "G=nx.Graph()\n",
    "\n",
    "# Distonarys to contain colors and labels\n",
    "# Not nessasary\n",
    "custom_node_color = {}\n",
    "custom_labels     = {}\n",
    "\n",
    "#Create the networkx award node \n",
    "award_node = G.add_node(specific_award_node[0])\n",
    "custom_node_color[specific_award_node[0]] = 'r'\n",
    "\n",
    "#Create networkx nodes for the employees that worked on that node \n",
    "for item in associated_employees:\n",
    "    G.add_node(item)\n",
    "    custom_node_color[item] = 'c'\n",
    "    custom_labels[item] = str(item)\n",
    "    # We know at each of these employees are connected to the award, so lets draw those relationshipd \n",
    "    # Note, in Networkx relationships are called edges \n",
    "    G.add_edge(item, award_node)\n",
    "    \n",
    "\n",
    "print G.nodes()\n",
    "nx.draw(G,labels=custom_labels, node_color=custom_node_color.values())\n",
    "plt.show()\n",
    "\n",
    "\n",
    "# Idk why we always get a bonus None node, i like to thnk of it as a gift "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " We just created aplot of all the employees worked on an award\n",
    " \n",
    " Employees also have realtionhsips with each other, the employees that worked with them\n",
    " \n",
    "\n",
    "### Write a function that accepts  a Cypher Query, and returns a networkx graph. Also, have your function plot the graph \n",
    "\n",
    "Hint: graph_db.cypher.execute(\"MATCH (n {employeeid:'704'}) -[r:worked_with] -> (b) RETURN b;\") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Subgraph order=3 size=0>\n",
      "[u'90023086', u'90002600', u'12363']\n",
      "['Orinianl Employee', u'12363', u'90002600', u'90023086', None]\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd8AAAFBCAYAAAA2bKVrAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAH+VJREFUeJzt3Xtw1OXd9/FPkINJNhsSkkAMglIQSCCJoCPcgggItmA9\nMK3Sx8N9G0exdNApjzHUivqIT0efOKRQhyZYaKstiafI1IIg0Vq11rEix8RToSVDOBgIWbJh2V3I\n9/kjYZsIKodwbRLer5kMye+3V/bK/vPmd44xMxMAAHCmW7QnAADAuYb4AgDgGPEFAMAx4gsAgGPE\nFwAAx4gvAACOEV8AABwjvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QXAADHiC8AAI4RXwAAHCO+\nAAA4RnwBAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAAjhFfAAAcI74AADhGfAEAcIz4AgDgGPEF\nAMAx4gsAgGPEFwAAx4gvAACOEV8AABwjvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QXAADHukd7\nAgCAc5PP59P+/fslSX369FFiYmKUZ+QOW74AAGeCwaBKS0s1PjdXGampmpyTo8k5OcpITdX43FyV\nlpYqFApFe5pnXYyZWbQnAQDo+l4oK9P9s2ZppJlmNzTo+/rP7tewpNckLfF4tLVbNy0qKdEtM2dG\nb7JnGfEFAJx1ixcu1NMPP6xXAwGN/pbXrpd0U1ycHliwQPfNneties4RXwDAWfVCWZny8/L0XiCg\nASc5plrSuLg4FS5b1iW3gDnmCwCI+OSTTzRp0iT17t1bQ4YM0cqVKyPr3nzzTQ0bNkzx8fGaNGmS\nqqur24wtKChQSkqKUlJSNG/ePEnNx3jvnzVLSwIB/bekeEnDJb3ZatwqSeMkJUlKl3S3pGRJrx46\npPtnzVIoFFJFRYVGjRolj8ejCy+8UC+99FJk/MaNGzV69GjFx8frsssu06ZNm9rMq6ioSOnp6UpM\nTNRdd93VMY4pGwAAZhYOh23IkCFWVFRkTU1N9tZbb1l8fLx9/vnnVltba16v115++WULBoOWn59v\nY8aMiYwtLi62oUOHWk1NjdXU1FhmZqYVFxfbihUrbLLHY2Mk+9+SHZbsFcl6S1YrmUm2QrK1kgUk\nOyDZ9yS7t2XdJI/HCgsLLS0tzdasWWNHjx61uro627Ztm5mZBYNBGzBggP3yl7+0UChkixcvtoED\nB1ooFDIzszVr1ljfvn2tqqrKDhw4YFdffbXNmzcvKp9va8QXAGBmZlu2bDGPx9Nm2dSpU23+/PlW\nUlJiV155ZWR5Y2OjxcbG2meffWZmZmPHjrVnn302sn758uU2ZswYG5eTY7+SrJdk/pagmmRXSVbc\n6ufWX+WSjWz5/mXJUnv3tkceeeSEc167dq1lZGS0WTZgwABbu3atmZn96Ec/sp///OeRdW+99Zb1\n69fvzD6odsBuZwDA12pqatLWrVtVVVWl7OzsyPK4uDgNHjxYlZWVkqSqqirl5ORE1mdnZ6uyslIb\nqqrUT9IgNe9yPiZHUuXXvOdfJY1o+f56Sfvq6xUIBJSdna0LLrhAt99+uw4cOCBJqqysbDMvScrJ\nyfnGee3duzcyPlqILwBAkjR06FClpaWpsLBQ4XBYb7zxht555x0dOnRIfr//uJtgeL1eNTQ0SNJx\n671er/x+v1J79VJA0ldvn+GV1HCCOayT9Jykx1t+7iHJJJWVlam8vFxffPGFAoGA5syZc8L3PZl5\nSYqsjxbiCwCQJPXo0UMrV67UqlWrlJ6eroULF+rmm29W//795fF4dPDgwTav9/l8SkhIkKTj1vt8\nPsXHN2/reiS1HSnVqznArX0g6VZJr0ga3Gp5jKQf/OAHGjx4sOLj4/XQQw9p9erVJ3xfSaqvr//G\neUmKrI8W4gsAiBg5cqTefvtt7du3T2vWrNG2bdt0xRVXKCsrq81ZxI2Njdq2bZuysrIkSVlZWdq4\ncWNk/aZNm5SZmanaYFCXSNouyd/qfTZJymr18wZJN0j6naSJrZaHJcXExCg2NvaE883KytLmzZvb\nLNuyZcs3zqtv375KSko6uQ/kbIn2QWcAQMexefNmCwQC1tjYaIWFhTZo0CALhUL25ZdfWmJior3y\nyisWCAQsPz/fxo4dGxlXXFxsw4cPt5qaGtu5c6dlZmZaSUmJjcvJsVckGyPZAy1nNB8723lfy0lV\nWyRLk+zFE5x89bJkQy680C6++GLbvn27NTY22g9/+EO74447zKz5bOeBAwfaokWL7PDhw7Zo0SK7\n6KKLLBwOm1nz2c79+vWzqqoqq6urswkTJtjPfvazqHy2rRFfAEBEfn6+JSUlmcfjsWnTpkUu6TEz\nq6iosGHDhllsbKxNnDjRduzY0Wbsgw8+aMnJyZacnGwFBQVmZpFLjf4t2dWSxUo2TLI3WwX2TsnO\nk8zT6mvEsUuNEhKstLTUHn30UUtNTbXU1FS74447rL6+PvK+GzZssNGjR1tsbKyNHj3aNm7c2GZe\nCxcutL59+5rX67W8vLzIZUjRxB2uAABnzdatWzU2N1d/PXpUo05x7HpJ071eVdfWqmfPnmdjelHD\nMV8AQLtramrSr371K1199dX6we2368bYWFV/+7CIajXf33lRSUmXC6/E83wBAO1sx44dysvL06FD\nh/T+++/rkksu0eKRIzXuNB6s0BXv6yyx5QsAaCdmpt/+9re67LLLNGXKFL377ru65JJLJEn3zZ2r\nwuXLNd3r1TUej8olHWk1NqzmS4wmJyRouterwmXLuuwTjSSeagQAaAd79uzRPffco+rqaj333HPH\n3XXqmFAopPLyci156il9XFmplJZdyvtCIY3KytLsggLNmDGjS+5qbo34AgDOyIsvvqg5c+bo7rvv\n1iOPPHLS4fT5fKqrq5MkJScnH3enqq6M+AIATktdXZ1+8pOf6OOPP9Zzzz2nK664ItpT6jQ45gsA\nOGWrV69Wdna2+vbtqw0bNhDeU8TZzgCAk9bQ0KC5c+dq3bp1ev755zVx4sRvH4TjsOULADgpb7/9\ntrKzs2Vm2rx5M+E9A2z5AuhQfD6f9u/fL0nq06fPOXUSTkcVCAT00EMP6cUXX9TSpUs1ffr0aE+p\n02PLF0DUBYNBlZaWanxurjJSUzU5J0eTc3KUkZqq8bm5Ki0tVSgUivY0z0kffvihLr30Uu3evVub\nN28mvO2Es50BRNULZWW6f9YsjTTT7IYGfV//2SUXlvSapCUej7Z266ZFJSVd9o5HHU0oFNKCBQu0\ndOlSLV68WLfccku0p9SlsNsZQNQsXrhQTz/8sFZ9zS0He0iaIWmG3998y8G77tLeXbu69J2POoIt\nW7bojjvuUEZGhjZu3Kj09PRoT6nLYbczgKh4oaxMTz/8sN47iXv9StJoSe8dOqSn58/XC2VlZ3t6\n56SjR4/qySef1KRJkzRnzhy99tprhPcsIb4A2tUzzzyjyy67TOeff77uvPPOyPIPPvhAU6ZMUZ8+\nfZSWlqb/vv12/SYQ0ICW9UWSviPJK6mvpDslNXzld78qqenQIf3oRz/S8OHD9cUXX0iS/vKXvyg7\nO1tJSUlKTk7W1KlTVVVVdbb/1C7liy++0Pjx4/XGG2/oo48+Ul5enmJiYqI9rS6L+AJoVxkZGZo/\nf77y8vLaLK+vr9e9996rHTt2qLCwUMlqDu4xN0j6SNJBSZ+q+ZFy/7fV+t9IWi6pQtJEj0c//vGP\nlZKSIknKysrS66+/rgMHDmjv3r269NJLj3t/nFhTU5OeeeYZjR07VjNnzlRFRYUGDhwY7Wl1eRzz\nBdCubrrpJknSRx99pJ07d0aWf/e73418/5uiIs09ckSPtxo3qNX3TWreMkhv9fP/kfScpGGSZvv9\nWvTb3+q+++6TJKWlpf1nbFOTunXrxu7Sk1BdXa28vDz5/X797W9/09ChQ6M9pXMGW74Azoqvu5DC\n5/NpQ1WVYiSN+Mq6FZISJaW2fN3fsnynpBpJWyQNkJQv6YPNm1VfXx8ZW11draSkJMXFxWnVqlVa\ntmxZe/45HZbP59P27du1fft2+Xy+kxpjZvrd736n0aNHa/LkyXrvvfcIr2PEF8BZ8XXHC/fv36/E\n7t31C0mFX1n3vyT5JH0u6RP9Z7f0se3ndZK2SvqLmgNSXFwcGTtgwAAdOHBA+/btU05OTpvjzV3N\nmVwXvWfPHt14440qKipSRUWFfvazn6l7d3aCukZ8AZwVX7fl++9//1t7Dx/WYklXfs3YwZLmqXk3\nsyTFtvz7oJpPyBooKa5bN/3xj3/UG2+8oa1bt6qurk5mpqSkJD399NN67bXXdPDgwfb7gzqIF8rK\nNDAtTctnzdLcTZtUHw7rX36//uX360A4rJ9u2qRl99yjAampx50V/vLLLys3N1cjRozQhx9+qJyc\nnCj9FeC/OwDOihNt+e7YsUN33nmnzuvWTTcfPfqN48OS4lq+Hyqp51fWHWpqUn19vQoLC7Vr1y7t\n2rVLgUBA6enpSk5OliTNmzdPF154odLT03XBBRdE/k1OTu6UZ/Ke7nXRt/3P/2jOnDn66KOPtHLl\nSo0ZM8btxHEc4gugXR09elThcFhHjhzR0aNHFQwG1b17d+3Zs0eTJk3Sfffdp5XPP6/XNm3SjFbj\nfqPmM55TJVVJelLSsfOV4yTdIun/SbpUzceGe/Tsqccff1x33nmnXn31VWVlZSkjI0NVVVUqKCjQ\nqFGjNGzYMO3atUuffvppJNC7d+9WY2PjcUE+0b99+vTpMJFufV30gG9/eeS66LEPPaTHnnhCt99+\nuzZs2KC4uLhvHYuzj9tLAmhXjz32mB5//PE2yx599FHFxMToscceU3x8vI4cOaLw4cOKU/OlRVJz\naFdLapR0gaS71Hxi1bH0NUi6R9IqSaGYGF3/gx/oxRdflNR8bfHChQv15ZdfKikpSdOmTdOTTz6p\npKSkE84xEAhoz549kRi3/rf1942NjerXr1+bKJ8o1Gc70sFgUAPT0rT64EGNOsWx6yVdGxenXQcO\nqGfPnt/6erhBfAE4d6Yxme71qrq29qzH5PDhw9q9e/c3Bnr37t3y+/3q16/f125Ft96S7tbt1E+1\nKS0t1bJ77lGF339af8dkj0d3P/usZnJf7A6D+AKIihfKypSfl3fSu1Gl5htvjIuLU+GyZR3qAQuH\nDx8+bkv6RFvVfr9fffv2/cbd3ce2pFtHenxurn76ld30p+IVSYtyc/XOhg3t8vfizBFfAFFz7ASi\nV0/i/s7rJd0UF6cHFizotA9WOBbpbwr07t27dfDgwciWdGpqqt58/XU1NDWd9kk6YUlJPXqopraW\n5yN3EJxwBSBq7ps7V30vuEDTZ83SiKYmzfb7db3aPlLwT5KWJCSoMiam0z9S8Pzzz9dFF12kiy66\n6BtfFwwGI1vSGzZs0MZ169T9DJ5n3ENSSs+eqqurI74dBFu+AKIuFAqpvLxcS556Sh9XViql5Vju\nvlBIo7KyNLugQDNmzDgnTxjavn27Jufk6F+nebz3mIvi4/WXLVt08cUXt9PMcCaIL4AOxefzqa6u\nTpKUnJx8zm+p+Xw+ZaSm6kA4rB6n+TvY7dzxsNsZQIeSmJhIIFpJTEzUpZmZx10XfSr+JGlUVhaf\nawfC7SUBoIObXVCgJR7PaY9fkpCg2QUF7TgjnCl2OwNAB9dZrovGyWPLFwA6uF69emlRSYlujI1V\n9SmMq5Y0rVs3PbV4MeHtYIgvAHQCt8ycqQeeeELjYmO1/iRev17SuNhYDb7sMi1durTNs48RfcQX\nADqJ++bOVeHy5Zru9eoaj0flko60Wh9W892sJickaLrXq8Lly/Xu3/+uyy+/XJMmTVJtbW10Jo7j\ncMwXADqZU70u2sz06KOP6qWXXlJFRYUyMjKiOX2I+AJAp3Yq10UXFhbq17/+tSoqKjRo0CBXU8QJ\ncJ0vAHRip3JddH5+vhISEjRhwgStXbtWmZmZZ3l2+DrEFwDOIffee688Ho8mT56sVatWadSoU714\nCe2B+ALAOea2226Tx+PR9773PZWXl+vKK6+M9pTOORzzBYBz1Lp163Trrbfqj3/8o6ZMmRLt6ZxT\nuNQIAM5RU6ZMUXl5uW699VatXLky2tM5p7DbGQDOYePGjdOaNWs0ffp0+f1+3XbbbdGe0jmB+ALA\nOW7UqFF68803de2118rv9+vee++N9pS6POILAFBmZqb++te/6pprrlFDQ4Py8/OjPaUujfgCACRJ\ngwYN0rvvvqtrrrlGBw8e1OOPP66YmJhoT6tL4mxnAEAbtbW1mjp1qiZMmKCFCxeqWzfOzW1vxBcA\ncJz6+npNnz5dw4YN09KlS3XeeedFe0pdCvEFAJxQY2OjbrjhBiUnJ+sPf/gDzwRuR+xLAACcUHx8\nvP785z8rFArppptuUiAQiPaUugziCwD4Wueff75eeukl9e7dW9OmTVNDQ0O0p9QlsNsZAPCtjh49\nqtmzZ2vjxo16/fXXlZycfMLX+Xw+7d+/X5LUp0+fk37i0rmGLV8AwLc677zzVFxcrPHjx+vqq6/W\n3r17I+uCwaBKS0s1PjdXGampmpyTo8k5OcpITdX43FyVlpYqFApFcfYdD1u+AICTZmZ64okn9Pzz\nz6uiokJ/f/993T9rlkaaaXZDg76v/9xAIizpNUlLPB5t7dZNi0pKdMvMmdGbfAfCTTYAACctJiZG\n8+fPV0JCgi7LzVWvQECrDh/W6BO8toekGZJm+P1aL+mmu+7S3l27dN/cuW4n3QERXwDAKUvv10/d\n/X79LRzWgJN4/WhJ7x06pHHz56vvBRec81vAHPMFgC7uk08+0aRJk9S7d28NGTKkzeMD33zzTQ0b\nNkzx8fGaNGmSqqur24wtKChQSkqKUlJSNG/ePEnNx3jn3H23ssNhjZXUW9I4SR+2GvcXSdmSkiQl\nS5oqyS/p1UOHdP+sWWpoaFBeXp4SExOVnp6uoqKiNu/73nvv6fLLL1diYqK+853v6Nlnn22zfvv2\n7bruuuvk9XqVmpqqgoKCdvmsnDEAQJcVDodtyJAhVlRUZE1NTfbWW29ZfHy8ff7551ZbW2ter9de\nfvllCwaDlp+fb2PGjImMLS4utqFDh1pNTY3V1NRYZmamFRcX24oVK+y/4uKsSLI9kjVJtlSyFMn8\nkplkeyXb2fJ9SLIHJbui5edJHo9df/31dtVVV1l9fb198skn1q9fP1uzZo2ZmR05csRSUlJs6dKl\nZmb2j3/8wzwej23atMnMzILBoA0aNMiKiors0KFDFgwGbfPmze4/3DNAfAGgC9uyZYt5PJ42y6ZO\nnWrz58+3kpISu/LKKyPLGxsbLTY21j777DMzMxs7dqw9++yzkfXLly+3MWPG2LicHHulJaStv7yS\nfXyC5YclmyfZjS0/vyxZzx49bN26dZHf/cgjj9jMmTPNzKympsZiYmIsEAhE1l9++eVWVlZmZmYl\nJSV21VVXtf+H5RC7nQHgHNPU1KStW7eqqqpK2dnZkeVxcXEaPHiwKisrJUlVVVXKycmJrM/OzlZl\nZaU2VFXp+q/8zo2SQpIGt1pWrebdznGSVkn6Tcvy8ZJC4bAuvvji4363JKWnpys7O1vLly/X0aNH\n9f7772vHjh0aN26cJOmDDz7QwIEDNW3aNKWmpmrixInaunXrmX8wDhFfAOjChg4dqrS0NBUWFioc\nDuuNN97QO++8o0OHDsnv9x93Ewyv1xu5i9VX13u9Xvn9fqX26tXmbN2Dkm6X9JikhFbLB0g6IGmf\npBxJeS3Lgy3/Hjly5ITvGxMTo6VLl+rRRx/V+eefrwkTJugXv/iFMjIyJEk7d+5UWVmZ7r//fu3e\nvVvTp0/XDTfcoHA4fCYflVPEFwC6sB49emjlypVatWqV0tPTtXDhQt18883q37+/PB6PDh482Ob1\nPp9PCQnNCf3qep/Pp/j4+DavD0j6vqT/kvR1pzwlSXpazdf8HpTkaVnu9/tP+L41NTW67rrrtGLF\nCoXDYVVWVuqpp57S6tWrJUmxsbEaP368rr32WnXv3l0PPPCA9u/fr08//fR0PqKoIL4A0MWNHDlS\nb7/9tvbt26c1a9Zo27ZtuuKKK5SVlaVNmzZFXtfY2Kht27YpKytLkpSVlaWNGzdG1m/atEmZmZmq\nDQYVVvMW7I1q3sIt+ZY5hNUcnF5qjm+MmrdgW//uESNGSJLef/999e/fX1OmTJEkXXLJJZo+fbpe\nf/11SWqzK1xqvvFHpxPtg84AgLNr8+bNFggErLGx0QoLC23QoEEWCoXsyy+/tMTERHvllVcsEAhY\nfn6+jR07NjKuuLjYhg8fbjU1NbZz507LzMy0kpISG5eTYy9Idl3LSVRHTnCSVblkn0l2VLIvJfuh\nZN9vdcJV/7Q0mzBhgh04cMCqqqqsX79+tnbtWjMzq6ystLi4OHvrrbesqanJ/vnPf9rgwYMjJ399\n9tlnFhcXZxUVFXbkyBFbuHChDR482MLhcFQ+39NBfAGgi8vPz7ekpCTzeDw2bdo027ZtW2RdRUWF\nDRs2zGJjY23ixIm2Y8eONmMffPBBS05OtuTkZCsoKDAzsxUrVtio2FiLkSxeMk+rr/daAvsryS5u\nWd9fsnskqzt2qVFCgj3//POWl5dnXq/X+vbta0VFRW3e9/e//70NHz7cEhISrH///jZv3jxramqK\nrC8vL7fBgweb1+u1iRMnWlVV1Vn8BNsf93YGAJySYDCogWlpWn3woEad4tj1kqZ7vaqurVXPnj3P\nxvQ6BY75AgBOSa9evbSopEQ3xsaq+ttfHlEt6aa4OC0qKTmnwysRXwDAabhl5kw98MQTGhcbq/Un\n8fr1ksbFxemBBQvO+fs6SzxSEABwBl4oK9P9s2ZpRFOTZvv9ul5tHyn4J0lLEhJUGRPDIwVbIb4A\ngDMSCoVUXl6uJU89pY8rK5XSskt5XyikUVlZml1QoBkzZpzzu5pbI74AgHbj8/lUV1cnSUpOTj7u\nDlpoRnwBAHCME64AAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAAjhFfAAAcI74AADhGfAEAcIz4\nAgDgGPEFAMAx4gsAgGPEFwAAx4gvAACOEV8AABwjvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QX\nAADHiC8AAI4RXwAAHCO+AAA4RnwBAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAAjhFfAAAcI74A\nADhGfAEAcIz4AgDgGPEFAMAx4gsAgGPEFwAAx4gvAACOEV8AABwjvgAAOEZ8AQBwjPgCAOAY8QUA\nwDHiCwCAY8QXAADHiC8AAI4RXwAAHCO+AAA4RnwBAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAA\njhFfAAAcI74AADhGfAEAcIz4AgDgGPEFAMAx4gsAgGPEFwAAx4gvAACOEV8AABwjvgAAOEZ8AQBw\njPgCAOAY8QUAwDHiCwCAY8QXAADHiC8AAI4RXwAAHCO+AAA4RnwBAHCM+AIA4BjxBQDAMeILAIBj\nxBcAAMeILwAAjhFfAAAcI74AADhGfAEAcIz4AgDgGPEFAMAx4gsAgGPEFwAAx4gvAACOEV8AABwj\nvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QXAADHiC8AAI4RXwAAHCO+AAA4RnwBAHCM+AIA4Bjx\nBQDAMeILAIBjxBcAAMeILwAAjhFfAAAcI74AADhGfAEAcIz4AgDgGPEFAMAx4gsAgGPEFwAAx4gv\nAACOEV8AABwjvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QXAADHiC8AAI4RXwAAHCO+AAA4RnwB\nAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAAjhFfAAAcI74AADhGfAEAcIz4AgDgGPEFAMAx4gsA\ngGPEFwAAx4gvAACOEV8AABwjvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QXAADHiC8AAI4RXwAA\nHCO+AAA4RnwBAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAAjnWP9gTQvnw+n/bv3y9J6tOnjxIT\nE6M8IwDAV7Hl2wUEg0GVlpZqfG6uMlJTNTknR5NzcpSRmqrxubkqLS1VKBSK9jQBAC1izMyiPQmc\nvhfKynT/rFkaaabZDQ36vv6zOyMs6TVJSzwebe3WTYtKSnTLzJnRmywAQBLx7dQWL1yopx9+WK8G\nAhr9La9dL+mmuDg9sGCB7ps718X0AABfg/h2Ui+UlSk/L0/vBQIacJJjqiWNi4tT4bJlbAEDQBQR\n304oGAxqYFqaVh88qFGnOHa9pOler6pra9WzZ8+zMT0AwLfghKtOqLy8XCOamk45vJI0WlJWU5PK\ny8vbe1oAgJPElm8nND43Vz/dtEkzTnP8K5IW5ebqnQ0b2nNaAICTRHw7GZ/Pp4zUVNWHw6d9kXZY\nUlKPHqqpreU6YACIAnY7dzL79+9Xaq9eZ3R3lB6SUnr2VF1dXXtNCwBwCogvAACOEd9Opk+fPqoN\nBhU+g98RlrQvFFJycnJ7TQsAcAqIbyeTmJioSzMz9doZ/I4/SRqVlcXxXgCIEuLbCc0uKNASj+e0\nxy9JSNDsgoJ2nBEA4FRwtnMnxE02AKBzY8u3E+rVq5cWlZToxthYVZ/CuGo13995UUkJ4QWAKCK+\nndQtM2fqgSee0LjYWK0/idevV/N9nR9YsID7OgNAlLHbuZM79kjBEU1Nmu3363q1faTgn9R8jLcy\nJoZHCgJAB0F8u4BQKKTy8nIteeopfVxZqZSWXcr7QiGNysrS7IICzZgxg13NANBBEN8uxufzRe5c\nlZyczOVEANABEV8AABzjhCsAABwjvgAAOEZ8AQBwjPgCAOAY8QUAwDHiCwCAY8QXAADHiC8AAI4R\nXwAAHCO+AAA4RnwBAHCM+AIA4BjxBQDAMeILAIBjxBcAAMeILwAAjhFfAAAcI74AADhGfAEAcIz4\nAgDgGPEFAMAx4gsAgGPEFwAAx4gvAACOEV8AABz7/012LLRvQ957AAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f418eb841d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/plain": [
       "<networkx.classes.graph.Graph at 0x7f418eb84150>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def employee_peers():\n",
    "    \"\"\"\n",
    "    \n",
    "    \"\"\"\n",
    "    # Collect Employees that worked with that Employee \n",
    "    \n",
    "    peer_employees = graph_db.cypher.execute(\"MATCH (n {employeeid:'704'}) -[r:worked_with] -> (b) RETURN b;\")\n",
    "    subgraph = graph_db.cypher.execute(\"MATCH (n {employeeid:'704'}) -[r:worked_with] -> (b) RETURN b;\").to_subgraph()\n",
    "    num_peer_employees = peer_employees.to_subgraph().order\n",
    "    print subgraph\n",
    "    \n",
    "    # Convert that RecordList to a list object \n",
    "    peer_employees = recordlist_to_list(peer_employees, \"employeeid\", num_peer_employees)\n",
    "    print peer_employees\n",
    "    \n",
    "    # Create the Networkx Graph \n",
    "    G=nx.Graph()\n",
    "    \n",
    "    # Distonarys to contain and labels\n",
    "    custom_labels     = {}\n",
    "    \n",
    "    # I know that there is one employee that is the connector between all these other employees, \n",
    "    # so ill create a dummby node to represent them\n",
    "    origin_employee = G.add_node(\"Orinianl Employee\")\n",
    "    \n",
    "    # Create that employee's peers \n",
    "    for employee in peer_employees:\n",
    "        G.add_node(employee)\n",
    "        custom_labels[employee] = str(employee)\n",
    "        # We know this employee worked with the origin emplyee, so lets connect them \n",
    "        G.add_edge(employee, origin_employee)\n",
    "\n",
    "        \n",
    "    # Draw and Display the Plot \n",
    "    print G.nodes()\n",
    "    nx.draw(G, labels=custom_labels)\n",
    "    plt.show()\n",
    "    \n",
    "    Return the Graph Object \n",
    "    return G \n",
    "        \n",
    "        \n",
    "employee_peers()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Anaylsing Networks "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 189,
   "metadata": {
    "collapsed": false,
    "nbgrader": {
     "grade": false,
     "grade_id": "sum_of_squares",
     "locked": false,
     "solution": true
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Subgraph order=0 size=0>"
      ]
     },
     "execution_count": 189,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.cypher.execute(\"MATCH (n {employeeid:'704'}) -[r:worked_with] -> (b) RETURN b.employeeid AS employeeid;\").to_subgraph()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "nbgrader": {
     "grade": true,
     "grade_id": "correct_sum_of_squares",
     "locked": true,
     "points": 1,
     "solution": false
    }
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "nbgrader": {
     "grade": true,
     "grade_id": "sum_of_squares_uses_squares",
     "locked": true,
     "points": 1,
     "solution": false
    }
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "celltoolbar": "Create Assignment",
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
