{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Networks and Neo4j\n",
    "\n",
    "This chapter will go over the basics on how to connect to a neo4j database, query the database, and analyse data.  \n",
    "\n",
    "Before you begin this lesson,\n",
    "\n",
    "* Read though the Instalation Guide \n",
    "* Start you neo4j server (You should be able to over console in the browser.)\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Programing\\Anaconda\\lib\\site-packages\\IPython\\config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.\n",
      "  \"You should import from traitlets.config instead.\", ShimWarning)\n",
      "C:\\Programing\\Anaconda\\lib\\site-packages\\IPython\\utils\\traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.\n",
      "  warn(\"IPython.utils.traitlets has moved to a top-level traitlets package.\")\n",
      "C:\\Programing\\Anaconda\\lib\\site-packages\\pandas\\computation\\__init__.py:19: UserWarning: The installed version of numexpr 2.4.4 is not supported in pandas and will be not be used\n",
      "\n",
      "  UserWarning)\n"
     ]
    }
   ],
   "source": [
    "# Imports \n",
    "import sys\n",
    "from py2neo import authenticate,neo4j, Graph, Relationship\n",
    "from py2neo.cypher import CypherWriter\n",
    "#import MySQLdb\n",
    "import pymysql\n",
    "import numpy as np\n",
    "\n",
    "# load the cypher cell magic extention\n",
    "%load_ext cypher\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Connecting to the Neo4j Database \n",
    "\n",
    "There are two ways we are going to connect to our Neo4j Databases: The first method is by using the py2neo modual and the second is by using ipython cell magic.\n",
    "\n",
    "We will begin by creating a connection via py2neo. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Graph uri=u'http://localhost:7474/db/data/'>\n"
     ]
    }
   ],
   "source": [
    "# Set up connection to Ne04j local Database \n",
    "# You will need to authenticate your connection, use the next line as an example \n",
    "# authenticate(\"localhost:7474\", \"YOUR USENAME HERE, Default is: neo4j\", \"<YOUR PASSWORD HERE >\")\n",
    "\n",
    "# set up authentication parameters\n",
    "authenticate(\"localhost:7474\", \"neo4j\", \"upintheA1R!!\")\n",
    "\n",
    "# Create a variable for our graph and print our connection infomation\n",
    "graph_db = Graph()\n",
    "print graph_db\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Testing our connection\n",
    "To extract data from our database, we can pass cypher commands to py2neo using the cypher.execute() command.\n",
    "\n",
    "Run the cell below to tell py2neo to return a single node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | n                                                           \n",
       "---+--------------------------------------------------------------\n",
       " 1 | (n29668:Employee {employeeid:\"90014540\",position:\"FACULTY\"})"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db.cypher.execute(\"MATCH (n) RETURN n limit 1\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Connecting via Cell Magic \n",
    "\n",
    "Since we are using ipython notebook, we can also extract data from our database using the Cypher ipython cell magic. Cell magic are commands that begin with the '%' symbol .\n",
    "\n",
    "The % command means the current line is using cell magic\n",
    "The %% command mean the entire cell is using cell magic \n",
    "\n",
    "To connect to the database via cell magic, use the command, \n",
    "\n",
    "** %%cypher http://<YOUR USENAME HERE, Default is: neo4j>: <YOUR PASSWORD HERE>@localhost:7474/db/data  **\n",
    "\n",
    "followed by a cypher command.\n",
    "\n",
    "Run the cell below to tell py2neo to return a single node.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>n</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{u'position': u'FACULTY', u'employeeid': u'90014540'}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{u'employeeid': u'90014540', u'position': u'FACULTY'}]]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:upintheA1R!!@localhost:7474/db/data \n",
    "Match (n) RETURN n limit 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Quick Review of Neo4j and Cypher \n",
    "\n",
    "When you think of data, you probably imagine an excel table where each row is an individual observation or data point. \n",
    "For example, \n",
    "\n",
    "|name | age | employee_id|\n",
    "|-----|-----|------------|\n",
    "|Joe  |  34 |   12345    |\n",
    "|Ann  |  54 |   12346    |\n",
    "    \n",
    "In a graph database, that row is more like a ball. \n",
    "\n",
    "\n",
    "##### (node: Employee {name:Joe, age: 34, employee_id: 12345})\n",
    "\n",
    "This ball is called a \"node\" in Neo4j. In fact, the little parentheses around Joe's information are designed to help the user think of Joe's information as a little ball. \n",
    "\n",
    "All the information about Joe is still there, but it's just not in a flat table format. Instead of storing each peice of Joe's information in a variable column, Joe's information is stored as **properties**, ie name, age, employee_id.\n",
    "Joe's node also has a **label**, *Employee*, to identify this node as belonging to an employee.\n",
    "\n",
    "Neo4j uses the Cypher Query Language to get information out of the Database. \n",
    "\n",
    "##### Components of a simple Cypher Query:\n",
    "+ MATCH      \n",
    "     - Essentially the same thing as SELECT in SQL \n",
    "+ (n)        \n",
    "    - Any node (the n is just a variable, could be any letter) \n",
    "+ RETURN     \n",
    "    - Needed in every query \n",
    "+ LIMIT      \n",
    "    - Same as in SQL \n",
    "\n",
    "The following query will return 20 nodes from the database:  \n",
    "##### graph_db.cypher.execute(\"MATCH (n) RETURN n LIMIT 20\")\n",
    "\n",
    "If I wanted to query just Award nodes, I would run this query;  \n",
    "##### graph_db.cypher.execute(\"MATCH (n:Award) RETURN n LIMIT 20\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "    | n                                  \n",
       "----+-------------------------------------\n",
       "  1 | (n27418:Award {award_num:\"aw1000\"})\n",
       "  2 | (n27419:Award {award_num:\"aw1001\"})\n",
       "  3 | (n27420:Award {award_num:\"aw1002\"})\n",
       "  4 | (n27421:Award {award_num:\"aw1003\"})\n",
       "  5 | (n27422:Award {award_num:\"aw1004\"})\n",
       "  6 | (n27423:Award {award_num:\"aw1005\"})\n",
       "  7 | (n27424:Award {award_num:\"aw1006\"})\n",
       "  8 | (n27425:Award {award_num:\"aw1007\"})\n",
       "  9 | (n27426:Award {award_num:\"aw1008\"})\n",
       " 10 | (n27427:Award {award_num:\"aw1009\"})\n",
       " 11 | (n27428:Award {award_num:\"aw1010\"})\n",
       " 12 | (n27429:Award {award_num:\"aw1011\"})\n",
       " 13 | (n27430:Award {award_num:\"aw1012\"})\n",
       " 14 | (n27431:Award {award_num:\"aw1013\"})\n",
       " 15 | (n27432:Award {award_num:\"aw1014\"})\n",
       " 16 | (n27433:Award {award_num:\"aw1015\"})\n",
       " 17 | (n27434:Award {award_num:\"aw1016\"})\n",
       " 18 | (n27435:Award {award_num:\"aw1017\"})\n",
       " 19 | (n27436:Award {award_num:\"aw1018\"})\n",
       " 20 | (n27437:Award {award_num:\"aw1019\"})"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# You can use this cell to Test the Cypher Queries \n",
    "graph_db.cypher.execute(\"MATCH (n:Award) RETURN n LIMIT 20\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cypher Examples \n",
    "\n",
    "The below are some examples of different cypher commands.\n",
    "\n",
    "You can comment and uncomment the different commands to get the same infomation with py2neo and %cypher\n",
    "\n",
    "Note: While both tools are extracting the same infomation, they return that data back to use slightly differently. Py2neo returns a RecordList object. Cypher will return a dataframe type object"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20 rows affected.\n",
      "+-------------------------------------------------------+\n",
      "|                           e                           |\n",
      "+-------------------------------------------------------+\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90026679'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90017693'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90028696'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90013819'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90001118'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90001300'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90023086'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90017074'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90025003'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90000321'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90001779'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90012327'} |\n",
      "|   {u'position': u'FACULTY', u'employeeid': u'6663'}   |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90028695'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90013011'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90004139'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90002533'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90022882'} |\n",
      "| {u'position': u'FACULTY', u'employeeid': u'90027179'} |\n",
      "+-------------------------------------------------------+\n"
     ]
    }
   ],
   "source": [
    "# Collect 20 Employee Nodes \n",
    "\n",
    "#node_query_single =  graph_db.cypher.execute(\"MATCH (a:Award), (e:Employee) RETURN a,e LIMIT 20\")\n",
    "\n",
    "node_query_single =  %%cypher http://neo4j:upintheA1R!!@localhost:7474/db/data  MATCH (e:Employee) RETURN e LIMIT 20\n",
    "print node_query_single"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20 rows affected.\n",
      "+---------------------------+-------------------------------------------------------+\n",
      "|             a             |                           e                           |\n",
      "+---------------------------+-------------------------------------------------------+\n",
      "| {u'award_num': u'aw1000'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1001'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1002'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1003'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1004'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1005'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1006'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1007'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1008'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1009'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1010'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1011'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1012'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1013'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1014'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1015'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1016'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1017'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1018'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "| {u'award_num': u'aw1019'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} |\n",
      "+---------------------------+-------------------------------------------------------+\n"
     ]
    }
   ],
   "source": [
    "# Collect 20 Award Nodes and 20 employee Nodes \n",
    "\n",
    "# node_query_multiple =  graph_db.cypher.execute(\"MATCH (a:Award), (e:Employee) RETURN a,e LIMIT 20\")\n",
    "\n",
    "node_query_multiple = %cypher http://neo4j:upintheA1R!!@localhost:7474/db/data MATCH (a:Award), (e:Employee) RETURN a,e LIMIT 20\n",
    "print node_query_multiple"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20 rows affected.\n",
      "+---------------------------+-------------------------------------------------------+----+\n",
      "|             a             |                           e                           | r  |\n",
      "+---------------------------+-------------------------------------------------------+----+\n",
      "| {u'award_num': u'aw1000'} | {u'position': u'FACULTY', u'employeeid': u'90014540'} | {} |\n",
      "| {u'award_num': u'aw1001'} | {u'position': u'FACULTY', u'employeeid': u'90026679'} | {} |\n",
      "| {u'award_num': u'aw1002'} | {u'position': u'FACULTY', u'employeeid': u'90017693'} | {} |\n",
      "| {u'award_num': u'aw1003'} | {u'position': u'FACULTY', u'employeeid': u'90028696'} | {} |\n",
      "| {u'award_num': u'aw1003'} | {u'position': u'FACULTY', u'employeeid': u'90028696'} | {} |\n",
      "| {u'award_num': u'aw1004'} | {u'position': u'FACULTY', u'employeeid': u'90013819'} | {} |\n",
      "| {u'award_num': u'aw1004'} | {u'position': u'FACULTY', u'employeeid': u'90013819'} | {} |\n",
      "| {u'award_num': u'aw1005'} | {u'position': u'FACULTY', u'employeeid': u'90001118'} | {} |\n",
      "| {u'award_num': u'aw1005'} | {u'position': u'FACULTY', u'employeeid': u'90001118'} | {} |\n",
      "| {u'award_num': u'aw1006'} | {u'position': u'FACULTY', u'employeeid': u'90001300'} | {} |\n",
      "| {u'award_num': u'aw1006'} | {u'position': u'FACULTY', u'employeeid': u'90001300'} | {} |\n",
      "| {u'award_num': u'aw1006'} | {u'position': u'FACULTY', u'employeeid': u'90001300'} | {} |\n",
      "| {u'award_num': u'aw1476'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1145'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1145'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1145'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1007'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1007'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1007'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "| {u'award_num': u'aw1007'} | {u'position': u'FACULTY', u'employeeid': u'90023086'} | {} |\n",
      "+---------------------------+-------------------------------------------------------+----+\n"
     ]
    }
   ],
   "source": [
    "# Return 20 relationshipswhere an Employee worked on an Award\n",
    "\n",
    "#relationsip_query = graph_db.cypher.execute(\"MATCH (a:Award) <-[r:WORKED_ON]- (e:Employee) RETURN r LIMIT 20\")\n",
    "\n",
    "relationsip_query = %%cypher http://neo4j:upintheA1R!!@localhost:7474/db/data MATCH (a) <-[r:WORKED_ON]- (e) RETURN a,e,r LIMIT 20\n",
    "print relationsip_query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "20 rows affected.\n",
      "+---------------+---------------+\n",
      "| e1.employeeid | e2.employeeid |\n",
      "+---------------+---------------+\n",
      "|    90000919   |    90028696   |\n",
      "|    90000919   |    90028696   |\n",
      "|    90024693   |    90013819   |\n",
      "|    90024693   |    90013819   |\n",
      "|    90001652   |    90001118   |\n",
      "|    90001652   |    90001118   |\n",
      "|    90025754   |    90001300   |\n",
      "|    90025754   |    90001300   |\n",
      "|    90025754   |    90001300   |\n",
      "|    90029620   |    90023086   |\n",
      "|    90029620   |    90023086   |\n",
      "|    90029620   |    90023086   |\n",
      "|    90026898   |    90023086   |\n",
      "|    90022371   |    90023086   |\n",
      "|    90004472   |    90023086   |\n",
      "|    90026898   |    90023086   |\n",
      "|    90022371   |    90023086   |\n",
      "|    90004472   |    90023086   |\n",
      "|    90026898   |    90023086   |\n",
      "|    90022371   |    90023086   |\n",
      "+---------------+---------------+\n"
     ]
    }
   ],
   "source": [
    "# Pattern Query \n",
    "# Retrun 20 instances of the pattern where two employees worked on the same award. Return only the employeeid of each employee  \n",
    "\n",
    "# pattern_query = graph_db.cypher.execute(\"MATCH (e1:Employee) --> (a:Award) <-- (e2:Employee) RETURN e1.employeeid, e2.employeeid LIMIT 20\")\n",
    "# print pattern_query.get_dataframe()\n",
    "\n",
    "pattern_query = %cypher http://neo4j:upintheA1R!!@localhost:7474/db/data MATCH (e1:Employee) --> (a:Award) <-- (e2:Employee) RETURN e1.employeeid, e2.employeeid LIMIT 20\n",
    "print pattern_query\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Using Python to Automate Cypher Tasks \n",
    "\n",
    "An advantage of using python to interface with neo4j is that you can send commands to neo4j in a saved and reproducable manner. In theory, all the work we did copying and pasting commands into neo4j in the instalation chapter can be replaced with python commands.\n",
    "\n",
    "To demonstrate this we will add some new Nodes and Relationships to our graph.\n",
    "\n",
    "Roke College prides itself on providing research opertunities for its Students. Students are often employeed by the university to provide research assistance to falcitly members on the awards they work on. \n",
    "\n",
    "To fully add the Students to the database we will need to \n",
    "    1. Load in the student nodes via a csv file \n",
    "    2. Create a WORKED_ON relationship between the students and the awards on which they work\n",
    "    3. Createa WORKED_WITH relationship between students and their peers who worked on the same awards \n",
    "    \n",
    "\n",
    "NOTE:\n",
    "\n",
    "    You may nottice that here we are using the MERGE command instead of the CREATE command to create relationships. This is done to prevent duplicate nodes and relationships from being created. A CREATE command will create a new node or relationship regarless of wheather that entitiy already exsists. The MERGE command will create that node or relationship only if it does not already exsist. \n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Load in Student Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "157 labels added.\n",
      "157 nodes created.\n",
      "314 properties set.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:upintheA1R!!@localhost:7474/db/data \n",
    "USING PERIODIC COMMIT\n",
    "LOAD CSV WITH HEADERS FROM \"file:///Users/lcdebaca/Documents/student_data.csv\" AS row\n",
    "CREATE (:Student {employeeid: row.employeeid, position: row.occupation_orig});"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Create Worked on Relationships with Awards "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "159 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:upintheA1R!!@localhost:7474/db/data \n",
    "USING PERIODIC COMMIT\n",
    "LOAD CSV WITH HEADERS FROM \"file:///Users/lcdebaca/Documents/award_data.csv\" AS row\n",
    "MATCH (a:Award {award_num: row.uniqueawardnumber})\n",
    "MATCH (s:Student {employeeid: row.employeeid})\n",
    "MERGE (s)-[r:WORKED_ON]->(a);"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Create Worked With relationships between the students and exsstiing staff "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "251 relationships created.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:upintheA1R!!@localhost:7474/db/data \n",
    "MATCH (n1)-[:WORKED_ON]->(a:Award)<-[:WORKED_ON]-(n2)\n",
    "MERGE (n1)-[r:WORKED_WITH]-(n2);\n",
    "                        "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### If you would like to see the new data, open your neo4j console. you'll see that we now have a new node label, Student. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Networkx\n",
    "### Plotting and Graph Anlysis \n",
    "\n",
    "Networkx is a python modual for creating, displaying and analysing graph data. \n",
    "\n",
    "We can load data from our neo4j graph into networkx by preforming queries and passing that data to networkx.\n",
    "\n",
    "Run the cell below to see an example"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "50 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'\\nNotes \\nGreen Nodes are Employees\\nYellow Nodes are Students\\nRed Nodes are Awards\\n\\n'"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzs3WdYVEfbwPH/0hZ2AUUBu2AXsbdHjUYxJhqMDaOJ3WCv\nqLHFEns39q5gJ4qxRMXejSWKWInYazRGUUSWpezuvB+IvBKKW1CSOL/r4kN258zM2ax7nzNn5h6F\nEEIgSZIkSVK2sMruDkiSJEnSh0wGYkmSJEnKRjIQS5IkSVI2koFYkiRJkrKRDMSSJEmSlI1kIJYk\nSZKkbCQDsSRJkiRlIxmIJUmSJCkbyUAsSZIkSdlIBmJJkiRJykYyEEuSJElSNpKBWJIkSZKykQzE\nkiRJkpSNZCCWJEmSpGwkA7EkSZIkZSMZiCVJkiQpG8lALEmSJEnZSAZiSZIkScpGMhBLkiRJUjaS\ngViSJEmSspEMxJIkSZKUjWQgliRJkqRsJAOxJEmSJGUjGYglSZIkKRvJQCxJkiRJ2UgGYkmSJEnK\nRjIQS5IkSVI2koFYkiRJkrKRDMSSJEmSlI1kIJYkSZKkbCQDsSRJkiRlIxmIJUmSJCkbyUAsSZIk\nSdlIBmJJkiRJykYyEEuSJElSNpKBWJIkSZKykQzEkiRJkpSNZCCWJEmSpGwkA7EkSZIkZSMZiCVJ\nkiQpG8lALEmSJEnZSAZiSZIkScpGMhBLkiRJUjaSgViSJEmSspEMxJIkSZKUjWQgliRJkqRsJAOx\nJEmSJGUjGYglSZIkKRvJQCxJkiRJ2cgmuzsgSf8k0dHR/PHHH2i1WnLmzEnBggWxtbXN7m6lS6vV\ncv/+fWJiYlCpVOTPnx8XF5fs7pYkSSaSgVj64BkMBg4ePMj0OdM5duQYypxKFLYK9HF6rA3W9Oja\ng769+1K4cOHs7ioA165dY878OaxZuwYrlRXW9tYYkgwkRifySYNPGDJgCHXr1kWhUGRZm/fu3WPd\n+nXcvn8bjUaDW243alavScuWLVEqlVnWjiR9iBRCCJHdnZCk7HL58mUat2jMi8QXxFaIhXLAm3Hl\nKdhdsMPqkhV+LfwIWhaUbYEnNjaWVm1bcfT4UZIqJqGrqIOcbxSIB8VlBeoLavI45WH39t2UKFHC\nojb379/P1FlTOXniJAZvA4kuicmX7/Hg+MARxZ8KunfpzoD+AyhYsKBFbUnSh0oGYumDdfLkSRo2\nbkhs/b8CcGY3kAngEOpAOedyHNl3BAcHh/fVTSB5yLzGxzW453CP+M/iMx/LEqAIV+B00omjB45S\nsWJFk9szGAwMGDyAwPWBxP0vLvnzsUun4DOwC7fD/po9e3bsoWbNmia3JUkfOhmIpQ/SjRs3qFqj\nKjGfx4CxN40GcNjhQL1C9QjdFpqlQ7+ZSUpKonb92lwwXCDx08TMLxjeFAEuR124dO6SSXerQgh6\n9O7B+n3rifsyDlRGHHQDVDtVHN53mOrVqxvdliRJcta09IEaPGIwryq9Mj4IA1iBtrGWY2HHOHLk\nyLvqWhpbt24l4lEEiQ1MCMIA3vCq5CvGTBhjUnurVq0ieEcwca2NDMIAJSDON46GXzTk5cuXJrUn\nSR86eUcsfXCePHmCRzEPEvomgDkjzGfgc5vP2fXzrizvW3qq1KxCeKFw8Dbj4JfgsMKBJ78/wcnJ\n6a3FhRB4lvTk/kf3oYjpzam3qZniP4V+/fqZ0VlJ+jDJO2Lpg7Ns+TIU3grzgjBAeTh86DCPHj3K\n0n6l57fffuPqtatQ2swKcoBVESvWrVtnVPFjx47xPO45eJrXnKaihhlzZ2DK9X18fDx6vd68Bo0g\nhCAsLIzNmzezZs0atm3bxs2bN99Ze5JkKhmIpQ/OT9t/Ir5UvPkV2INNSRsOHDiQdZ3KwN69ezGU\nMoC1+XVoSmrYtH2TUWVnL5yNpoLGtCHwN3nAi/gX/PLLLxkWSUpKYtOmTVStVRVbpS1qJzW2drbk\ncM1BvwH9uHHjhpmNp/bq1SsWLVpE0dJF8Wnqg/8Ef/rM60OnMZ0oX7U8NevWZNu2beh0uixpT5LM\nJdcRSx+cFy9egKNldSTZJ/H8+fOs6VAmnkU9I8E+wbJK1PDs3jOjikb8FoGoZcHTKgUYChi4du0a\nderUSfP2osWLGPH9CAy5DLyq8Ap8SJ6NbYCYFzEsvbCUwGqBVK5cmeBVwWav3T5y5AjNWjZDX0iP\npoYmeZj9zYsLHZz+7TQdBnfAbZgbh/cdxsPDw6y2JMlS8o5Y+uAoFArIgpkRVlam/fN5+PAhI0eP\npECRAqicVNg52OHi7kLTlk05fvx4usO51lbWlvdVgLW1cbfUGo0m/WVKJtDZ6IiJiUndBSHoP7A/\nQyYO4WWrl7xq+yr5mffrtqyA3JDkk4S2n5bTNqepWK0ily9fNrn9PXv24Nvcl5gvYtC00EBR0t7h\n2wDlIbZDLPeL3ady9crcuXPH9JOVpCwgA7H0wcmdOze8sqwOW41tcj1GePjwIY2aNqK4V3F+OPgD\njz57hLa3lqSBSUS3i2andie+X/tSpHQRtm/fnupYNzc37LX2lnX2Fbi7uhtVVKVWQaJlzdnobNJM\nDJs4eSKBmwOJ6xAHed5WAeg/0vOi9gt8PvXhwYMHRrcdERFBy69bom2pTQ7ARtD/T090tWg+bvAx\nsbGxRrclSVlFBmLpg9O+dXtUV41dl5OOONDd0tGwYcO3Fv3tt9+oWK0iB2IPkNAvgYSGCZCf5GVB\nSiAniP8JYrvFcq/6Pb7+5mtmz52dcnyTJk0gEouCo/KyktbNWxtVtlSJUvDY/LYQYP3EmmLFiqW8\ndPv2baZMn0JcqzjTJsiVh2ivaPoO7Gv0IaPHj0ZbXQsmjmgbqhl4oX7BmjVrTDtQkrKADMTSv1pk\nZCS9+vbCrYAbSpUSO3s7cuXJRZsObQgLC0v3mG86f4PhugHMvfkJhzx587z1GfHDhw/5+JOPiaoR\nhb6uPnXqzL9TAMVB21HLqImjWLM2OSB4enpSo0YNuGJmX5+B7qGOoUOHMmDAACIjIzMtPqD3ABwv\nOpo/HP4Q1AY19erVS3lp/qL56MrrwNn06vT/07N3z16ePHny1rJPnz5l967diErmdV5TScOMeabN\n+JakrCADsfSvFBERwf/q/I9KNSqx4soKnrV4RmJAIkmDknjx9QtC/gihrm9dvCp6cezYsVTHuri4\n4Ofnh/WvZkxFTgDFaQXlvcrz0Ucf0bZtW65cST9Kdu3dlWivaDAlw2ROiGsdR4/ePYiKigJg6ICh\nqMPVkGR6d+1O29GvTz/Cw8NRq5MDpI+PDyEhISQmpr3N/uSTT3CycgLjR4NTcbjgwKD+g1Ken8fH\nx7MiaAVJlczoPIADKLwVLFu+7K1Fl69YjsJLYXwSkr8rAk9jnmY641uS3gUZiKVsodPpzF47euzY\nMWrUrsHZHGeJ7xePzkcHboA9yXeducBQ20BcrzgiS0bSqGkjNmzYkKqO6ZOnk/NGTrhoSqdBtVXF\nx//7mDNnztC6dWu8vLxo0KABfn5+hIeHpxR9+PAhRw4fQV/DjHN0B0UpBYFBgQA0atSIBv9rgMNO\nBzChOqvTVuR9kZfvR36Ph4cHkyZN4v79+/Ts2ZNFixbh4eHByJEjuXfv3v8fY2XFyCEjUR0041nx\nbbC5bYP/N/4pLx09ehQrVysw7nF6uuK941n94+q3ltt3dB/aIlrzG1JAQrEETp48aX4dkmQGGYil\n90IIweHDh/Ft5ouDowN2Sjts7WxxzOlI+2/apwpimbl06RK+zXyJbRqLqCYyX4BnBXiDtq0W/17+\n7N+/P+WtAgUKcGT/EVxOuGB92vrtAe4VqDaqqFeqHgf2HODKlStER0ezZs0a1qxZQ926dWnatCmN\nGzfm1KlTLF66OO1OTibQVtQya/4sDAYDCoWCDes2UN2tOqqfVG8fUk8C28O2uEe4c/TA0VR7FNvZ\n2fHVV19x5MgRDh06RGxsLJUrV6ZJkybs2rULvV5P7969+eKjL1BtVoGxK6fugepnFdu3bE81ie3p\n06cYnA2mfwBvygHPo96+VOzFixfmJ2n5i85OR9TzKMsqkSQTyUAsvXN79uyhcPHCNO3YlN263cT3\njkeMEohRAo2/hg0PN1CnYR3KVimbaUAWQtC6fWs0dTVGz4gFIA9om2lp1bZVquHYsmXLcv7MeSq+\nrIjDQgdsjtnAm6tuBHA3OcDYL7Wnt19vdmzZgY2NDa6urqxfv54ZM2bQuXNnbt26xcWLF2nSpAlt\n2rRh5tyZJJSzYP1vQdAYNCnPue3t7dm/az+dP+2M/RJ7VNtVcJ/Uz3Kfg+1BW+zn21NbWZuLYRfx\n9PTMsAkvLy/mzp3L/fv3adGiBWPGjKF48eJMnTqV2TNm41fTD/VaNUSQ8YVKDFgftUa9Vc22TdtS\nPRsGkkc9LN0bwwr0urcPBdjZ2Zk0YpAuPTjYv9+dtSRJBmLpnVq2fBl+bf14WOshsV1ioTqgJvmb\nZwXkAH1tPXG944jwiKBO/Tqp7lzfdPbsWR48eQAVzOhIEdDn0rN169ZUL3t4eBB2Moxfj/xKh2Id\nUC5RYjfdDoc5DlhPtqbQ8UJM/WYqfzz8gxlTZ6RZO9y8eXOuXLnCixcvqF69OqVLl+bGjRsInUi9\nV7CpFGDlYsWff/6Z8pKtrS0L5y7k93u/M77dePIdzIfVJCvsZ9nDBFCtUtGrai8un7vMob2HcHc3\nbsmSWq3G39+fs2fPsmnTJm7duoW3tzdJ2iSGdB1CxfvJFyrWh62Th/IjgHNgs9EG28W2dCzekfNn\nzvPpp5+mqdvFxQUrrYU/Mxpwzvn2mV6FCxQGC3OsqGJV5MuXz7JKgJs3bzJ9+nQCBgXQu19vxo4d\nm+FacUmSmz5I78y2bdto26Ut2nZa458R3gPVFhXHDh6jSpUqqd5q1bYVW6K2YKhl5lBnBFS6X4nw\n0xnfdRsMBmJiYtBqteTMmdOkfYd37NhBr169aNasGcuDlpM0MMnsoWkA563OrPx+JX5+fhmWSUhI\n4OXLl7Rq1YpRo0alGwzN8XrYffHixVhZWdG0aVNexr7k9z9+J04bR26X3OTJnYfDhw5z6dKlDOt5\n9uwZhYoUIr53vNmTqGwO2/CN1zcsW5z5hK3du3fTuldrYjvHmncXrgX7hfbcu3XP6IuYNwkh2Llz\nJ1NnTyU8PBy9l54kxySwAoVWgeqmCjcnN4YEDKFTp06o1WozOin9F8lALL0TWq0W9/zuxH4ZC8Zv\nhZvsEhSPLM71K9dT9vwVQqB0UJLUPyn5jtocelDOVnLn+p0suetJz4sXLxg0aBCrf1yN6GXZXXGO\n4BxsXbIVHx+ft5b95ptvqF27Nl26dDG/wXQIITh69ChLlixh7969tGzZkl69elGlShX0ej0FChTg\nl19+oXjx4hnWYdEFlA4cFjhw7uQ5vLy8Mi364sULChYtmLyHsqnfOUBxSkHzHM3ZsnGLyccmJCTQ\npkMb9p3ah6aaBsoAtn8rJIA7oApXkU+fjyP7jpi0T7T03yWHpqV3IiQkJDlxhTm/M2XhcdRjfv31\n15SXXr16lfxtteQmwhqULkqePn1qQSWZc3FxYeXKlVSrVi05EYe5XkHCowQqVapkVPHChQunmv2c\nVRQKBfXq1WPDhg1ERkZStGhRWrZsSfXq1VmzZg1NmzZl06bMN5QYHDAYh4sOZi2/4gp4l/HONAgn\nJCQwZ84cSpcujVdxL+yP24OpMV8DDuccGBww2OQu6vV6vmjxBXsi96DppEl+dPL3IAzJd+lFIa5l\nHHcL3qVqzapGrY+W/vtkIJbeiWmzpxFbwcyMGVYQVyGOmXNnpryUlJSElXUWfF2tSXf9bFabMWkG\n6otqsxNjWF+w5ssvvyRnTuNuqT08PLh//755jRkpT548jBgxglu3bjFmzBg2b97Mxo0bmT17dqaJ\nQqpXr45PLR8cQh1MC5CPQXlQybyZ89J922AwEBwcjJeXF/v37+fAgQOcPHGSinkqYrfHzvi24kH1\nk4pe3/SiVq1aJnQw2fCRwzl5+yTaZtr0A/DfKZJTeEaVjKLhFw3lc2NJBmIp6z148IA7d+9ACfPr\nEBUFP2/5OeVHKkeOHCTGJVo8K1av0adazvOu1KlTB1dHV7htxsE6UF5UMqj/IKMP8fDweCd3xOmx\ntramcePG7Ny5k/DwcOLi4qhTp06GiUIUCgWbgjdRzrEcDtuMvDO+C3bBdtgp7NBq064NPnDgANWq\nVWPOnDkEBQURGhpKuXLlsLOzY8/2PRSNLwrBwItM2hDAQ1CtVdGuYTumT51uwqeQTKPRsGjxIuI+\njzN5LztdHR03f7/JiRMnTG5X+m+RgVjKck+fPsUup51l3y4VoPhrNyDAxsaGspXKwnUL6nwM9tb2\n72W7O4VCwbyZ85LvAqNNONAAtj/bUq9WPaOHpSF5aPpd3xGnp1ixYnTs2JH+/funShQyatSoVBcG\n9vb2HDtwjMbejXFY4IDtIdu0QVIPRIIiSIFqq4pdW3exY/sOvv76a0JDQwE4f/48n332Gb169WL4\n8OH8+uuvaZZMGQwGtC+1NCnbBPUqNY4/OcI1ktvTAFFAODiuciTP3jz8MPoHli5aavJuWgDr169H\n4aEwby6AInnkZ8acGWYcLP2XyEAsZbmkpCQU1pYuHgUra6tUm7YPGzgMp0tOmRyROfsL9vTr1Q8b\nm/ezDXfTpk2Z9P0kVOtU8Ofby6MD2y22qP9Qc/bUWaZMmZJmO8GMFCpUiIcPH2IwWJg8wwytWrVi\n69atqRKFvHr1Kk2iEKVSyabgTVw4c4FuFbqhXqXGOdCZHD/mIMfaHDjMd6Ds9bL08O1BudLlqF+/\nPnXr1mXHjh106tSJOnXq4OvrS/Pmzfntt99o1apVymS+14QQdO3alaZNm7J963b+fPQn8wbNo/zN\n8uTemBv1MjVuW9zwSfAhZHEIj+4+omePnmnqMdYP839AU0Fj9mcnKgj27d3Hs2fG7Rct/TfJWdNS\nlrtx4waVPqqEpo/5P1DowGqyVfKz4b/uVBISEnDL78arr1+BqatLNGC/2J47N+6QN29e8/tlhtVr\nVtOzT08UpRRoK2qTJ7C9+bv/KvmZsE24DSTB1UtX0Wq1TJ48mb1799KnTx/69+9Prly5Mm0nb968\nhIeHkz9//nd6Pn+n1+vJnz8/J0+eTLXrkkajYePGjSxevJhnz57RvXt3unTpkrI0KC4ujmvXrhEd\nHY1SqSRv3rwULVoUvV5PpUqVmDhxIrVq1WLSpEkEBQVhMBiYMWMGPXv2zLAvixYtYsWKFZw6dQql\n0oK1Y0ays7cj6dski/ZwzrE2B3vW7Une3EP6IMk7YinLFS1aFAcbB3hkQSVXoUqtKqmGC5VKJVMn\nTkW1VQVxJtSVlJwjukf3Hu89CAN06tiJh3cfMvarseTZlwenFU44/+SMapMKxVIF1gus8cvjx6mD\npxgcMJjevXvj5eXFunXrOHXqFA8ePKBEiRIMHz48VYKPv3ufz4nfZG1tTcuWLdPMnv57opCbN29S\nqlQp2rRpw9GjR3FwcKBSpUr4+PhQq1YtihYtmlLfmDFj6NatG6VKlSIxMZFr164RFhbG5MmTWbhw\nYbr9uHDhAmPGjGHjxo3vJQgnJSWhS9IZN0ErM0qMHvmQ/ptkIJaynLW1NQF9ArC/YP6G9k6XnBg+\ncHia13v36k33dt1RrVfBSyMq0oIqRMWnFT5l1oxZZvfHUrlz52bokKE8uvuIA1sOsH7KetaOX8vO\nFTvx7+jPiSMnePDgAWPGjOH58+csWLAAgOLFixMYGEh4eDgxMTGULl2agQMH8uhR2quc7HpODMnD\n05ktY6patSqBgYHcvn2bmjVr0rNnT8qWLcv8+fOJjv7/h+g6nY4VK1bQv39/9Ho9w4cPZ+HCheTN\nm5dSpUpx9OhRZs2axbRp01LVHxsby1dffcWcOXMoUcKCWYImsLGxSZ7Jr3t72UwlIpN7fODk0LSU\nodfJHBYuW8jN2zeJ08bh7OxMjao16NerHyVLlszw2D///BOPYh7E94wHRxMbfgQu21z48/c/032e\nK4Rg+szpjB0/FspCfMV4+PuN7nOwPW+L9UVr/Dv5M2/2PKytzdj28D05evQoXbp0oUaNGgQEBODr\n68vhw4cpW7ZsqnKPHj1i5syZrFq1iq+//pphw4alTD4bPHgw7u7uDB069L33P6Ph6Yz8PVGIn58f\n3t7eBAYG4urqyvTp00lISKBTp05ERkamusN99OhRyo5XEyZMQKFQ0KlTJ6ytrQkKCkrVRmxsLDY2\nNiZlSDNFwaIF+b3+71DIzAqSwH6+PTcibsjkHh8weUcspWEwGFi0eBEeJTxo0qEJm6M3c6HUBa5X\nu06YZxhLw5dSsXpFatatyaFDh9Ktw93dnYD+Aag3q03bTu9V8jDynJlzMpxUpVAoGDZkGLeu3aJ3\n7d4QCE5BTuT4KQfOm51xXuOMerWanlV6cvncZRbOW/iPDsIAdevW5eLFi7i5udGsWTO++uor2rRp\nQ3x8fKpy+fPnZ9asWURGRpIjRw4qV65Mly5duHnzZrbeEVtbW+Pn5/fW5B6vvZkoZN26dRw8eJDh\nw4eTlJREp06dKFeuXMoOV127dk31OeTPn5+jR4+ya9cuBg4cyOrVqzl79izz589Hp9Oxbds2PqtZ\nEzsbG/LmykVOJyec7O3xb9MmZRONrNKvZ7/kZCXmioCq1arKIPyBk3fEUioJCQl81e4r9ofvJ65u\nHHiQft5eHRABqqMqJo+ZTED/gDRFhBC06dCGnad2ommpeXtWrChgFXRr1+2teYVfW758Ofv27WPQ\noEFERUVhMBhwcXGhatWq7+wu6F07ceIEnTt3Jj4+Hl9fX5YuXZph2efPnzNv3jwWLlxImTJlUCgU\nHDly5P119g2HDh1iyJAhnDt3zqjy165d47vvviMsLIzx48fTtm1b9u/fz+LFizl16hQKhYKoqOQt\nCV1cXPD396dnz54p6TSjo6Px8fHh6tWrnD59mt+uXGFYQACFk5Lo/eoVfiTviiiAp8AqKysW29vj\n5uHBsuBgKlasaPE5W5pL22mNE8Fzg/niiy8s7ov07yUDsZTCYDDg19qPfdf2GZ8l6AWoflQxe8Js\nunfvnm6dw0cOZ/6C+YhygoSKCZDnjQICeACqCyoM1w107tCZ7T9v58SJE5lu4fda48aN6dChA19/\n/bWxp/mvEBcXx5AhQ1iyZAnDhw9n0qRJmZaPiYlh5MiRLF68mObNmzNq1KgsCTSm0Ol0FChQgFOn\nTqVMvErP48ePGTduHJs3b2bIkCH069cvzUXTTz/9RKtWrdI9/tNPP6VXr158+umn1KhRA51Oh8rW\nlue3brFJq6VaJn3UA+uBwWo1G7Zvp379+qaf6N+069yOLVe2EP9FvEmbTSguKsh/Pj/3bt77x4/Y\nSO+WHJqWUixdtpT94fuND8IALhDXOo4BQwdw7dq1NG9bWVkxfcp0bkbeZHCDweTclBOn5U7k2JCD\nHME5UC9Rk+9gPia0n8Cj+49YvGgxw4cPx9fXN3mj90zExMRw/PhxPv/8czPO9p9NpVKxcOFC5s6d\ny/Tp02natGmmM6adnZ0ZN24cjo6O1KpVC19fX5o0acKZM2feW59tbGxo0aJFhsPTMTExjB49mrJl\ny+Lk5MS1a9cYOnRouiMXN27cyLCd/fv34+fnR968eTEYDHRs356nv/3GqbcEYQBroCMQotHwddOm\nXLx40fgTzMCyhcvwTPREsVdhfFrN38DxiCP7d+2XQViSd8RSMiEEniU9uf/RfShi+vE2h23oWrYr\nixcszrRcUlISERERPH/+HGtra1xdXfHy8kqT1WjQoEGEh4ezd+/eDJeihISEsHLlSnbv3m16h/9F\nBg8ezLZt23j16hXz5s2jdevW6SagEELg5OTE77//jlKpJDAwkGnTplG6dGlGjx5NnTp13nlfDx06\nxNChQ1M9i01MTGTp0qVMmjSJhg0bMn78eKOym12/fp2lS5eycuXKTC/KlCRvk1zKxL6uBFaUK8eJ\nTLZxNIYQgg4dOrB9z3Z0eXRoa2mhAOnfHUeDTZgNTtec2L97f5qtPqUPkwzEEpA8a/eLdl8Q29XM\nvVyjQRWk4s9Hf2bJUgyDwUCrVq2wt7dn7dq16aYfbNOmDfXq1aNHjx4Wt/dPlpiYSM2aNfnkk08I\nDQ2lVKlSLFq0KN010d7e3mzYsIFy5cqlHLt27VqmTJlCgQIFGDVqFA0aNDA7k9TbvDk87enpSUhI\nCCNHjqRkyZJMnTqVChUqmFynVqtl6dKlDB48GL0+dbJxBdAM2GpOX4EiKhU7T540q1+vTZw4kS1b\ntjBo0CDGTR3H7bu3EQaBcPhrG8wSgAOob6oR9wUdO3Rk5PCRcoKWlEIGYgmA1u1a89OLnxD/M//r\n4PiTI0uGL6Fdu3ZZ0ietVkv9+vWpX79+mmekCQkJ5MmTh8jIyGxJ0vG+Xbt2jdq1a7N//35CQkII\nDAxk1qxZtG3bNlVQ9fX1pXfv3mkm/+h0OjZs2MCkSZPIkSMHo0aNonHjxu8kIPfs2RODwUB4eDgK\nhYJp06ZlybPY7777jqtXr3Lq1Cmio6NJTExEDewFPjKzzgnW1vzevj1LVq0y6/hVq1Yx6NtBKOwU\nJDkk8ar8X1nfbIEE4C5YnbHCwc6Bjq07MmPGDLlmWEpDPiOWALh15xbCzbJrMq2LNkuXzzg4OLB9\n+3ZCQkJYtiz1LOrDhw9TpkyZDyIIA5QqVYrJkyfzzTffMGbMGEJDQ5k6dSrNmzfn8ePHKeUyWsJk\nY2ND+/btuXLlCt9++y0jR46kcuXKbN68OUvzU1+8eJFz586xevVqhgwZwq+//polQRhg6NCh7Nu3\nj1KlSvHHH38wYsQInBQKTN+48P911OvZvHmzWcfu2rWL7n26o3XR8rzpc151egWVSB6Wdid5bXEd\nMAw0oGmoYfXm1UydPlVueyilIQOxBCTP0jV1G7e/01vrU3ZLyipubm7s2rWL77//PtWz4G3bttGi\nRYssbeuKfMtDAAAgAElEQVSfrmvXrnh6ejJy5EiqVq1KWFgY5cuXp0KFCqxZswYhxFvTXFpbW9Oq\nVSvOnz/PuHHjmDp1KuXKlWP9+vWpNtgw1b179+jYsSMNGzakffv2ODs7U61aNbN2NMrImTNnsLW1\nxcXFBRcXFxo0aEApZ2eznqS8VgB4rtGYfDFy4cIFmrdqjqKogvg28ZBZem8roCTEdYhjVuAspk6f\nakGPkye9LVy4kBZfteDjTz/msyaf0b1Xd06fPi2D/L+UDMQSkLzfLwmW1WGbZGv0RvamKFGiBFu2\nbKFjx46cP38eg8HAzz//TPPmzbO8rX8yhULB8uXL2bBhAwcOHECpVDJhwgT27NnDDz/8QJMmTXB0\ndDRqVMLKyoqmTZty5swZZs2axeLFi/Hy8iIoKIikJGM2DE4WFRXF4MGDqVy5Mp6enly/fp2AgAD8\n/Pz46aefLDndVB4/fkznzp3ZuHEjYWFhnDt3Dr1ej6XzjV//AJoSwB4+fIhPfR+s3KxIbJ5o/AWs\nU/IKgwnTJnD+/HmT+3rr1i38u/uTt2Behq0YxraEbRx3Pc5+h/0E3gykQfMGlCxXksDAwDTP0qV/\nNhmIJQBqVK2B7QMLstcLUD5QWjTpJTO1atViyZIlNGnShJ9//pncuXO/t5zC/ySurq6sXLmSzp07\npyS7qFy5MmfPnqVatWp8//33nD171ujAolAoaNiwIcePH2fFihUEBwdTokQJFi9enCar15u0Wm3K\njGyNRkNERATjx4/H2dkZeHvuaVPo9Xrat29Pjx49aNSoEaNGjWLEiBHkypWLPy0cVo8CnJRKo5cQ\nxcTE4Ovri7ARJNRLMH0UKQckVklk5pyZJh125MgRKlaryJqba9B206JprkkeBi8NeIOhtgFNDw03\nK90kYHIAX7T4Aq1Wa2LnpOwiA7EEQL/e/bC+aA3G3wyl9hAcceSTTz7J0n69qWXLlgwaNIhu3brR\nqFGjd9bOP92nn37K119/Tbdu3VICrp2dHWPGjOHHH3/k/v37+Pr68uDBA6PrVCgU1K1blwMHDvDj\njz+yc+dOihUrxpw5c5IfW/xFr9ezcuVKSpYsyZkzZ/jll19YvHhxmmf19erV4969e9y5c8fi850y\nZQp6vZ7Ro0cDyUP0t27d4unTpzxVKLhqQd0bAZKSGDFiRKbrtJOLJfHll19SpEgR9LZ68DSvTX1F\nPVu2bHnrOvnXTp8+TePmjYltEou+rh6cMyhoBRQHTVsNRx4c4YsWX1j0uEF6f2QglgAoVqwYVSpX\ngQgzKzgFlcpWMmlY0xwDBgxAr9dz9OhREhNNSWL93zJp0iRu377NihUrUr3eoEEDAP73v/9RuXJl\nVqxYYfJzw5o1axIaGsqOHTs4duwYRYsWZerUqYSEhFChQgWCgoIICQlh8+bNlCqV/urd18k9LB2e\nPn78OAsWLGD9+vUpd622trZMmDCB77//ni49e7LYzrzNgAUwE3ip1zNlyhQ8PT0JCAhI9wJGCEH3\n7t1RKpU4ODmgKa8xb5kfgCNYF7c2apJYbGwsjZo0Iq5xHGScrCw1G4hvEs/pu6cZP3G8mZ2U3icZ\niKUUk8ZMQnVUBc9NPPA3yPFnDoRB4O3tzY4dO97ZpJHIyEgcHR3Jnz9/qjvCD41SqSQ4OJjvvvsu\nVUYzGxsb8uXLR6dOnTh06BBLliyhYcOGZs1mr1y5Mlu2bGHWrFkpS6UqVKjAzz//TM2aNd96vKXD\n01FRUbRr146goCAKFCiQ6r2vvvqKhIQEPIsXZ51CQZQZ9R8Anr3x31qtlnnz5lGsWDG6du2aKrvX\n+PHjuXLlChs2bODug7uI3JZ97zTOGh4+fPjWcuvXr0eXXwcZb3SWPmuI+ySOeQvmfdAXrP8WMhBL\nKerWrcv0idNR/ahKzpJvjAhw3OfI4X2H2b17NwsWLGDIkCH4+vqmm/LSUlu3bqV58+b8+OOPREZG\nMnbs2Cxv49+iTJkyjB8/nnbt2qX6sX09c7pcuXKcPn0aHx8fqlSpwtKlS026cLl+/TpffvklQ4cO\nZcqUKVy6dAk7OztKlCjBiBEjePo08y9JvXr1uHPnjlnD00IIOnfuTOvWrfH19U3zvpWVFZMnT2b2\n7Nl06dGD5ioVpjwRvQW0tbHB2jntOG9SUhKBgYGULl2aNm3aMH78eFavXs3OnTtRq9Vo47UWrzDA\nBjRxma8wEEIwbc40NBXMXIngDvrcerZuNSfdifQ+yUD8gRFCEBYWxsqVK5k7dy4rVqxg//79KbMs\n+/Tuw/yp83FY54DtIVtI7zGWAO6Dw3YHch3NxbFDx6hUqRIAjRo14tKlS3z66ad89NFHDBkyhJiY\nmCzr/+tlSyqVih07drBu3TpWrlyZZfX/2/Tq1Yt8+fIxZsyYlNcKFy6csoTJxsaG7777jiNHjhAU\nFESDBg3eGhj/+OMPevfuzUcffUTVqlW5fv06Xbp0oUyZMqxcuZKwsDCeP39OqVKl+Pbbb1OtY36T\nJcPTc+fO5cmTJ0yePDnDMp9//nlyitQKFfD8/HM+ValS3eFmJAz42MGByfPn8+jRI+bMmZPmjhuS\ns7tt2LCBMWPG4OHhkfK55cyREzKex2YU6yRrcufKnWmZc+fO8Wf0n2alnH0ttkIssxbOMr8C6b2Q\ngfgDERcXR2BgIKXKl6Je43r0W9SPYRuHEbA8gJY9WpK3UF4mTJzAkydP8Pf35+LZi/So1AP1KjVO\nIU7YHLCBw2C3zw7HIMfkjRraTeBm5M2UIPyanZ0dgwYN4sqVK0RFRVG6dGlWrVplceKIBw8ecPv2\n7ZScye7u7uzatYvvvvuO/fv3W1T3v5VCoSAwMJDVq1dz+PBhIPmO+O9D0d7e3pw4cYKGDRtSvXp1\nFi1alOb/x6tXrxgzZgze3t44ODgQGRnJ8OHDUalS7+9XpEgRlixZwqVLl9DpdHh7e9O3b9+UNkND\nQ9m+fTtCCLOGp8PCwpg0aRIbNmzALpPnvwqFgilTpjB+/HiWrV1LnZ49KaFU0sPenr9v5aAHdgFf\nODrSSK1m3tq1dOvZE7VaTUBAALdu3WL58uUUK1Ys3baOHDlCzZo12bdvHx/X/Bjl/fTznxtFgMM9\nBypXrpxpsVu3bmGVz8qyX+m8cPfOXQsqkN4HmeLyA3D16lV8PvNBk0NDbMVYKEbaf9yPwP6CPVbX\nrNi4bmNKisS4uDi2b9/O/fv3iY2NxcXFhXLlylG/fn2jkzWcOXOG/v37I4Rg/vz5VK9e3azzWLBg\nAWfPnmX16tWpXj9+/DgtW7bkwIEDlC9f3qy6/+327NlD9+7duXDhAps2beLs2bNpJnK9FhkZyTff\nfIO9vT0rVqygcOHCLFu2jIkTJ9KgQQMmTJhg1BaUrz158oQffviBFStW0KJFCw4ePMi9e/eoUKEC\nw4cPp2/fvoSFhRlVZ0xMDJUrV2by5Mm0bt3aqPabNGlCgwYNCAgI4PHjx6xYsoSl8+djn5SEq7U1\nSULwe1ISBQsVos/w4Xz11VdpLi5e0+l0bNq0iXHjxqV5tJIzZ0727NnDjz/+yNxFc2EwyTtOmOoB\n5Nufj4d3Hmb6bygoKIj+S/qjaWxBkpxX4LTSiZiorBuVkrKeDMT/cREREdT8uCaxdWMRFYz4X/0Q\nHDY7sHrp6gz3gzWHwWBg7dq1fPfddzRs2JApU6aYnJ6yQYMG9OnTJ92MWhs3bmTIkCGcPHnyg02m\nHxAQwKNHj/D392f27Nns27cvw7J6vZ7Zs2czbtw4HBwcqFixItOnT7doD+OoqCi6du3Ktm3bUr2e\nM2dOGjVqxNq1a7GxyfjhqhCCtm3b4uzszNKlS41u99KlS3z22WfcuHEDJycnIDmg3rx5kxcvXmBj\nY4Obm5vRFxcvX77ko48+onr16kRERKRsJenu7s7Tp0/x8vLCIYcD51zOgRnXlA7bHRjfdjyDvx2c\nablNmzbRdXJXYppbEESfQZ7tefjj3h/m1yG9c3Jo+j8sOjoan898iPUxMggDFARtay2du3cmPDw8\ny/piZWVFp06diIyMxM3NjbJly/LDDz8YPaPz+fPnnDlzhoYNG6b7/ldffUXfvn1p3Lhxlj6T/jeZ\nNm0akZGRnD9/PtM0l5A8ihASEoKHhwfu7u7Ex8fj6OhoUfu5cuVKdx/h6OhoNmzYQOnSpQkMDMzw\n/3lQUBBXrlxhzpw5JrVbvnx5GjRowOzZs1Nes7GxoXTp0tSsWZNq1aoZHYQTExNp2bIlPj4+zJ07\nl06dOuHh4YGzszMjRozg1q1b+Pn5cfO3m1gftgYT45visgL1YzVd/Lu8tWyZMmXQPdAlj6ub6wF4\neXlZUIH0PshA/B+2InAFmjwaRDkTBz3ygbamlu8nfp/lfXJ2dmb69OmcOHEiZSh5z549bz0uNDSU\n+vXrZzikCDBkyBA++ugjvvzyy3e+nvmfyN7enuDgYGbNmsW9e/fSnSF9+fJlfH198ff3Z+DAgVy6\ndImLFy/i5+dHjRo1mD17ttnpERUKBcHBwRnul3zr1i26du1KiRIlWLRoUarMXREREQwfPpyNGzfi\n4OBgctvjx49n7ty5b53JnRkhBF27dk353Dw9PTl48CBBQUFER0cTEBBAkSJFmDBhAvfv3+fLpl/C\nKuB34+pXXFLgeDh5hYGLi8tby3t7e1O8SHG4bvYp4XjRkcH9Mr/zlrKfHJr+jzIYDBQsUpDHDR5D\nYTMqiAflAiV3rt8hX758Wd4/SP7hCw0NZeDAgXh5eTFr1iyKFy+eblk/Pz+aNWtGp06dMq1Tp9PR\nvHlz8uTJw4oVK97Zvrv/ZPPmzePbb7/l7t27KbOB79+/n7JxxogRI+jZsydKZeoHnDdv3sTf3x+9\nXk9QUFCGyTqMcfXqVaZMmUJwcHCGgT1fvnwMGTKE9u3b4+Pjw6BBg/D398+03sTERMLDw1PSe+bK\nlYsqVapgZ2dH3759sbOzY9Ys02cJ6/V62rRpw969e1EqlXTv3p0ePXpQqFChTI8LCQmhwzcdSCyR\nCDWBvz9tMQC3QX1RjSpKxeF9h/H29ja6X8HBwfSY0IPYr2NNPid+B7ddbjy+99joFJ5S9pCB+D9q\n//79+HX1I/abWLMzANnvtmfo50MZN2ZcmvdevnzJ8ePHiYqKwsrKity5c1O3bl2z9lpNSEhgzpw5\nzJgxg27dujFy5MhUw6RxcXHkzZuXO3fukDt35ks+IDkbUb169WjWrFlKWsQPiRCCnDlz8uWXXzJz\n5kwmT55MUFAQvXr1YsiQIckbfGTAYDCwaNEixo4dy/Dhwxk4cKBFP+K3bt1i6tSprFq1KsN0i/b2\n9pQqVYqjR49m2LeHDx+ybNEili9aRB4hyKdQoAD+EIJHQJcePWjRujUNGzbk/PnzFC5s3NXn06dP\nCQwMZMaMGWg0GmbNmkWXLl3SXKRk5vHjxwz7bhjrflwHLkA+sHKwQqlXorivII9LHoYNGEbbtm1N\nHv5PSEjAs4QnT6o8QVQ04ac6AVTrVUwZPIX+/fqb1Kb0/smh6f+osLAwtIW15qfhA+I94zl66miq\n1y5cuECPjh3xzJuXee3acaBvX/b27s3MNm0o7O5OQM+eREZGmtSOUqlk2LBhXLp0id9//53SpUuz\nfv36lCHCAwcOUKVKFaOCMICjoyM7d+4kKCiINWvWmNSX/wKFQkGNGjUIDg6mSJEixMTEcPnyZSZO\nnJhpEIbkZ/l9+/blzJkzhIaGUrt2ba5eTc7mvGXLFpOfvxcrVozly5cTGRmJvb19usuR4uPjuXjx\nIkWKFGHcuHGpcjALIZg4ZgzlS5Tg+axZHHj5kgsxMex++ZJdL18SHhPD4ZgYYufNo2GdOniXLGlU\nkpczZ87QsWNHSpYsyaFDh4DkSV+9e/c2KQhD8p29rbUtk8dNZvuK7XSp2gX3u+7kepSL4X2Gc+3S\nNbp3727WM3ilUsnBPQex2WcDl4w8SAuqzSpa+LSgX99+JrcpZQMh/Sd9O+RbwScIxlrw1wlRoXoF\nIYQQiYmJoluHDqKgSiUmWluLxyDE3/7ugRhpYyPyODiIoQMGCL1eb1bfT5w4IapUqSJq1aolwsLC\nROfOncXcuXNNriciIkK4u7uLgwcPmtWPfyOdTidWrVolHB0dhYeHh8ifP7948eKFWXXp9XqxaNEi\n4erqKnr37i2srKxEoUKFxJ49e8yqr0uXLmL06NGiTZs2wsHBQZCcGibNn5OTkxg+fLh48uSJ6Net\nm6isUolH6Xzf/v73BER1lUrkVCpFRESESEpKEklJSSnta7VasWrVKlGtWjVRpEgRMX36dHHw4EHh\n6uoqTpw4YdY5CSFEbGysyJkzp3j06FHKawaDQezYsUPUqFFDlCxZUgQFBYnExEST6zYYDKJ///6i\nYsWKInfe3MK+qr2gewb/XkcgaIJQ51WL7r26C51OZ/Y5Se+XDMT/Ud9//72groWBuB2iRt0aIikp\nSTT/7DPxuUolXhnxg/gMxEcqlfBv00YYDAaz+q/T6cTy5ctFnjx5hFKpFOfOnTOrniNHjgg3Nzdx\n+fJls47/tzAYDCI0NFSUK1dO1KpVS/Tt21cEBASI3r17i6+//trs/w9CCBEZGSlUKlWqYOnv729S\ngD937pxo0aKFsLOzE4CYM2eOyJs3r1AqlRkGZHsbG1Haxka8NOI79/rvFYhytrYiv5ubKFSokFi3\nbp24c+eOGDZsmHBzcxONGjUSO3bsEDqdTty9e1cUKFBA/PTTT2Z/NkIIsXr1atG4ceN03zMYDOLQ\noUOiQYMGonDhwmL+/PkiLi7O6LpHjx4tKlWqJKKjo8XTp0/FhIkThGs+V+FU1Engg+BzBJ8hbCvb\nClt7W1G6bGkxePBgsXPnTqHRaCw6L+n9kYH4P2rZsmVCVUllUSBWNFKIr9p/JQb26iUaqFQiwYQf\nxFgQVVUqMWnsWIvOY8eOHcLd3V24urqKOXPmmHVXsW7dOlG4cGHx+++/W9SXf6ozZ86IevXqidKl\nS4tt27YJg8EgNm3aJFq0aCE0Go3w8vISa9euNbv+6dOnpxsoCxQoIEJDQ42q47vvvkt1bNGiRUWz\nZs1EVFSUGDdunHBxcUlTvxLELRO+c6//Hvx1LCBcXFxE7ty5xcCBA8X169dT+vP8+XNRpkwZMXv2\nbLM/l9d8fHyMCuanT58WzZo1E3nz5hVTp04VL1++zLT8jBkzROnSpcWff/6Z6nWdTie2b98uhg4b\nKnyb+IoipYoIG3sb4ejtKFTVVEJdVS2cSzkLdQ616NO/j7h27ZpF5ye9ezIQ/0c9e/ZM2KvtBUPM\nDMRjEDa5bcSUKVNETqVSRJnxg3gXhIuDg3j16pXZ5xEQECDGjx8vIiIiRIMGDUSZMmXE/v37Ta5n\n0qRJolKlSiImJsbsvvzT3LhxQ7Rq1Urkz59fLFu2LNUw7JkzZ0TlypWFEEKcP39euLq6itu3b5vV\njlarFcOGDRNWVlbpBuROnTqJ58+fZ1pHeHh4muPu3LmT8n5MTIyYOnWqcHNzS3m/gRnfudd/Td5o\n55dffknVl/j4eFGvXj0REBBg1ufxptu3bwtXV1cRHx9v9DGXLl0Sbdu2Fblz5xajR48Wz549S1Nm\n6dKlwtPTUzx48CDdOuLi4oRvM1+hzqsWioYKwdB0/g0HIGw/thX2zvZi1PejLBoVkd4tGYj/w1q3\nay2sPrUyLxB3RuRwzyFcc+YUnRQKs38Qm6vVYsnixWb132AwiMKFC6cMKxsMBrF161ZRpEgR0aJF\nC5MCi8FgEF27dhWNGjVKFbD+jf744w/Rp08fkTt3bjFp0iQRGxubbpncuXOn/PcPP/wgatasadG5\n//rrr6JMmTLpBuN8+fKJ7du3Z3iswWAQxYoVS3VMenfpsbGxYtasWSKntbXYZ0EgPgbCEYRSqRSr\nV69OqV+v14u2bdsKPz+/LHmGOnbsWNGvXz+zjr1x44bo1q2bcHFxEYMGDUoZsQkODhYFChQQN27c\nSPc4rVYrqtWqJhwqOQhGGfFv+VuEykMlevTpIYPxP5ScNf0fNmTAEJRhSjA10ZQOVMdVTBg1AXsr\nKwZasMKtj0bDounTTT4uMTGRCxcuYGtrm7LuUqFQ0Lx5c3777TeqVKlC1apV+f7779Fo3p6LV6FQ\nsGjRIgB69+79r9zHODY2lnHjxlGmTBlsbGyIjIxkxIgR6S4Zc3d3R6PRpHw2AwYMQK1WM2nSJLPb\nr169OuHh4YwYMSLNkqbHjx/TtGlT2rdvn7LG900KhYIvv/wy1WshISFpyqnVavz9/UmysuITs3sK\ntQGFlRXFixenQ4cOKa+PGjWK27dvs27dOovX1hoMBlatWkXnzp3NOr548eIsW7aMS5cuYTAYKFu2\nLJ9//jn9+/dnz549Ga6p7+DfgSuaK2ibGLkdoxPEtYlj7ba1zFswz6y+Su+WDMT/YVWrVuW7b79D\nvUkNxuaN14H9TnvqeNWhcePGiPh4KljQh/rAtfv3iYuLM/qYJ0+ekDt3btq0aUPJkiVTLWeB5HWn\nI0eO5MKFC9y4cQMvLy82btz41uBqa2tLSEgIZ8+eZerUqeacznsTGxubknEsKSmJxYsXU7JkSa5f\nv87Zs2eZM2cOrq6uGR6vUCgoXLhwyo5IVlZWrF69mkWLFnHy5Emz+6VUKpk0aRK//vorZcuWTfP+\n+vXr8fb2TpNvGkgToPfu3cvz58/TZEF78eIFuezsLPpxUgB51WoMBgNbtmwBYOnSpWzatInt27eb\nlb3r744dO4azs3Oa3cdMVbBgQWbPnk1gYCDHjh0jKSmJadOm8dtvv6Upe/36dUJ3haL9Qmvar7c9\nxDWLY8y4MUanlZXeHxmI/+NGjRhF3w59Ua1RwU2SM/1k5DGoQlTUzlebrSFbefXqFbkySdJvDCvA\nxc6O6Ohoo4/ZsWMHsbGxXLt2jd27d2eYX7pQoUL8+OOPrFu3jilTplCvXj0uXvz7BnipOTk5ERoa\nypIlSwgODjblVN6LpKQklixZQvHixWnatCkLFizA29ubLVu2sHPnTtavX0/RokWNquvNQAyQP39+\nli5dSvv27S3Ox12lShXCwsIYPXp0mjvLJ0+e0KJFC9q0acOzZ8k7BB86dIidO3em5HxWAlaJibi7\nuuKgVOJkb0+zTz5h7969WFtbo8uCEYskIRgyZAijRo3i559/ZuzYsezevRs3NzeL6wZYuXIlnTt3\nzpLsbb/++is9evQgNDSUe/fuUaZMGerXr4+fnx9hYWEp5ebMn4Ouog5szWjEHQyu/39hIv2DZPfY\nuPR+hISEiGJligl1HrVQfKYQdEPQF0EPBM0RTsWcRO68ucWkyZNSnp1dvXpVlHRyMvs53eu/nEql\niIqKMrqvvr6+qZ4ljh8//q3H6HQ6sXjxYuHu7i569eqV7gSYN12+fFm4ubmJI0eOGN2vd8lgMIjN\nmzeLkiVLpjr3nDlzin379plVZ5cuXcTSpUvTvN69e3fRoUMHS7ucIjw8XFSoUCHdZ8dubm5ixYoV\nIn/+/GLp0qWiqLu7cAEx+q/JfDoQBhBRIJaBqODoKIrkySPsra1FjAXfuTgQjnZ2Ijo6WlSuXFk4\nOjqKU6dOZdk5x8TEiBw5cognT55YXNelS5dEnjx5xM6dO1O9rtFoxNy5c0XBggXFZ599Jvbu3SvU\nOdSCARYsSWyNqFi9osV9lrKWDMQfEIPBIE6dOiVatW0linkXE3kK5xGepT2FTyMfsW3btjQTeZ4/\nfy6c7exEnAU/iE9BqGxtjZ4YExMTk7LW9PWfKWuAo6KiRN++fYWbm5tYuHBhppOTDhw4INzd3cWR\nI0fEJ598Iq5evWp0O1np2LFjokaNGukGMkCcPXvWrHrHjRsnRo4cmeb12NhYUbJkSREcHGxp11Mk\nJCSIsWPHChsbm3TPoXDhwsJVrRZLFQqRmMn3xQDiMIjcVlZikQXfu5Ug6lSsmDKr2dXVVWi12iw7\n38DAQNGsWTOL67lx44bInz+/2LBhQ4ZlEhISxIoVK0ShQoWEdS5ry3IDjERY21rLSVv/MDIQ/0dc\nvnxZrF27VixYsEAEBQWJ/fv3Z8ns4MZ164qVFvwgTrOyEp1bt86w/ocPH4oxI0eKKsWLC09XV5HX\nyUk4g7D+6we8WLFiZv1oXLp0SdSrV0+UK1dOHD58OMNyEydOFNbW1gIQRYoUEX/88YfJbZkrIiJC\nNGnSJMMA7ODgIEaMGCGio6PNqn/VqlWiffv26b4XFhYm3NzcxN27dy05hTQuXLggKlasmPZcQBww\n4XuzDkTRvwKzOd+70vz/iMK0adNE06ZNxaxZs7LsPOvUqSO2bt1qUR33798Xnp6eYtmyZUaVP3Dg\ngFAVsSw3AGOTA7EpSUWkd08G4n+xhIQEERwcLCpUqyBUuVXCsYqjcKjhINTV1MKpSPJQ8/gJ4y0K\nLqGhoaKamcPTOhBF1Gpx5syZNPVev35dtGzYUORUKkUvpVL8QnLyhlsgToDo+tePt7eHh9l3qq8T\nWxQuXFi0atVK3Lt3L9X7t27dEs7OzqkCRrVq1dJdDpSVHjx4IPz9/TNcl2tlZSW6du0qHj58aFE7\nhw4dEh9//HGG70+dOlXUqVMny1MhJiYmigkTJqTcHTuCWGrid0cPogiIzWZ873aBUL3xeebPn1/M\nmjVLuLm5vTWJhjFu3Lgh3N3dzUou89qTJ09EqVKlxMyZM40+5uTJkyJHsRyWBeLvEQorRar/50lJ\nSeLmzZvi7Nmz4uLFi+/1YlRKJgPxv9SdO3eER3EP4VTKSdAaweh0/tF1R9hXtxcqZ5XYsmWLWe3o\ndDpRNG9esc2MH8RlCoWo5uWVps6TJ0+KPM7OYppCkWn6whgQMxUK4e7kJI4fP272Z6XRaMSYMWNE\nrly5xLhx41LuBgwGg+jSpUuaQNi0adN3kqf3xYsXYvjw4cLe3j7Du+BmzZqJiIiILGnv1q1bwsPD\nI2Cw1iMAACAASURBVMP39Xq98PHxERMnTsyS9t704sULkT9/flGwYEGRC0SSGd+f0yCcQJw04Ziz\nINQZfLYFCxbMkiQeo0aNEgMGDLDos6lYsaIYPXq0ScfdvXtXOORwSP/furF//RHOuZyFEEI8evRI\njB4zWri4uwi1m1rk8MwhnAs5C6WjUlStVVVs2rTJoosNyXhyG8R/odu3b1OtZjWiq0ZjqJ7ZNOi/\nPAKHnxxYMmcJHTt0NLm9M2fO8IWPD1vi4qht5DGhgL+TE0d+/RUvL6+U1yMiIqhfowYrY2PxNbKu\nfUB7tZoDJ09Svnx5E3v//+7du8fgwYMJCwtj5syZ+Pn5odPp+OKLL9i3b1+qsn379mXevHlZMiM2\nISGBhQsXMmnSJJ4/f55umZo1azJ9+nRq1zb2E367xMREnJyciIuLy3DN7IMHD6hSpQo7d+6kevXq\nWdKuEIJWrVqRL18+El6+pMD69YwxGPE9TcdUYJJCwUIhaEvGy2Z1QAgQoFJRqlIlzp07R3x8fLpl\nx40bx4gRI7AxY0WAwWDA09OTnTt3mvVd1Gg0fPbZZ1StWpU5c+YY/f2Kj49nx44ddOndhVefvAKv\ntx+THttDtnSr0A0UEBgUiML7/9g777Cmsq0Pvwk1gGDvimIbCzqO44zo2BtWFHsZnXHsvWJBxzr2\nhhXbpyN2sICIooi9V+wFQUTFAkgNoSTn+yOXDDEBkoAO3sv7PHkk5+yz946Es85ee63fEiGrK1Ov\no5wGPIECQQUwjjXm4L6DNG/e3LAB89GJfEP8jSGVSvnO/jveVH+Dor4eN7cPINktIcAvgIYNG+o9\n7qlTp+jbtSvzEhP5DcgsCzMecBeLWWFlxRF/fxo0aKA6JwgCP1SrxtjgYH7X82u3C1hcoQL3Q0Jy\nbBwDAwMZO3YsJUqUwM3NjfLly9O4cWPu3VOvM7dixQomTpzI8+fP2bJ+PY9u3SI+Ph5LS0sq1ajB\n4NGjqVMn8yxrhULBnj17mDlzJmFhYVrbVKtWjUWLFtGlS5dcMfqfU6ZMGa5evZplgXtPT09mzJjB\nnTt3DCrV9zkbN25k8+bNXLlyhbJFi3I7MRHdqgNrIgClzc0pa2tLRHg4Q5OT6SeXUxJlrvA7YK+R\nEZvMzChrZ0fDtm05evQop0+fxt3dnaVLl2rkKQOUKFGCOXPmMHz4cL3mExAQgIuLC7dv39b7syQn\nJ9OpUyfKlCnDtm3bEIuzzh4VBIHLly+zc+dOvLy8qFu3LlWqVGHX2V0k9E7Qe3xSwXydOT/V+4mb\nr28i7SIFi2yueQESHwm7/m8Xzs7O+o+Zj07kG+JvjG3btjFu1TgSe+iq0JGBW9BU1pSzJ88aNHZQ\nUBDTR4/mxs2b/CaX0zs1lRIob5ZvgF1mZuwBmjZuzNING6hSpYra9ZcuXWJQ27Y8TkzUO4FdAGpa\nWbHh6FGaNWtm0PwzkpaWhru7O/PmzaN3794MGzYMR0dHXr9+rdauXtWqhIeH83taGg1TUymAUhvl\njpERm83MKF+pEhP+/FNDNerkyZNMnTqVu3fvah2/ZMmSzJ07l0GDBhm0MtMVBwcHli1blu1Ke9Cg\nQQD83//9X47GCwoKolWrVly6dIlKlSphamJCqiDkSLDgFxsbFh09io2NDRtXreKotzdR8fEAFLay\non2HDoycNInw8HCGDx/OxYsXVbnWDx8+ZNiwYVy6dElr32PHjmXBggUUKFBAp7n079+fn3/+mTFj\n9Kvzm5aWRs+ePRGLxezbty/L33lISAgeHh54eHhgYmLCwIED6devH+XKlSM5OZkSZUsQ2z4WdEsn\nV2F0yYgiT4uQYJGAtLtUN1UuUOoL7LcgwC8ABwcH/QbNRyfyDfE3hCAIVLWvSvD3wVAl+/YapCif\niB/dfUTFihUNnseLFy/YtHYtxw8fJio2FrFYTBEbG5x692boqFGULVtW63X9unShvo8P4w38yq0T\niTjfrh0Hjh0zeO6fExkZycyZMzl8+DDDhg1j9erVxMfHYwQUBNyA7igFKD4nDfAFpllY0OH331m2\nZg137txh2rRpBAQEaB2vQIECuLi4MGHCBK3SlLlN79696dy5M3379s2yXUJCAnXr1mXhwoU0aNCA\nuLg4lbSoriQkJPDjjz8yc+ZM+vfvT2pqKhIzM1IFgZys9ZvZ2DD78OEs3aPXr1+nQ4cO+Pn5Ub9+\nfbVzCoWCbdu2MXHiRBISNFeSZcuWZd26dTg5OWU5j9jYWGxtbQkODs5S1exzFAoFv//+O+/fv8fb\n2xszM81vU0xMDJ6enuzcuZMnT57Qp08fBgwYQL169TQ8JWfPnqV9l/Yk9UyCMjpOIghMT5oiEotI\nHpUM5jpPX8k9qBNeh7vXtT9Y5pMz8g3xN8T169dp0bkFicMSDdZEMz1lymiH0axYtiJ3J5cNMpmM\nojY2hKekUMjAPmKBMiYmvP/0KdeN2J07dxg7diwRERGEhYRQShC4DGh/pFDnE9BeIiGhXDkePHum\ntY2JiQkjRoxg5syZuabspAsuLi4UKlSI6dOnZ9v2+vXrtG7dGoBSpUpx69Ytvf6f01Wmtm/frjpm\nZWaWo985QK0CBdh1/jzff/+91vMhISE0atSITZs20blz50z7effuHfXr19fweqTTpUsX1q5dm+mD\n5JYtW/D398fLy0vnuQuCwNixY7l79y7+/v5YWPzjC05LS8Pf35+dO3dy4sQJWrVqxcCBA3F0dMTU\n1DTLfr29vek7sC/SplKoTearWykYXTfC5rENxYoW42nBp9Ba5+n/gxwk6yVcPXM1R3Ea+WgnX+Ly\nG+LatWvI7eQ5+q2l2KVw9vLZ3JqSzkRFRVHAyChHN2QboLCpKR8/fsytaamoW7cu58+f5/fff8dS\nELiAbkYYoBBwLCmJT5kY4T59+vD48WPc3Ny+qhEGsLW1VZO5zAy5XM7GjRuJi4sjLi6Op0+fMmnS\nJJ3H8fDw4Nq1a6xbt07teItGjciJoOJjIFIkokaNGlrPR0VF0a5dO2bNmpWlEQbldoC/v3+me7NH\njhyhevXqrFmzBrlcrnE+XdJSH2bNmsXly5fx9fXFwsICQRC4e/cuEydOpGzZsixYsIBmzZoRGhrK\nwYMH6dy5c7ZGGMDJyYmzp87iEOuAZK0Ek0ATeAvEANHAS5Ack2C+wRynEk5cOX9F+T0wNB7PCFLq\npLBq7SoDO8gnK/IN8TdEbGwsySbJOevEXNmPXC4nNDSU27dv8+DBAz58+JA7k8yE5ORkzHNY7QbA\nXCzONBo2p4hEIp7dvYurWIytntcWBpYDGUOdWrZsyc2bN9mzZw+VKlXKvYnqga2tbaaBYhkxMjLS\niKzetGkT3t7e2V779OlTJk6cyP79+zVW0CNdXFhvZYWhbreNpqYMHj5cq3FKSkqic+fOdOnShZEj\nR+rUX40aNRgwIPPMgYSEBMaNG6dyz6fz9OlTQkNDcXR01Hnuy5Yt4+DBg5w4cYLExESWL19OnTp1\n6NKlC5aWlpw/f54rV64wYsQIChcurHO/6dSvX5/LZy8TdCOIod8PxfasLYX2FqKoV1Gq3qrKzK4z\neRXyioP7DhIeHo5JSRPl06yByGvIOXY897aF8vmHfNf0N8Ty5cuZ4T2D1FaaUaA68wSKXSiGoBCQ\npkgxtjJGkAukxKRQy74WUydMpUuXLpiYGKIqnzlRUVFUKl2aTykpOdovLGpuzoPQUEqWLJl9Yz2J\njIykSrlyBMtkFDHg+hSgGFCqWjXc3Nxo06bNF4mE1od79+7Rt29fHjx4kG3bhIQEfvjhB54/f646\nVqRIEe7du0fp0qW1XiOTyWjQoAHDhw/XGoGsUCioUro029+/p4mec/8EVDQ25t6LF5Qvrx53rVAo\n6NWrF8bGxuzevTvbCOSMhIWFUbVq1SyrEDk6OnL8+HHV++nTp5OWlsayZct0GmPTpk0sWrSIyZMn\n4+vry7Vr13B2dmbAgAE0btxYr/nmBp6engxeOJi4Ljko9iEF8w3mJMUn5d7E8gHyV8TfFKVLl8Ys\nRlvYkA4ogADgEEQVjSKyUyTSMVLifo8jfnA8yeOTuVXmFn+4/kGJsiU4ffp0bk6dwoULU7xIEa7m\noI8bKIOdihcvnlvTUmPv3r10FIkMMsIApsAIsZjOjo60bdv2XzfC8M+KWJfnbSsrK3bv3q0W0RsV\nFcVvv/2GIpM84MmTJ1O5cmWGDRum9bxYLGbZ+vX0k0jI3kH+D8lAGyApLY1du3ZpnJ8yZQofPnxg\nx44dehs1W1tbjRW0paWlKnLa1NSUa9eu4e7uzoYNG1i8eLHObmmFQsHMmTOZOHEinz594tixYwwc\nOJA3b96wbds2mjZt+tWNMJA7Ywq51E8+Gny5vIl8cp1OnToxePhgZdSSPi4mBXAY5XXjQGGp5aZq\nDNSC+FrxEAKdunfi781/06NHj9yYOiKRiBGTJrHhzz9x0KM2cUY2SCSMmDBB75tBWFgYDx8+JCoq\nSvWKjo5Wex8VFUXk27fMSUszaG7p1FEo8M6wovy3sbGxQSwWExMTQ6FC2e/Q169fn3nz5jFjxgzV\nsVOnTuHm5saECRPU2h4+fJhjx45x586dLB86nLt1I/zlSxrPmsWxpCQ0qxir8wmlEX6I0svg6upK\nSkoKs2fPRiQSsWbNGvz8/Lh06ZLWCGRdmDFjBlu3blVFUScmJjJx4kTCw8P55ZdfaNGiBUOHDuXW\nrVuqlbOLiwtr167VWoby6dOneHh4sHnzZj59+sT48eOZOHEipUqVMmh+uU3RokUhZ5UvIR5sCuXA\nt51PpuS7pr8xBg8fzN/P/iatqR4Gwx9lIEd/dK9j+g4s9lrg7+ufa2pPnz59omKpUjxNTqaEntdG\nAlXMzXkeHq5X6gjAwoULcXV1zbadOcp93lF6zi0jPsCWxo05ev58DnrJXWrXrs3OnTszjTr+HLlc\nTsuWLTl37pzqmKmpKdevX1cJmISFhfHTTz/h4+PDzz//rFO/uz08GDNsGK3EYkYmJtIU1LYpnqDc\nE94JpCoUJH72UDRjxgzq1avHmDFjuHTpkqq2saHMmTOHuXPnqt5bWFgwYsgQ3jx/TnxcHLKUFM5e\nv0562JZEIiEiIgIbG6UxioqKYv/+/ezcuZOXL1/SuHFjTp8+zcmTJ/nxxx9zNLfcJjk5meJlihPX\nO065f2IAJgEmjPxpJKtXrM7dyeWTb4i/NR49esSPjX4k6bckZaJrdkQDW4ExZC6HlRkPoMaLGjy8\n/VDveWojLCyM+rVrUz4ujktoz83VRgrgaGFBvUGDWLZ2req4IAjEx8drXeFmfH/nzh0ePXqU7ThG\nwHwg+0SfzPEATnTuzG4dgpy+Fh07dmTo0KHZRhVnJDw8nNq1axMTE6M6VqNGDW7evImxsTFNmzal\na9euTJkyRa+5xMXF4bFzJxuWLSMxKopyxsYYAx8VCqLEYgYPH86QkSN59eoV7dq108j7lUgknD9/\nPlcMXVxcHJUqVSIyMhJLlKIxv4nFNFIoKIBSJe4CsBPlA4Pc3BwvLy/S0tL4+++/OX36NO3atWPA\ngAFYW1vj7OyMl5cXTZrouxv+dZg6fSqrL6wmpXXme+OZkgrma815eOehVo9APjkj3xB/gyxbsYw5\nK+cg7SOF7ASB/FHeRdoYMJACLDZYcP7EeerVq2dAB/8QHh5O06ZNCQ0NRQJ8D5wArLO5Lh7oYmxM\neIkSVK9Xj+joaJWRjY6OxtTUlCJFilCkSBEKFy6s+jnj+8ePH7N48WKd5tkIuJiDzznE3JxKM2cy\nTYcV+JdGEAQ+ffrE8OHDsbGxoW7dujpHFwMcOHCAXr16qR0bNWoUBQoUICgoCF9fX5VLWt/9cEEQ\nePLkCR8/fiQtLY1ChQpRs2ZNtejoq1ev0rp1aw1jPG7cOFatWpUre/BdO3XinK8vS4E+gLas6URg\nHzBNLCZGoaBg0aJMnz6dQYMGUbBgQe7du0fr1q3Zvn077dvrqqD+9Xn16hXValVDNkSW/R/eZ4iu\nivgl9RfOB+QdT89/E/mG+BtEEATmzJvD8vXLkbaRQiW0h92lAiuAoSjzawzA6KIRvUr3Yvffu3Vq\nL5fLiYmJUVuVPn/+nAULFhAVFaVqZ4bypjcGGI665jzAB2CzSMR6IyMq2tszYOhQihcvrmFkddkj\nvHnzJq6urlqNdcZjFhYW1K5alasJCRiSbBQDlDc25mFISJbazl8LhUKBhYUFycn/pLzFxMSoXKu6\n8Ntvv/H333+rHbO2tsaxSRNOnzlDTJIygraQhQWdOnZk5KRJueaWjYyM5IcffiA8PFzj3MiRI1m7\ndm2OgodWL1/Optmz8ZdKddLCfg20Njen9E8/cf/xY/766y+aNGlCixYtWLVqFT179jR4Ll+LufPn\nsnTLUqR9pbp7yJ5DgeMFuH7pOt99990Xnd//KvmG+Bvm0KFDTP1zKhGRESTVSUJRQaHc6EwFPoLk\nmoSkpCQYnYNBosF6tzUH9x3MMtgp/X1sbCwFChRQGTlLS0tu3rxJ/H+0gdNp0qQJgwcP5sThw/gd\nP04DU1NKyuVKIX8jI66kpNC9WzdGTJzIDz/8kIMPoB9Txo1D2LiR5VoKBWTHapGINcWLY2Jjw6pV\nq/LE6qhKlSoEBwer3t+7dw97e3udr4+Pj6d27dq8fPkSUOZJWwETxWL6KhQqrfF3wB6xmI3m5hQv\nX54127erFfzQl6SkJFq1asXly5czbTNkyBDc3d0NMsZXrlyhe6tWXJZK9coZDwccLCxYsH49a9as\n4dGjR7i6ujJr1iy95/BvIAgCo8eNZsehHUi7SiE93CI9fjPjf6UCRHdFWF6w5MTREzRq1Ogrz/Z/\nh3xD/I0jCALXr19nxZoV3Lh9g4S4BMwl5pQtW5aG9Rqy9dRW4rrlIFwyGVgKDeo3oGjRohQrVowS\nJUpQrFgxrS7hQoUKqYQh5HI5P/zwg0ZVo27durF3715VrnJsbCxnzpxRrZgLFy5Ms2bNdIryzW1e\nvnzJT/b2HExIoLEe1z0CmltY4Hf+PO/fv2f8+PFUrVqVVatWaRS/+Jq0atVKLRXt6NGjdOzYUa8+\nnJyc8PHxwRL4G+hK5nmPcsATGGNhwba9e/Xal1b1IZfTq1cvDh48qHbczMxMbXUPyhX71q1bMy3z\nmBm9O3Wi4bFjjDXg9rcBONGiBU/+s49+7tw5hg8fjqurK+bm+oo4f30EQWD1mtW4znIlxSQFuVSu\n/DsH5Sq5EogkIixCLbAtY8uBXQf01h3PRz/y05e+ARQKBZGRkcTGxmJhYUHRokVVLlmRSMTPP//M\ngd0HNK47evQo205ty9nggnKMDx8+EBoaSmJiIlKpFGNjYywtLbN9VaxYUc0Q16tXj+7duxMQEKDW\nrl69eqqfTU1N/7Uc3AoVKrDr4EG6demCV1KSTiIU94AOEgnLN2xQ7aW3atUKNzc3HBwc+OOPP5g5\nc6bOFX5yk8+FMHSRu8zIvn378PHxwQrl3nnmRR+VGAG9gcpSKe379OHwyZN6r6SmTJmiYYSbN2/O\nypUrcXR05P3796rjO3bsIDU1lR07duhcxerdu3f4nzqFu4FrkP6Ay5kzDJswgRUrVvD27VvGjRuH\nvb097u7utGzZ0qB+vxYXL15kw5YNiCQiFHUUYM8/m+MJQBCIb4opVrIY2zZuyzfCX4F8Q5yHeffu\nHe6b3Vm7YS3SJCnGEmMUqQrkMjldnbsyaVzW+3FFixZFiMuhwyMeihQvwosXL1SHBEFAJpORmJiY\n5Ss6Oprjx49TuXJlQkNDKVeuHFWrVuXAgQNZXicIgk5G3pCXRCLJ1si3adOGdTt24NirF/2ACYA2\npeNQYJOJCdtMTFi7dSu9+/RRnTM1NWXKlCn079+f6dOn891337F48WL69ev3VUURbG3VHa+6yF2m\nExwczJAhQ7BAmYaenRHOyI/ANqmU33r04Onr1zp/Zjc3N1atUtczrlmzJocOHaJgwYKcO3eOFi1a\n8PbtW9X53bt3k5aWpiobmBUfPnxg+NChdExJ0SnpQBvWQG+xmCL/8diULl0aT09PfH19GTRoEE2b\nNmXFihVfXVdcFzw9PRk4ZCBJbZPgOzRdGzZAE5D/Iuflw5e0dGzJ3p2GeTby0Z1813QeJCUlheGj\nh7Nn7x5ENUXI6srUo5kSQXxXjPldc+zK2eHj5aO1rGFqairFyxQnpnsMeifu/gfjM8YMrjWYjes2\n6nVdYmIi7du3p2rVqmzatIk7d+5gb2+vk6B9ampqtkbe0FdycjIWFhbZGuw7d+5w+/ZtjFAqZtUA\n2ohE2AgC8cAtiYRrQFdnZ/4YORJ7e3ssLCwydZFevXqVMWPGYGJiwpo1a3IU0LR9+3bMzc2znL+F\nhQVisZjt27erag2Dsizi3r17sx0jOTmZRo0acevWLWoB9w2YpwDUtbJi6cGDtGmTfdj+oUOH6N69\nu5oKWKlSpbh69arayj44OJgWLVpoBHE5Ozuzd+9eje+YTCbD19eXnTt3cv78ecoWLszI0FB0jx/X\nZDNwo29ftuxWD2JMSEhgzpw5eHh4sHjxYlVFqrxAYGAgHbt1JKl3kmZ0ZGa8AQtPC0766u/ZyEd3\n8g1xHiMpKYlW7VpxJ+oOSR2Sso5sVID4hhjrG9ZcOHOBWrU0NYtm/jmT5QHLSW5rQLGINJCsk3D7\nym29oiWlUikdOnSgYsWKbN26NU/J4snlcqRSaZbG+sOHD0ybNk1tP7Jq1arKPcrERFIVCsRGRpiZ\nmZGUlKS6TiqVYmZmlqVxjIiI4M6dO1SqVAlHR0dKlCjBkydPqFu3LiVLlszSuJqYmCCXy3V2wUok\nEkxNTYmNjVUds7a2pnHjxtk+iOzfvx9fX1+sgI0o3bGGsBnwa9mSI5nUZ07nypUrtGjRQq2gh5WV\nFRcuXNAqRBIaGkrz5s01VvidOnXC09MTU1NTrly5ws6dO/H09OT7779nwIABODs7M3LAAFodOcJA\nAz8TwB7Ap3179mVSG/vOnTsMHToUS0tLNm3aRLVq1XIwWs5JS0ujVPlSRLaKRO+UgKdQ6nIpXofo\n7tnIRz/yXdN5CEEQ6N6nO7djbyNzlmWvBC4Gxc8KYiQxNGvdjKCbQZQpo14pfMSwEaxYvQIaoH/l\nlTtQq2YtvY1wp06dKF++PFu2bMlzf7hGRkYUKFAgy/3aefPmqRnh4sWLc/fuXSSSrPM9BEFQM8yZ\nvSIjIzl69Cjr1q2jZs2a3Lp1CxMTE7777juKFSuWaR9isVitnm12JCUlKaPmMxAXF8exTIyHNlKA\n7jq31qQvMO7cOWQyWaaBTM+fP6dTp05qRtjIyAgvL69M1cAqVqzImTNnaNSoEREREarjR48exd7e\nnrS0NMzMzBgwYAB37txRW1EXKFiQeG2d6kEcYJ1FMGHdunW5evUq69evp1GjRowePZrp06cbLMmZ\nU44dO0ayRbL+RhigKsRfiicgIEAnz0Y++pO/Is5DnDx5EudBziT+nqj3I5JxgDH9v+vP9i3bNc4t\nXLyQv9b/hbSfHrmDIWDlY8Xl85d1TndJL0tXsmRJduzYoXcka14gISEBW1tboqOjVccWL17M1KlT\nc32sR48e0bhxY7WxatWqxZo1a2jevLlaW0EQSElJ4cWLF181eKYYypzunFBILKbyd99hbmyMtbU1\ntlWr0mvAAJo0aUJkZCQODg5qMQgAW7du5Y8//tDaX7qus4eHB69evcLExITUz9LNfv75Z06fPq1R\nlhFg7Zo1XJk+nT0Gap4DDJBIqDt/PhN0qNn8+vVrxowZw+PHj3F3d6dZs2YGj2soDZs35EqhK/pt\n9GfkJrSUtyTAL2vPRj6GkW+I8xCt2rfitNFpZaSLvsSB+WZz3r95j7W1umyOIAiMnzSerfu3KnMH\ns4ohUQD3wfKMJb6HfXW+achkMpycnChSpAgeHh7fpBEGWLFiBZMnT1a9L1iwIGFhYRr/p7mBr68v\nnTp10nque/fuLF++XCPYKjIyEhcXl2xX3Z+vhA2lJBCRbausKYYy4K0qkAa8BNxFIhLNzEgxMSHu\nsxzzWbNmMW/ePLVjGXWdr127pjGGhYUF0s8Ma/PmzTl69KiGMf706RN2pUvzVCbDkDpe6brnwa9f\nU6SI7rW6jhw5wtixY2nVqhXLli3T69qcEBsbS7FSxUidmKq71vznJIPxCmPiY+O/iRStb418Q5xH\nePXqFVVrViV5TLLuIsyfYXnEksV/LGb0aO0KHmvWrcH1T1coBQm1E5R3xnTPsVSZvG8RZEHpoqXx\n3O2pEvjPjuTkZLp27Yq1tTW7du3SeQ8zryGTybCzs1NzdWozCrlFcnIybm5uzJ8/X0PGEcDc3Jyp\nU6fi4uKil0salClv6Xvhbdu2JSgoSHVuwYIF2NnZaRjvgIAArl+/rtaPJUqZUUPDjRQoVVjfoa7G\nKgDnAFfgLpBuQo2NjalduzbVqlWjUqVKJCYmcvfuXS5evKix6s3IH3/8wdWrV3n48B9d9AYNGnDy\n5Emt2xCD+/Wj0v79TJfLNc5lxzKxmEfdu7N9/369r42Pj2fWrFns27ePZcuW0b9//y8ezBUcHEzd\nX+qSMELzO6YPktUSgh8GZ1qbOh/DyTfEeYQtW7YwfvN4pB0Nd5fxBBq8a8CVM1cybSKTyfD09GTJ\nqiU8vvcYsZkYeaocI5ERTs5OTB43mZ9//lnnm0NycjLdunVDIpGwd+/eb9YIA7i7uzNixAjVewsL\nC8LCwvSu9qQvERERTJs2jZ07d2o9X758eVasWEG3bt0Mumn36tWLAwf+yTPfsWMHAweqhyqdPn2a\n1q1bq0Ust2nThtePH7MhPJymeo+q5DhKY3s7k/NyYAiwn3+MsT5IJBKcnZ0ZPHgwNWvWpHXr1gQF\nBWFjY0OzZs3w9PTUmtJ0//59WjZowGmpFN11xpSlGVtYWOB/6ZLO1ay0cfPmTYYOHUrhwoXZrHR8\nTwAAIABJREFUuHGjzqIvgiCQkJBATEwMsbGxxMTEZPlzTEwM796940HYA4SJObvVW6y14PHtxxq5\n6fnknG/3rvlfRlRUFMkSAyKbM2KF2n6jNszNzfn111/59ddfSUlJITo6mr59+9K4cWO1knC6kJKS\nQo8ePTAzM2PPnj3ftBFOS0tjyZIlaseGDRv2xY0wKFN0/v77b4YPH86YMWO4deuW2vlXr17Ro0cP\nmjdvjpubm14SlZC9qMf79+/p37+/mhEuWbIkHh4eHNi/nw3TptHU0BrSZF1W0ghlcbBolPVJZFm0\nzUjz5s0ZMGAA3bp1U1vxBgYGMnnyZBYuXMiQIUPo2bMn+/fv10hpsre3x23LFtoNHoxfUhK1dRjz\nAdDewoLlGzYYbITlcjmxsbEUKVKETZs2sX37durVq0erVq1o2LAhCQkJWRrY2NhYzM3NsbGxoWDB\ngqpXxvdFihShUqVKquMKhYKuvbqSIqTkyLWRkpDyr6jd/S+QvyLOIyxevJiZfjORt9TfVabiNZQO\nLE2AbwAVK1bUeS/n7du31K1bF29vb531gVNSUujZsycikYgDBw5kK6SQ19m1axe//vqr6r2pqSkh\nISEaUehfGoVCwY4dO5g2bRofP37UOG9kZMSIESOYO3cuhQvrVslj3bp1jBkzRvW+b9++7NixAxMT\nExQKBe3atePkyZOq8yKRiFOnTtGyZUtiY2OpULIkQTKZToURMvIcZbB+OJCdY/0DYItuhjg9Raxa\ntWpUrVqVatWqUa1aNSpXrkyJEiWQSCRYW1uTkpJC7969SUlJwcvLS+vfw/59+xjzxx+MTE5miFyO\ntt/2W5R72u4SCcvWr6dd+/ZqK05dV6axsbEkJiZibW2tZjhNTEx48uQJiYmJODk5YW9vr9XA2tjY\nYGNjo/PfmiAIPHr0CG9vb+YumktK9xSooNOlmjyHyncr8/zBcwM7yCcr8g1xHiG3XNM2Z2wobl2c\nV69eUbx4cSpVqqT1VbCguq7QoUOHcHFx4e7du1hZWWU5TGpqKr169UIul6tyNr9lFAoF9vb2ajWL\nhw4dyqZNm/61OcXExDBv3jzWrl1LWlqaxvkiRYqwYMEChgwZkmVgXExMDFMmT2bftm0ko9zzlYvF\nKIyN6dGlC1bFi7Nu3Tq1a2bOnMn8+fNV75f+9Rd7Fy7knFSqc/W8T8AvKCtrjcmmbTpdAB+U+8fp\nGBkZYWpqikwmU63Y27dvj0Kh4N27d0RGRhIfH49UKlXtIRcoUICGDRtStWpVKleuzMGDBxGJRPj6\n+gJoGMtHjx7hd+gQ169f5xe5nOagqkd89j8vAVD8xwBqM5CZrU4//7lAgQJaU/oEQeDQoUOMGzeO\ndu3asXTpUoNWn2lpaVy6dAkfHx+8vb1JSUnByclJ+YB3eQfSLobdXyy9LHEb75ZpJHs+OSPfEOcR\nwsLC+M7+O2RjZEopJwOwPGLJokGLGDNmDHK5nPDwcF68eKF6BQcHq342NTXVMM5eXl5YW1uze/fu\nTPN/U1NT6du3L0lJSRw8ePBfy4vMTQ4fPoyzs7PqvVgs5tmzZ1SqZEjSZe7y+PFjxo8fr7Zizcj3\n33/PmjVraNxYvUSFQqFgzvTprF2zhjZAD5mMZJSlGo1RxgOGi0SsFQSkKGvuAjRu3JjAwEC1bQZB\nEBgzZAhX9u7FVyqlVDZzfg20B9oCy/T4rBeBdijljnOCra0tZcqU4cOHD8TExJCQkKDKURaJRJiZ\nmWFlZUXBggUpVqwYpUqVQhAEjh8/Tv369ZGYmCCkpHDx2jWSMgSInTlzhqZNm37R4KrY2FhcXV05\ndOgQK1asoHfv3tmOl5CQwMmTJ/H29ubYsWOUL18eJycnOnfuzPfff49IJCI2NpZS5UqR9EcSemt7\nRoHlTks+vP2gd9BgPrqRb4jzEC3btSTQJBDqGXBxPEg2S4gIj8i23qwgCHz8+FHNSL948YJnz55x\n8+ZNjIyMqFy5soahtrW1Zfbs2SQmJnL48OH/CiMsCAI//fQTN2/eVB3r168fu3bt+hdnpY4gCPj4\n+DBx4kRCQkK0tunTpw9Lly6lbNmyyOVy+nfrRvjJk4xKSmI/cAFoCRRBmUIUBtwC+qHUeVkBmFhb\n8/DhQ8qWLat1Dn/NmcOKJUvoJRIxUibT2Fe9jVKFywtlgNYk9NuSlP5nLprrf/2oW7curq6uaqvR\nAgUKMG7cOIKDgxk1ahSvXr3i6dOnPH36lMePHyOTyahevToODg4qd/emTZs4fvy4qt8vGUH/Odeu\nXWPo0KGULFmSDRs2aDwURkREcPToUby9vblw4QINGjTAyclJJaajjYVLMugJ6JqBlAQWHhYscFnA\nhHETcvip8smMfEOch8iJoIfRaSN+rfarVkEPfbh69SpOTk7s2bOHuLg4lZF+/vw5V69eRSqVUq5c\nOSpXrqzVWP8bFYZywqlTpzTUgu7fv69VLvTfRiaTsXLlSv766y+NnFlQRnnPmDGD8OBgnuzfj0lS\nEh9QlqPuyz8FdtJ5hVKCcgvQCvC3sODGgwdadcvTiYiIYKu7O5vWrqVgWholxGIE4HVKCh9lMlwE\ngUEYJm0uoAzeyskNydLSknbt2uHp6alxTqFQMGzYMB4/foyfnx/W1tY8e/aMZs2aMXv2bKpVq8bT\np0959uwZT58+5ebNm2qVnooXL87cuXNVhrp06dJfdHWcmprK6tWrWbJkCZMmTcLR0ZHjx4/j7e3N\n8+fPcXR0xMnJCUdHx2wfvkH5MDVkxBD2Ht+LtIdUPZ9MG7FKnek/uv/BmlVrcudD5aOVfEOch1Ao\nFHTs2pGzr86S1Dkpe4nLdO5DkUtFtEpcGsKcOXO4evUqfn5+iMVi5HI5AwcO5MOHD3h5ealW0xld\n3S9evCAkJARLS8tM96VLlCiRZwTw02nWrBnnzp1TvXdycuLIkSP/4oyy5/Xr17i4uGRavKEQUBH4\nCVhL9s90EUBHlIa6TOfO7PX2znYOaWlp3Lt3TxWl//r1azaOG8e1OMNrXyf8Z+5pKKP7K1eujJ2d\nHYUKFdJpT9ba2jrbQCaFQsHo0aO5ffs2W7ZsoWPHjsyePVutMEY6Hz58oGTJkmrR5H379iU8PJxn\nz56RkJCgMsoZ/61atWquCMCkpaVx8eJFPDw82Lt3L2lpaTg5OTFs2DCaNGliUGyGXC6nbYe2nA48\nDTVRRtN9XgDiLXAVjJ8ZM2/2PKZNnZbn/m7/28g3xHmMpKQkWji2ICg6iKSOSVm7kBTKuqHW1605\nd/octWvrkoSRPWlpafzyyy/069ePkSNHMmjQIF6/fs3Ro0ez3CMSBIF3795puLzTX0lJSdjZ2Wk1\n0ra2tl89/Sk5OZnhw4ezc+dOFAoFoHQJ/vTTT191HoZy4cIFxo4dy927d1XHzIAqKO+vm9HdNfwJ\naAi8NjYm+PVrSpTQfU0bFxfHypUrWTp3Lu9A54CuzwkAuqK+R+zg4MDChQtzVRZSEASGDh2Kh4cH\ns2bNwtXVNdO2P//8s5rIyf/93//x+++/A8pAuOfPn6utop8+fcrz58+xtrZWRXNnNNIVK1bM8mEh\nPj4ef39/fHx88PPzw9bWVuVyfvbsGRMmTMDJyYlFixZpBFxmR2pqKr369cL/pj/SRlJ4A9xEeY+x\nQumKSABSge9A8l5Cs9rNOHzgv2MbKi+Tb4jzICkpKQwdOZR9+/dlWwaxYpmK+Bz0wc7OLlfnEBwc\njIODA40aNSI2NpZjx47lOFAjo6v781dERARly5bVMNDpqyJtmsG5wYcPH6hSpQrOzs6qYgzfEnK5\nnK1bt+Lq6kpUVBQmKL8qL9BfzfAO0AKYOHs2s+bMybb927dvcXNzw93dnbi4OCyApWSdN5wVbYBT\nmZ1r04aVK1fmis72p0+faNq0KQUKFEAqlXLq1KlM88Xnzp3LnAz/F927d9fq9s6IQqHgzZs3KuOc\n8d83b95ga2urZqALFy7MixcvOHv2LBcvXsTBwUFlfMuVK6fWd0xMDNOnT8fHx4dVq1bRo0cPnVar\ngiDw6++/cuj6IZKck/75csiB90C6IqoFyn0FMcrqa0ckOFZ35OD+g/mr4i9IviHOw0REROC+2Z21\nG9aSJEtSqmAlyZGnyGnYqCFjRo6he/ec1MbJHIVCQdOmTblz5w6vXr3SOWfVUFJSUnj58qVWl3do\naCgFCxbM1OVdtGhRg28Srq6uREdHs3HjRgRB+GZvNp8+faJfv348OH6cEcB0A/tpAESVLs3zN28y\nbfPo0SOWL1/Orl27NGQnbYFQ9NeNeA3Ym5vTulMnvLy80HZbunnzJvXqGRLJ+A8JCQm0bt2ahg0b\nsmzZMmbOnImvry8BAQEUL66pPH3jxg01D4m1tTWRkZEG583LZDKCg4MJCAjg+PHj3L59m5iYGIyM\njBCLxVSrVo2aNWtquLo/fxC9fPkyQ4cOxdbWlvXr11OhQoUsxz1y5Aj9x/Qn8ddE/SR0U8HSw5It\ni7fQp08f/T9wPjqRb4jzOAqFAj8/PxatWMTNmzcxK2OGyFyEKFVESkQKVStXZeqEqTg7O+ea+0ih\nUDBixAgePnxIoUKFqF69OkuXLs2Vvg2dz9u3bzNdTaelpWVqpMuVK5dpnm1MTAyVK1fmxo0bWQYo\nfSusXr0a1wkTOItyv9cG5eJGH4f/bmC8sTEfPzOwgiBw4cIFli1bpsrH1YaVSMR0YIYet5U0oLOF\nBfZDhrBk9Wru3buHq6ur2jgmJiZMnz6dSZMmGbz/KpPJ6NChA3Z2dmzevBmRSIQgCMyZMwdPT09O\nnz5NqVLqyVkKhYJSpUrx4cM/NajOnDmjt6s8fb/X29sbb29vFAqFKsWoSZMmmJiYEB0drbGKfvr0\nKcHBwRQpUkTD1V2hQgUOHz7MypUrmTZtGuPGjcv0AaFBkwZcK3YNnSTEPucR1A6pTdCNoOzb5mMQ\n+YY4DxMeHk4Lxxa8S3xHQp0EqIV6jrEceApW96wwjzXH39efH374IUdjCoLAqFGjCAoK4sSJEyQn\nJ1OnTh127dqlUZovr/Dp0yetBjo4OJjIyEjKly+v1Uh7eXnx4sWLTDWevxUEQeDy5cuM/O03ngYH\nUwJltctYlB7GIf956RLGFwWUBZL+c1uQy+UcOXKEZcuWaa16lE7RokUZPXo0Xbt2pWPLlkyJjmbM\nf/bdsyIZGGhuTuxPP+ETEKBmSC5fvsyMGTO4cOECJ06cYNeuXRw/fhwXFxdGjRqVbX3ojKSmptK9\ne3ckEgm7d+/WeDhbsGABHh4eBAYGagQ8/vbbb/z999+q91OmTNHpwTR9v9fb2xs/Pz8qVqyoMr61\na9fW2fuiUCh49eqVVlf3+/fvKVOmDHFxcYhEIoYMGYKjoyPVqlVTeYqePn1K3QZ1SRqdZJiosRwk\n6yVcCbyicyGYfPQj3xDnUUJDQ6nvUJ+YujHIf5Zn7+t7BJb+lpz0O0nDhg0NGlMQBJXWsb+/v2rl\n4e/vz5AhQwgKCvrmtGaTkpIIDQ3VMNLPnz8nODiYYsWKUb16da2G+ku743ODZ8+e0adTJ+LfvGF4\nYiK/o4w8TucBytzevUBPYA1Z68XIUW4fxick4OHhwYoVKwgODs60vZ2dHZMnT2bgwIGqGILQ0FDa\nNW1KnchIxiUl4YDm1zcVOAIssbSkQpMmeBw8qNWwpss0pu8NP3z4kD///JNr164xa9YsBg0apFOk\n9IABA/j06ROHDx/ONNp46dKlbN68mcDAQLVc3AMHDtCrVy/V+xo1aqhVecrI27dvVapWly5domHD\nhqr9Xm352TklKSlJFTDm6emJr68v1tbWyGQyxGIxVatWRZok5aHlQxRts38wygyjM0aM/XEsK5ev\nzMXZ55NOviHOg8THx1Pz+5q8qf4GRX09/nieg/UJa+7euKu3q1UQBMaPH8/Vq1c5efKkRl7iuHHj\neP/+PXv37v1m91Ez4ubmxrlz51i1alWmLm+xWJypy7tMmTIa6mPv3r1jzJgxGm3Lli37Reoz3759\nm/bNmzMvPp7BgpBltlscMABlUOxRlCtmbUiBgiIRBYsW1ap1nU79+vVxcXGha9euWj9bbGws27Zs\nYePKlVjFx+OckEBRlAY43NiY3SYmVK1enREuLvTo0SNTJbfMuHHjBq6uroSEhDBv3jx69+6dqXTk\nyJEjefz4McePH892Fb1q1SrWrFnDmTNnVPuuMTExFC1aFHmGkomhoaFUqFABQRB48OCByuX84sUL\n2rdvj5OTE23btv0idayzIjo6mqlTp3LixAnmzZtHlSpVmDJjCletr0L9HHR8B5wlzhzcezDX5prP\nP+Qb4jyIm5sbM/5vBlJn/XVhjc4YMbDaQLZt2qbzNYIgMGnSJC5cuMCpU6e0pkUkJSXx448/Mn36\ndPr376/3vPISKSkpVKpUicOHD/Pjjz9qbSMIAlFRUZm6vGNiYqhQoYKawZVKpUyfrhkmZWpqqmr7\nuQiKPsU5MhIWFkbDunVZ8+kT3XS8Ro5SSUsOHEC7k+UO0Jh/JC8/p0OHDkyZMoUmTZro9ECmUCg4\ndeoUZ0+f5tP79xibmFCsTBm69+yZKxHQZ86cYcaMGSQmJrJgwQI6deqkNq9p06YRGBhIQECAzkZx\n/fr1LF26lMDAQJWiVdOmTTl//jygzD3v27cvDx8+xMfHB0EQVC7nxo0b54kCKBcuXGDYsGFUrlyZ\nNHEaxzkOdXPQ4X1wTHPk+JHj2bfNR2/yDXEeQxAEylUqx5umbwyrlBIHki0Szgac5YDXAUJehSBN\nklKkUBGaODShX79+akUdBEHAxcVFdbPKyvV89+5d2rRpw/Xr17ON0szLbNu2jQMHDuDv729wH4mJ\niYSEhKgZ6PPnz2fqsswMkUhEmTJlMl15Z/b7GNSnD2UOHGC+DvuwGUkGfkDpom6prV9gJ0pjnY6J\niQn9+vVj8uTJuWI8cxtBEDh69Ciurq5YWVmxcOFCmjdvzqJFi9i9ezfnzp2jSJEievW5efNm5s+f\nT0BAANWqVePgwYNcvnyZ9evXI5FIqFy5ssr42tvb50kvUXJyMsuWLWPBogUk/5KsTBQ3lOvQv0R/\nPP7PI9fml88/5BviPEZgYCBOA51I+CPB4Nqh4j1ixK/FCD8KyAvLlQEaSWAZbonwUqB/v/5MnTyV\nihUrMn36dPz9/Tl9+rROe6LLly/Hx8eHM2fOfBF365cmLS2N6tWrs23bNpo0aZKrfbu6urJw4cJc\n7bNQoUIaxrlYsWL079GD58nJaCbcZI87ynzdz52McShzkNNTSs3NzRk1ahQTJkz46uUgDUEul7N/\n/37+/PNPTExMiI+P58aNGxqR0LqyYsUK5s+fT61atbh37x6NGjUiLi6Otm3b8ueff+by7L8cq1ev\nZvKqycgHGV5i1crTirWT1/Lbb7/l3sTyUZFviPMYc+bMYV7gPISWOfi1BAHPgB5azsWC8W1jzO+Z\n08mxE48ePeL06dM6rxgUCgWtWrWidevWWt2weZ19+/axbt06Lly4kOurmMePH3P9+nUNV3ZkZGSu\njiNCWTLwkIHXx6PM972HMkI6nYnAJpT7xOnUqVMHNzc3mjZtauBoX4/3799TokQJtm/fzsSJEzE3\nN6dhw4bMnz+fGjVqZHu9IAjcv39ftd8bGhpK9erVefjwIcePH6dBgwYcPHiQLVu2cOLEia/wiXKH\nlJQUipcuTmzvWChmQAfhINkvwWOHB4ULF6ZixYrftEcsL5JviPMYI0aPwP25e87cSM+Aa8CvWbQJ\nBdE+ET5ePnTs2FGv7sPDw/nxxx/x8/PLscDC10QQBOrUqcPixYtp3779Vxs3NjZWzY2dUbAkPDxc\nq3hFVlgDe4AOOZhTP5Su6XSFZTdgBupGOCM9evRg2bJl2Nra5mDUL8fOnTsZMWIEEydOZOvWrQQG\nBlKhQgXVfm+7du2YM2eORhBjamoqFy5cwNvbGx8fH0QiEU5OTjg5OdGoUSNMTEzYt28f48eP58SJ\nE9jZ2VGmTBnevXv3xdTevgTTZkxj1ZlVpDim6HaBgFKZ5QbwAkxLmCKxkUAqpLxPwb6WPVMnTKVz\n585fXZr2v5F8Q5zHmDBpAqvvrVZWVTeUJyhr0vXNpl0wWB+3Jiw4TG/d2v379zN79mxu3779zdQo\nPXr0KH/++Se3b9/OM3t6ycnJKkWxz18hISEkJydrXGMNBGJYtcx0JgGlUBrkucAhCwuWrl/Po0eP\nWLduHUlJSRrXmJubM3XqVFxcXPLU7/zw4cN0795dpRe+ZMkSXFxcVOdjY2NZuXIl69ato0+fPowb\nN447d+7g7e3N8ePHVfu9Tk5O1KxZU+t34+DBg4wcORI/Pz+mTJnChAkT6NSp01f7jDnl3bt31Khd\ng0/NP0F2zoE4YB9KpZX6KEVAMmoFpQGPoUBQASxkFpzyO4W9vf2Xmfj/CPmGOI+xYsUKZnjOIKWd\njk+u2riKUj/WKfum5ofNmdljJjNmzNDbOP36668UKFCADRs2GDTNr4kgCDg4ODBp0iR69NDms897\nZKYodubIEY4lJ6M93ls3xgP+KBc9oAziSsfU1BRzc3PiMqmkVK5cOZYvX66zzvGX5NSpU3Ts2JGU\nlH/+XszNzQkNDaVkyX8E2sPDw9mzZw8bN24kLCwMOzs7Ro0aRe/evSldurROY3l7ezN06FB69epF\namoqGzduzPXP8yW5ffs2TVs1JaFFAmRmN2OA7cCPKBcD2f1674NVoBWB/oHUr5+T/Kj/bfINcR7j\n5cuXVK9dHdkYWdbKC5khoIzGaQNUyqYtQBiI9oiQGElU6TR2dnZUrFhR9XOFChW0uuFiY2P5/vvv\nWbt2rd7u7a/NmTNnVLKd32KQWTpyuZwaZcqw/P17crIe64wynzgnlChRAmdnZ3755RdVIFmRIkW+\nmnG+dOkSbdq0UavNLBaLOXDgAM7OzgQFBanENV6+fEmHDh1wcnKiRo0arFq1isOHDzNhwgTGjh2r\nlkmQFX5+fvTv3x9TU1MiIiL+9QcRfbl//z4t27YkqVCSUq2vCv+UW00GtqJMc9Jna+wJFAwoSNCt\nIDUhlHx0J98Q50FaOLbgjNkZZZ6JvrwCvFFWg9flHiGA1TYr9rnvo3Tp0oSGhhIaGkpISIjq37Cw\nMGxsbNSMc/q/Hz9+ZNy4cdy9e1ev0nlfm1atWtG/f/9vOuozMTGRfv364e3tTSfAx8B+Po+Ozk2s\nra3VSl3a2dnh7OxMsWKGRAllzp07d2jevDmxsbFqx6dMmYJMJsPHxwcjIyO1/d7P9zKfPXvG7Nmz\nOXv2LDNmzGDo0KE66bX7+/vTvn17tm7dqiqJ+C0hk8k4cOAAS1Yt4eXrlxiXNUZuIic5PJk0y7Ss\nY0sywfi0MX/Y/4H7evfcn/D/APmGOA9y4sQJuv/RncSBelZKUaBU7U8vSKsjlscsWTN8jdbi6KB0\nkUZERGg10qGhobx9+xZzc3MaNGigdVWdk+pIucG1a9fo2bMnwcHBeUJswRDevn1L586duXXrFqD8\nWrxEs6a7LqwTiTjZvDkvP37k/v37quOlS5dGJpMRHR2dG1NW8fDhQ52ilnXlyZMnNGnSREP5SyKR\nYG9vrzK+NWrU0Ol7d/fuXWbOnMmDBw+YM2cO/fv3zzYAycnJidOnT+Pt7U3Lltoysr8N7t27x7Nn\nz4iNjWXqrKlEtYkCQ+qfxIDF/1nw4e2HbyqILa+Qb4jzIIIgMGDQAA5dPYS0m1S3wrIKwA+lan8/\n9BJ3NztpxpKeSxg3bpxB842Pj8fBwYEWLVpQvXp1NSMdGhpKamqqxko63UhXrFjxiwf+dOnShVat\nWjF69OgvOs6X4t69e3Ts2JHw8HDVMTOUTo/levaVBNS1tGTTsWM8f/6cIUOGqM6VL1+e0NBQ4uLi\nNMRK0t+Hh4ergqJ05ZdffqFKlSpqq+R0LW99H9DCwsJwcHAgIiJC7Xjnzp3ZuHGjzvu92rh48SIz\nZszg48ePzJ8/n27dumU6Pz8/P1xdXXnz5g0eHh60bdvW4HHzAmfPnqVjv44kDkk0WL/A8qAlK0at\nYNiwYbk7uf8B8g1xHiU1NZWefXty6vYpEtslZp3/FwecQCkk3BfQUzHR8pgla0eszZGb7cmTJzRu\n3JiLFy9SrVo1tXMxMTFaV9KhoaG8fPmSggULajXSdnZ2OdZpvn//Pm3atCEkJESvaj15hRMnTtCz\nZ0/i4+PVjpcrV47YiAjWp6Whq+BoKtBLIsGiXTs8vLyIi4ujZMmSyGQyVZvAwMAsq2yl141Oz8fO\nSo8alPvIu3fv1jDsL168QCQSqRnmjIY6Y/lKQRAICgpi165drF27Vi0wC2DSpEksW7YsV7wugiDg\n7+/PjBkzEIvF/PXXX7Rp00ajb6lUSsmSJfH09OTXX39l+/btdOiQk4Syf5dc0S+4C52MOuHjZeim\nyf8u+YY4D6NQKFi4eCHLVi5DUVShDK4oj3I5lAK8A6PrRshD5cr95JbotnrOiABWW6zw9/Q3uGpT\nOu7u7mzdupXLly+rKtxIpVL27t2Lv5cX0R8/IhaLKVqyJE79+tG1a1eMjY2JiIhQM84ZDfbHjx8p\nV66c1v3pihUrZhsc1K9fP2rXrs3UqVNz9Nn+DTZu3Mjo0aM1VqBWVlbY2dnRt29f3BYtwiU+njEK\nBVk9rkQB/S0sENevzyF/f9VeaL9+/dizZ4+q3cCBA9mxY4dO80tJSWHNmjXMmzdP40EBlIFTjRo1\nws/PTyMYShAEoqOjefHiBY8fP+bGjRtIpVKVkf748SPFihXDyMiI6OhoTExMSEtL0xhnyJAhbNq0\nKde3PhQKBYcOHWLmzJmULFmShQsXavx9tG/fnt9//53y5cvTuXNnNm/ejJOTDqkKeZDho4az6cUm\ncMhBJ8/A4a0Dl89czrV5/a+Qb4i/AVJSUjh06BBL3Zby/OlzZIkyTM1NKVO+DO1atGN+L744AAAg\nAElEQVSb1zbDXUqhYHvZltCnoTm+mQmCQKdOnahTpw6jR49m6fz57Pz7bxqKxfRKSKA4yqDuN8Cu\nAgV4JBIxePhwJk+fnmkes0wmIywsLNP9ablcnqmRlsvlNG/enJCQkK9eBScnyOVyXFxcWLlSs+Rc\nuXLl2LJli2qVFhoaSv8uXXgdHMwwmYw/FAoyhszdADZIJBxWKPjtt99Yvm6d2v7nyZMn1dyqlpaW\nvHv3TucoYlDmqM6YMYPt27drPV+6dGmCgoIoWrSo6tjHjx/x9fXF29ubkydPYmVlxZMnTzh58iTe\n3t6cOHGC8uXL8/3331O0aFF2797N+/fv1fotWrQojo6OaoU07OzsKF68eK4Z5rS0NDw8PJgzZw72\n9vb89ddfqpq869ev5+bNm2zfvp1bt27RoUMH1q1bR/fu3XNl7K/JuAnjWPNwDTTKQSePocmnJpzz\nP5dr8/pfId8Qf+OoikQ0e6PULdQTyyOWLBm8hFGjRuXKfN6/f0/NmjUxTUujp1TK+NTUTGtXPAKW\nmJlxq1Qp/M6dMyj14dOnT5ka6RcvXqgCeD430ukKSXkxlenzQvTpuLi4sGTJEq3X3Lp1i40rV7Lf\nywuJWIzEyIjY1FQK2dgwYsIEfh88WGvkslwux9bWljdv3qiO7dixg4EDB+o97xs3bjB27FiuXr2q\ndrxZs2acOXOGZ8+eqeQjL1++rKEoZmFhQfPmzVX1e0uWLElSUhLt27fn7Nmzam1btmzJ9OnTefXq\nlVYRlHR39+du7/LlyxsUsJecnMymTZtYtGgRzZs3Z+7cuRgZGdGwYUPevn2LWCwmKCgIR0dHVq1a\nRe/evfUe499k6dKlzDw8k1THVMM7uQp9i/dl99+7c29i/yPkG+L/AjZv3syEBROQ9pPqtz/8BAoF\nFuLl85e5tmIMCQnh59q1WZGYyAAd2gvACiMjNpUowZXPVk054c2bN9SqVYtz586pJCY/359Od3tr\nM9IVK1Y0KJgoN3B3d2fEiBGq9xYWFuzbt08nJafU1FSio6ORSqUULFiQggULZvoZBEHg3LlzTBox\nghdPniiPAUXLleP0+fMG6QkrFAr27NmDi4sLERERGBkZYWZmhrGxcaYCIemMHz+eVatWqX0WZ2dn\nfH191do1a9YMPz+/TPf8Y2NjNYLM0n9++/atqtqVtr3p7P4OEhIScHNzY9WqVTg7OxMYGMi+fftU\n5TQfPHhAmzZtWLJkCb/+akAe0FdCJpNx9epVoqKiUCgUyGQyhowaQvLYZP23t0C5xbXdikNbD9G6\ndetcn+9/O/mG+L8AQRD4fcjveJ73VNYw1iUm6TlY+Fpw9tTZXFPEEQSB+jVqMPDZM8boGVk7zcSE\nx02a4B0QkCtzmTBhAiKRSKt7N510t3dm+9MKhSLTILIKFSrkavCXIAicPXuWhQsXcuHCBaytrfn4\n8SOlS5fG19eXunVzUkxWHYVCwWZ3d9YsXozo0yeGJCZSUxCQALEog+/3mZnR0MGBaQsW0KiR7v5K\nqVRKQEAAXl5eHDx4UE1sIyvKli3LyJEjVYVE5HI5/fv3Z9++fWrt6tevz+nTpylQoIDOc8pISkoK\nYWFhGkY6/b2FhYVGdHf6z6VKlUIsVqpfREdHs3TpUtzc3Khbty4+Pj6qh8jHjx/TunVr5s2bl2lK\n4L/Fy5cvWbt+LVu2bUFUWARWKLe0EiEhLAFFOQW0A/R9Hg6HUgGleB3yWvV/lI/u5Bvi/xLkcjmj\nxo5i1+FdJP6UCLXQ/mQbCaa3TZE8lXD86HEcHHISnaHOxYsXGdzu/9k777CmzjYO32wIQxx14d5a\nF1oV3BsH7r0HLnCgIrSl+ln3oKJUxb2tC/esE/fAOkHFjQKigCgrIZDkfH+kUJGVhODMfV1cQnLO\ne95AzHPe532e3689DxIS1N6ulgClTE25GhSUZsauKVFRUVSuXJnAwMBc2fe9e/cuyyD98uXLNCea\nj4N02bJlc0x7r127lvz581OqVCkCAwPx9fXl/fv3SKVS2rZty8qVK1m1ahVdu3alRIkSWY6jLklJ\nSQzu1Ytwf3/mJibSlMxLC8TAduA3MzPmLV3KMCenLMeMjIxM2+89efJkpjrVH2MIFDAxQd/QEAtz\nc4oXK0bP4cMZPGQIVlZWjB49mjVr1qQ7p3r16pw9e1Ztb2FVEQSBN2/eZBmk4+LiKFu2bLog/erV\nK1avXg3A+PHjmTx5MlZWVjx69IhWrVoxderUL6KdRxAEpk2fxiKfRShqKEi2Tc4YbN8DASjd22qg\nVOdTJaYqwMzPjFkjZuE22U3LM/8+0AXib4xjx44x33s+V69eRV5SjtxUrqyyNgCLGAv03ugxymkU\nEydM1OoHPED/Ll1ocOgQrhq+pdyNjNBzcWHhkiW5mse0adOIjIxk1apVuRonO+RyOa9evcpyf/rt\n27dp1d4fr6rLlCmDjY1NujYcMzMzZDIZVapUwcHBId05pUuXVknxKScUCgV9OndGfuYM2yQSlXYx\nHgJtRCIWrFlDv/7/uYg8fPgwzbEos/3ezDAwMKC4lRWxcXEMksvpi7IrT4ZSEG6jSMSJf7MQN+/f\nT3du+fLluXDhgsbewtogISGBZ8+epQvSjx8/5syZMxgaGmJoaEhKSgq2trZ06NCB/PnzM2/ePCZO\nnPhZq/YFQWCk80i2/70dcS+xchWcHRJgJ8rjupN9MBbA+IQxNajBJf9LWnmffo/oAvE3hFwu58iR\nIyxYskCpwFQIFIYKhGQBIUqgpE1JZv9vNr169UprL9IWsbGxlCpShBdSKer5OP3HU6CBuTlR8fEa\n783GxsZSvnx5rl27luuVdW6QSCRp1d4fBunHjx/z8OFDUlJUL4rR09PDxsYmy9X3hynT7Fjq48NO\nT09Oi8VqCbYFAi3MzFi5eTPXr1/nwIEDPHz4UKVzrays6NChAyVLlmTDsmXMlEgYAmQl4RIBzEHp\nO5Ca1LaxseHixYtfrAdujx496NSpE82aNeP06dMsX76cJ0+eULFiRaRSKQ8ePMDU1JRq1aplujed\n10WD873mM3vpbBIHJKpeQ5ICbEZZANo6i2MSwPS0KRX1K3Lu5Dny58+vlfl+j+gC8TfC06dPadWu\nFTGKGOJrxSutzj5MTcuB4H+ty8QiTh07RfXq1bV2/QcPHtClXj0eJSbmahxzQ0PevHunVvvMh8yf\nP5+goCC2bt2aq3lomydPnuDt7c327dtp3LhxhgKk3GBiYkKZMmWyVC+ztrZGoVBQpUQJNkZEaGR1\nPRZYjXL1mhMlS5ZMk5ls2rQp165do0e7dhwUi1VWXl0OeACmBQpw6dIlqlSposGsPw3r1q3j1KlT\nbN++Pe2xgIAAfvvtN0JCQpgwYQKLFi2iY8eONG7cOEPKOzo6mtKlS2capHOrPJeYmEjh4oURDxVD\nAXVPBpYAnVDK5qbqF7wB0R0RikcK+vXrx7Ily74oW8yvEV0g/gZ4+PAhdk3siGsQh+KnnIuk9IL0\nMD9tjv8J/7Rqz9yyc+dOfu3bl2e5HKewqSmBISEaGUiIxWLKlSvHqVPavcnIDdeuXcPLy4tz584x\nevRoxo8fT3R0NMuWLePo0aO8fv0aIINalDbJnz8/BQsWRD8khGCZTKN280dAbbI2irC1tU0LvrVq\n1UrLaEilUsoWLcqm9+9Rt5b2Z+CfBg04/VE71JfGq1evqF69OpGRkRk0qs+cOYOnpydxcXHExsYy\nZswYpk2blu4YiUSSljH5OEiHhISQP3/+TAvIypcvn6OO+9q1a5noM5HEnprdIBsdNML6tTXxsfFI\nxVKMTI0oVrIYrs6uDBs6TG0fcx2ZowvEXzkxMTFUq1WNyJ8iEWqr8ad8ANZnrAm8GZirveLExESC\ngoI4duwYK2bM4E3Op2SJAJgaGPA+Pl6jiuSlS5dy+vRp9u/fn4tZ5B6FQsHRo0fx8vLixYsXTJo0\nCScnp7RVfnx8PH369EEul7Nr1y4sLS15/fp1hn3m1H/Dw8NV2oPNDnNgAcqVrabURykQAmBoaJiu\n5zerHvBt27axYfRoTiYkqH29RJQFfDeDgyldWoMm+U+Ira0tS5cupXHjxhmeEwSBQ4cO8fPPP/Pi\nxQt69uzJpk2bVNp+USgUhIeHZ6n9nZKSkqG6+8Oe6aq1q/Kk9hPlilYTwuGHoz8Q8SICfX39r872\n8WtBF4i/cubMncPsvbNJ6pSU88EfYXTSCOf6zvh4++R4rCAIhISEcPfuXe7cucPdu3e5e/cuYWFh\nVK1alR9//JHdW7cSLAho6kgaAPQrUoSn/64S1SE5OZkKFSqwe/du6tevr+EMcodUKmXbtm388ccf\nGBsb4+HhQa9evdKtksLCwujYsSN2dnYsW7ZMJXEJqVSa6X5z6r/v37/PcYx8KP2Hm+Ti9Y0G/PLn\np3HjxjRu3JgKFSpQokQJSpQoQZEiRTLd52xcqxZud+/STcNrjjUwwHzCBBZm04b2JTB16lSlJO3c\nuVkeI5fLWbVqFZMmTcLGxoadO3fmunXw/fv3WVZ5v3r1ihR5CkxFternLBD5iAi+E0zJkiVzNVcd\nWaMLxF8xcrmcoqWKEu0YDZqYzsSAxWYLIl9FpluBJiQkEBgYmC7oBgYGYmVlRc2aNalVqxY1a9ak\nZs2aVKpUKS3Q2FarRtsHD8hc+ylnhpqZ8eP06bhrUGG6YcMGtm3bxsmTJzW8uubExsayatUqfHx8\nqF69Ou7u7rRq1SrD6uHmzZt07tyZiRMn4ubmprXVxYfqYh8H6ZCQEJKTk7ECzgB1c3Gdn4GFWTxn\nYGBA8eLFsbGxSQvOZmZmrFm0iIjkZHXMwNJxD7DT12fDzp3ZuiF9bi5fvoyzszN37tzJ8diIiAjq\n16/P+/fvcXBwYNasWVStWlXrc3rx4gVValUhaZL6N+kfYrXWigtHLlCzZk0tzUzHx+gC8VfM4cOH\n6e/an/jBGQX3VUW0U8TwVsMpVKhQWtCNiIigWrVqacG2Vq1a1KhRI8f+zeDgYJrXqcMLiUStqlxQ\nmhJUMDXlcWio2upacrmcqlWrsnr1apo3b67mlTUnLCwMHx8f1q9fT/v27ZkyZQq1a9fO9NiDBw/i\n5OTEqlWr6N69+yebo0Kh4NWrV3Rr0YKFT56Qta9SzgxHWc2sDtVQBlNNSQHM9PSo+uOP/PDDD/j4\n+FCjRo1cjJg3yOVyihQpwu3bt1Xa6omJiaF169aIRCIePXpEhw4d+P3337VaGR4dHU2JsiWQTpHm\nahzLVZYEnAn4ogvmvnZ0EihfMWfOniG+jOZBGEBcXszeQ3tJTk6mT58+HD58mNjYWK5fv866detw\ndXWlefPmKokoVKlShYZNmuBqYoI6d3dyYLiZGQMHDNBI4nLPnj0UKlSIZs2aqX2uJgQGBjJkyBBq\n1qyJTCbj5s2bbN26NdMgLAgCPj4+ODs7c/To0U8ahEHpgFSiRAnsmjfnbC5aZATgtAbnqenImYHU\nlfS1a9fo2bMnrVu3ZuzYsbx9+zaXI2sXAwMDHBwcOHbsmErHFyhQgDNnziCTyXB0dKRkyZLUrVuX\nCRMmpBXw5RZra2sUKYr/+sA0IQWksVIKFy6slTnpyBxdIP6KiXwbmXVDpqqYQbXq1ZgzZw59+vSh\nSpUqGSo/1WGjnx/XSpVisrExqohcSoEBxsYk1qrFIl9fta8nCAJz587F09MzT9OWgiDg7+9Phw4d\naNu2LVWqVOHp06csXrw4y0IimUzG+PHjWbNmDZcvX9aalKgmjHZ1ZY2REZpK+p8HDH74gXXr1jFz\n5kxGjRpFhw4dqFWrVrY3aTnvXmdPAmBiaIhIJMLFxYUHDx6gp6dH1apVWb58OTKZKg1Vn4YOHTpw\n5MgRlY+3trbmxIkTPHr0iIiICO7du4ehoSE//vgjnp6evHv3TqN5SKVSXr58ycOHD2nZuiXc1GgY\nJfehXoN6FCigbu+TDnXQ/BNXx2fH2NhYuZzMDXIwMdaeGo6VlRVnrl2ja5s2NA8OZlJiIp3I+EZL\nAnYDM4G3+vrc27ePt2/fcurUKWJiYtDX16dgwYK0bds221Xy0aNHEQQhz0zZZTIZe/fuxcvLi/j4\neKZMmcLevXsxNc1+rfdhZfSlS5fIly9fnsxPVQRBIFmhYB/QW4PzfUUiJk+blqV2skQiITw8nLCw\nsLR/nz17xl/r1vFKLteohAHgOGCYkkLp0qXT7T8PGTKEFStWsGjRIubMmUOPHj20LlKjLg4ODri4\nuCCVSlVWmLKysuLvv//G0dGRn3/+mfXr1zNp0iRmzpxJpUqVmDx5MhMmTMDc3DzHsYKDg1mydAlb\ntm5Bz0gPfVN9UsQpEI/yjqgeoGZXoOUdS35e8vV5eX9t6PaIv2J+n/E7c07OQdZG81WB3nk9RlUZ\nxcrlK7U4M2UV8+7du1k+fz4vnz6lR0oKhVNSEIAwIyO2/qssldrUUrF4caLevqWNkRFF/j3ulZER\nZ1JS6OzoiMuUKTRo0CDdqlcQBBo1aoSrqyt9+vTR6vzFYjEbNmxg0aJFFC9eHHd3dzp16qSSglVq\nZbS9vT1Lly7VyHZPm+zatYthw4YhFospANwG1Kl/3QG4FyxI0NOnat1QxMTE0LR+fbo9fcosNeec\nSktLS5xWrKBRo0bpgnzq1927d3n69CkKhYJChQpRqlSptGCd+pUawG1sbPJceKJhw4bMnDmT1q2z\nkqPKHLFYTOfOnSlcuDCbN2/G0NCQhw8fMn36dM6fP4+npycjR47MNMC/e/eOnv16cuXaFVJqpyCr\nLSOdvF0ccAPlyrgwStnKnOM6PIIfzv5AxMuIL9Iu9FtCF4i/Yh4+fIitnS2ScRLNchsKMF9lzsl9\nJ7Vq/vAxt2/f5sSJE8RERSlXuoULExgYyKZNmzBDKfjjAQwFPjahewts1NdnmakpbXr0wHf9+rTU\n+blz5xg5ciQPHjzQ2gdFVFQUy5YtY8W/H/7u7u40bKi6FlVeVUZrglwu57fffkvnYWwAFEWZai6n\nwhg7gREGBly6eVOtqtl9+/bh7OzMmzdvyA+8BtRdr94DWufLx4vIyGxXuxKJhD/++IPFixfTtWtX\n2rRpQ3R0dLqAnRrAzc3N062sPwzUqV9WVlYa/91mz55NTExMtq5f2b2Obt26YWlpybZt29Ju4G7d\nusXUqVO5f/8+v//+OwMHDkx7v79584YGjRsQUSSC5BbJ2X8OyIGzKH+xQ1D2tGVFOIh2iTh++Him\nvdE6tIsuEH/lNGjSgIAiAUq3FHV5AuVvludx0ONPHjDi4uIoX7QodhIJfuRc1BMP9BaJMG/WjJ2H\nDmFgYEDbtm3p27evVqzmUiUod+zYQa9evZg8eTKVK1dWa4zPVRmdGTExMfTr148TJ05keK5Jw4Y8\nvHWLMcnJjJTL+bjGVwCuAMvNzDhvZkZsSgr37t1TqY80MjKScePG4efnl/aYCKVK4nYyd3rKjDig\niUiE06xZTJg8WaVzwsLC+Pnnnzl//jwLFiygX79+GTIob9++zXRlnfpYaGgoQI7BOitFq5s3b9Kv\nXz+Vtbg/JikpKa33fOfOneluQC5evIinpyfR0dHMnj0bBwcH6jeqz6MCj5A1UyMrdgGlgPhwMv7H\nkyufE/mL2Ll1J46Ojhq9Dh3qoQvEXzn79u1jkOsgEgclqrfkkIP5dnO83b0ZNWpUns0vK8YMGULE\nrl3sTUpC1bWsFGgnEmE/Zgzd+valR48ePHnyJFd7gwEBAXh5eXH27Nk0CUp15TVTK6O9vLzYv3//\nZy3KArh79y5du3bl+fPn6R43MjJi+fLljBw5knv37uH7r/Z1UwMDqonFiBQK3hsacsrUlERLS5wn\nT2aYkxO//PILZcqUSfMKzgxBENi2bRuurq6ZVjQXMDGhqyCwMjk5R9/5SKCzSMRP/fqxdM0atW8S\nL126xIQJEzAzM+PPP/+kTp06ap0fFxeXabD+8OeEhASKFy+eIVjb2NgwZswY9u/fj729vUaZmtQO\nhpSUFHbv3p2uHkEQBI4fP54WkCNFkUj7SlW/wwHlndZOlCviVB/MRDC8b4jRbSOqVK7CSp+Vn00Y\n53tEF4i/cgRBoFf/XhwNOoqkazYpagFQoMxNysH0qCn2Be05ceRErqqkNSEsLIyaFSrwQipFXXv3\n10AVU1MatWyJg4MDEyZMUPv6CoWCY8eO4eXlRUhISAYJSnWQyWRMnDiRs2fPcuTIkc8uxbhjxw6c\nnJwQi9P3rBQrVow9e/Zk2IKIj49n3759hIaGIk5IwLpAAWrXrk2rVq3S9sMvX77M8OHD0yqWPyY8\nPJwxY8ZkamRhaGiIp6cn48ePZ2D37jy6cAF3YBAZ3fjCgTUGBqwyNsZp3DhmLVigcaZGLpezYcMG\npk2bhqOjI3PmzNFqC05qcVpmwfrChQskJycjkUgoXLhwtivr4sWLZ7rvm5KSwoABA4iLi2Pfvn0Z\nJF/TxHzaRkMZDV5AOOhv0cfESHlty3yWdOrYiUnjJ/Hjjz9qMKCO3KALxN8AycnJdOnZhfPB5xE7\niP8z/E5EWaBxC2XVpAAYgJ6ZHuWKlePyhcufpT/wf7/+yrvFi1kq1UxooI+pKX8bGhLx5o1axTfJ\nycls27YNLy8vjI2NcXd3p1evXhoXU32sGf05K6NlMhmenp54eXlleK5hw4bs3r1bYy9fQRCoXLky\nmzdvxs7OLt3j69atw83Njbi4uAzn1a1bl/Xr16ftLe/bt4/u3btjjvKt2AwoY2qKXF+fUENDrqak\n0L9/f5wnaS8YxMbGMnPmTDZv3syvv/7KuHHj8ry6es+ePaxZs4ZDhw4RERGR7co6IiKCfPnyZRqs\nixUrxtKlS4mPj+fo0aPp3uvnzp3DcYAjCSMS1FsNf4DlRkt2LN9Bhw4dtPTKdWiKLhB/I8jlcmbO\nnslin8UoflCQKEuEV0AV/mtbMEApVfQCzO+YQyhMGD+BWb/P+mRVkSkpKZT64QdOx8ZSTcMxLgB9\nLC0Jj41VacWUKkH5559/Uq1aNdzd3WndunWu9sVDQ0NxdHT8Iiqj3759S9++fTl16lSG55ydnVmy\nZEmug8+cOXMICwtjxYoVADx//pyRI0dy+nRGmQ8TExNmzJiBm5tbumxL9+7d2bdvX9rPLVu2pFu3\nbhgaGvLDDz/Qtm1bLC3VzZGoRnBwMJMmTeL58+csWbKEdu3a5cl1QJnatrGx4fXr1zm2HSkUCqKi\nojLdr079/tkzpadZpUqV0qrCg+4Hcc30mvJuRlMuw/Ayw1m3al0uBtGhDXSB+BsjNDSU+o3q86bA\nGwQHIXvBj3cgOiqiaZWmHNh9IM9XCnK5nICAAHq2bEl4kub6twJK3+Ko9++z/aBTR4JSHVIroydN\nmsTkyZM/a2X0nTt36Nq1KyEhIekeNzY2xtfXFycnJ61c5+XLl9ja2hIaGsratWv59ddfM6S/ARo1\nasS6desyFLq9ffuWYsWKkZLyn6TI5cuX87Ra/2MEQeDIkSNMmjSJKlWq4O3tTcWKmtoSZU/Lli2Z\nPHmyVoqd5HI5Q4cOJSgoiKlTpxITE4PPCh/ulbiXO/Hwu9BR6MjhvdrzxtahGTplrW8IsVhM+y7t\neVv2LULXHIIwQH4Q9xFz7tk5Bg0blGurvZyoUqUKDRs2xDAXQRiUmThrY+MslYeCgoIYOnSoShKU\n6nLw4EHatWvH0qVLP3t70qFDh7C3t88QhIsXL8758+e1FoQBSpUqRaVKlahTpw6urq4ZgrBIJOLP\nP//k/PnzmVabb9++PV0QrlixYro096dAT08PR0dHgoKCaNKkCfb29nh4eGSaVs8t6qpsZYeBgQGb\nNm3Czs6OP/74g169elGzRk3U0pHV8UWjC8TfEH8s+oOnsqektEhRfd/IECRdJBw5e4Tjx49rdT6C\nIPDmzRuuXr3K9u3bkcuVMmC5k6BXIpHL0+2ZCYLA2bNn6dChA23atKFSpUo5SlCqgyAILFmyBGdn\nZ44cOUK3bpoa+2mPChUqZHiscePG3LhxgwYNGmj9emKxONO2nFatWhEUFMT48eOzFDzZtGlTup+H\nDBny2W5iTExM8PDwICgoiKioKKpUqcLGjRtRKFQRZVWNjh07pqm+aQN9fX18fX2pX78+bdq0Ib9V\nfvQScvn7i4fiRTTVPNOhTXSp6W8EmUxG0ZJFedv5rWaWiDehhbQFZ/4+o/IpgiCkWfCFhISk2fCl\nfh8SEoJIJKJs2bKULVuWBw8eEBQUhAkQBWpXTKfyGqhoYsL7xEQA9u7dy8KFC4mLi2PKlCkMGjQo\nRwlKdZDJZLi6unL+/HkOHz782SujQfm7X7ZsGdOmTSM2NhYAFxcXFi9enGdbDIsWLWLKlClpP1tZ\nWbFo0SKcnJyyDar3799PV3ylp6dHSEgIpUpp6lytXQICApgwYQKCIPDnn39q5SZGEATKlSvH4cOH\ntVqFLAgC7u7uHDhwgFfxrxCPFmu2nBLAYr0Fe9buoW3btlqbnw7N0GlNfyMcOXKEZFGyZkEYoDpc\nWXqFkJCQdFZs8fHxmQbZ1O+BtEBbpkwZKleujIODQ9rPHxbfzJgxg1evXmEik7ElLg4XDae6Rl+f\n3t27s3LlSry9vSlatChTp05VWYJSHT6sjL548eJn14wGZevMmDFjuH37Njdv3mTbtm0UL15cK8Im\nmfH69WvGjh3L/fv3qVq1Kg8ePMDR0ZGVK1diY2OT4/kfr4ZbtGjxxQRhgPr163P58mW2bt1K9+7d\nadWqFfPnz6d4cc1Xi3p6emnpaW0GYj09Pby8vDA0NMR7uTc8B8prMFAoWOhZqC3FqSNv0K2IvxG6\n9+nOPvE++EnzMQwPGdLEqgkFCxZMC7gSiYQyZcpQpkyZdAE39Xtra2uVU4wKhQKFQkGdOnWIDwzk\nGep3XshQFoAniUS0bdtWbQlKdfiSKqNTefnyJd27d6dixYqsXbtWJTMATREEgaUMZVYAACAASURB\nVC1btuDu7s6IESOYNm1aWk/xs2fPVL7p+emnn7hx40baz5s2bWLw4MF5Ne1cER8fz9y5c1mzZg1T\npkxh0qRJKhs4fMzRo0dZuHAhZ8+e1e4kUf5tHDs5cizoGMIQQb1VsQBme8yYOXQmU9ym5Hy8jjxH\nF4i/Eeyb23O1xFXITRHoOWiqaIrzGOe0gFu4cGGt7+W5ubmx0tsbX5SSt+rwB/A7yhZpZ2dnvL29\ntZqGTuXGjRt06dLli6iMTuXs2bP069cPNze3PC8Ue/nyJaNHjyYiIoINGzZga2sLKG+mypcvz549\ne1RWrJLJZDRv3hypVJp2g6eJeMqn5MmTJ7i5uXHv3j28vb3p1KmT2r9vsVhM0aJFCQ0NzZNMSlJS\nEmUrl+V1sdfQDtXvak+DTagND4Me5umNnA7V0RVrfSOkpKTk/q9poBRh6Nu3Lw0aNKBIkSJa/7D3\n9/fHz88P0wIFcAaOqnHuX8D/UAZhIM2YIbXPUlscPHiQ9u3bfxGV0fCfhGbfvn3ZsmULU6ZMybM5\nKRQKVq1aRd26dWncuDHXr19PC8KgLBoaMmQIGzduVHnMuLg4goKCOHnyJGFhYV98EAZlIdyBAwfw\n9fXll19+oV27djx48ECtMUQiEY0bN+bkyZN5MkdTU1NuXbuFYaAhHACSczghBTgGBMHbmLecP38+\nT+alQ310gfgboWDBgv9FKA0xSDLgh0I/aGdCHyGVSvHw8GDgwIGsWrWKK1euYN+yJcMsLJinr092\nFuhRwG/6+kwyNyflIznOmzdvUqdOHfbv35/rOX6JldESiYQhQ4awYcMGrly5kqd7ek+fPqVVq1Zs\n2LCBc+fO8dtvv2Wajh88eDDbt28nOTmnT34lO3bsoF27dlhbW2uc5v1ctG3bljt37tChQweaNm3K\nxIkTef/+vcrnd+zYUWttTJmxzHcZhiUMlUF4McpAG/3RQTHAiX+fjwVGQVKvJHr165WpLriOT48u\nEH8jdHbojPnTXKSZFGD62JQWLVpob1L/cv/+fezs7Hj06BG3b9+mffv2VKpUidOnT3Pp1i2COnWi\nnKkpI0xNOY3SGOYuSlP4vkZGlNHXJ6J3b24GB3Pt2jXKlUtv4BcbG0u3bt1wc3NL16uqDjKZjHHj\nxrFu3TouX7782Y0bAF68eEGjRo2QyWRcvnyZsmXL5sl15HI5ixcvpkGDBnTq1IlLly5RrVrWumfl\nypWjatWqHD2qWj5j06ZNDBmi7ibEl4ORkRGurq7cv38fiURClSpVWL16dVo7Xna0b9+eY8eOabU1\nKpXk5GSW+i4lqU0S9AZGAUbABmA+ysA7H1jz7wkjgL6AGVASFBUUrN+wXuvz0qE+uj3ib4S4uDiK\n2hRFMkqS0dRXFR5DxTsVeXj3odbSnqktNjNmzGDevHmMGDEi07FjY2Px9vbmz8WLMRcETExNEYlE\nFMifn8AXL9i+YwcODg7pjh8+fDh79+7NMJadnR07d+5Uqyr3S9KMTsXf35/+/fvj7u7OpEmT8iwV\nff/+fZycnDAxMWHt2rWZ9iZnxvr16zl48GCOmYjg4GBatmzJy5cvP7m5SF5x69YtXF1diY+P588/\n/6RJkybZHl+1alW2bt1K3bq5kcHKyI4dOxj5+0gS+iWkf0IBJKFs2DdBaXWY2ZIrDIoeL0p4SLjW\nuw10qIfut/+NYGVlRd9+fTH4RwPNaAHMb5nz88SftfaBHxERQYcOHdiyZQtXrlxh5MiRGcYODw/H\nw8ODcuXK8eTJE86cO0dYfDxPo6IIfPGC4ZMmYVunTrogDJAvXz52797NkiVLMny4X716FVtbW5VX\na6GhoTRu3JhSpUpx+PDhzx6EBUFg8eLF9OvXj61bt+ZZoVhKSgpz5syhWbNmDBkyhDNnzqgchAF6\n9uzJ2bNniYqKyva4TZs2MWDAgG8mCAPY2tpy7tw5fvnlFwYMGEDfvn3TfIwzI6/S0z4rfUiokZDx\nCX2Uqnr5//03q095G0jUT+TChQtan5sO9dAF4m+I6b9Nx+K+BajpSW540ZASBiXo37+/Vuaxf/9+\nbG1tqVevHpcuXcqg55sqQVmjRg2Sk5O5efMmf/31V7qiILlczrx58/D09Mz0Gnp6eri6unLhwoUM\nhvUxMTF07NgRT09PZLKsDdNv3LiBvb09gwcPZsWKFZ+9PUksFjNo0CA2b97M1atXadWqVZ5c59at\nW9SvX5+LFy9y48YNxowZo/aKyMrKCkdHR7Zv357lMXK5nC1btnzVaems0NPTo0+fPgQHB1O5cmVs\nbW2ZOXMmEokkw7EdOnRQ+cZQHV6+eAm5MU/TA6GQwIsXL7Q2Jx2aoQvE3xClS5fmxJETWPxtodxk\nzQkFGJ01ovCTwvgf98/geaouCQkJjBw5ksmTJ7N3715mzpyZFtxSJSg7duyYJkH55MkTlixZkqlS\n1b59+7C2tqZly5bZXtPOzo5bt25lauU2b948WrduTURERIbnDhw48EVVRoeEhNCoUSNAaWz/oaiK\ntpBKpUydOhUHBwcmTpzI0aNHcyWsMXTo0Gyrp8+cOUORIkWoXr26xtf40hGJRMyYMYMbN24QFBRE\n1apV2b17dzppy8aNGxMcHJxj9kBdkpKSlHvCuUBuJCcxMZdVnjpyjS4Qf2PUr1+fy+cuU+yfYlhu\nsYQ7KNsWPkQMelf0MF9tTo2kGty+fjvNq1YmkxEVFUVoaChxcXEqa+Veu3YNW1tbZDIZt2/fThPZ\nkMvl+Pn50aBBA0aPHk3Xrl15/vw5np6eFChQINOxBEFg7ty5eHp6qhQgCxYsyKFDh5g/f34GO8dz\n585Ru3Ztbt++nTb2kiVLcHFx+WIqo0+fPo2dnR2DBw9my5Ytanksq0pqyv7+/fvcuXNHK1rPLVq0\nICoqisDAwEyf/9qLtNShdOnS7Nq1i40bNzJr1ixatmzJ3bvKu2FjY2NatWrF33//rdVrmluY51q4\n3TDZ8LNvx+gABB3fJCkpKcL+/fsF++b2gqmVqZCvfD4hX9V8Qr5y+QRTC1OhW+9uwqVLlwSFQiEI\ngiD8888/Qr9B/QQTMxPB1MpUEBUUCUamRoJNWRvBe7G38O7duyyvM2PGDKFw4cKCn59f2uOJiYnC\n8uXLhfLlywsNGzYU9u3bJ8jlcpXmfvToUaF69eoqH/8h586dE4oVKyag9KYRAKFMmTJCXFyckJKS\nIri4uAjVq1cXQkJC1B5b2ygUCmHRokVCkSJFhNOnT+fJNRITE4VJkyYJRYsWFXbt2pX299YWv/76\nq+Dm5pbh8djYWCFfvnxCZGSkVq/3NZCSkiL4+voKhQsXFpydnYXo6Ghh7dq1Qt++fbV6nc49Ogt6\n7fUEfkezr2kIogIiITAwUKvz0qE+uqrp74CwsDBevnxJYmIiVlZWVKhQQdl3jFJBqFufbjwLfUZS\n7SQUtRWQ2gUlAC9BdEeE4pGCcWPHsWDugrT9xKdPnzJo0CBEIhGbNm3CxsaG6Oholi9fjq+vL/b2\n9ri7u6elXFWlSZMmuLi40K9fP41e75s3bxgwYACnT5/GyMgIc3Nz5s+fz4EDB76YymixWMyIESMI\nDg5m3759eWIk4e/vz4gRI7C3t2fJkiUUKlRI69d4+PAhzZo1IywsLF1BlqpV1d8yMTExTJ8+nZ07\ndzJhwgQWL17MmzdvtFa4dv78eTr07UDiqET1tWIB7kOt57W4HXBbK/PRoTm6QPwdc+vWLVq0aUG8\nXTyKuorsNyriQXRQRIsfW7Bv1z62bt2Kh4cHnp6euLq68vz5c7y9vdm+fTs9e/bEzc0tU19aUKaH\nr169yoGDB4iIVO7fFitcjC6du5CcnIyTkxPBwcG5+sCSy+XMmjWLMmXKYGNjQ6dOnShbtiwBAQHp\njCg+B8+fP6dbt27UqFGD1atX53pv/mPi4uLw8PDgyJEjrFixQivm9Nlhb2/P1KlT6dixY9pjzZo1\nY+LEiV9E6v9zExQUhKurK5cvX2bixIk0bdqUhIQE8uXLR5UqVTTepxcEgbKVy/LC/gWUy/n4j7HY\nYcHq/63W+IZXh/bQBeLvlBcvXmBbz5Z3zd+BquYwMjDzM6OwrDCWZpb89ddfSKVSvLy88Pf3Z9So\nUYwfP56iRYtmenpSUhKbN29m4ZKFvH73GnFlMYKF8u2nl6CH6KEIRZKCnp16snr1aq1oSKdqRru4\nuBAYGMj9+/fx8/OjUqVKuR5bE06dOsXAgQPx9PRk/PjxWi8SO3bsGKNHj6Zdu3Z4eXl9kpX/ypUr\nOXPmDLt27QKUNxr169cnPDw8zywZvyaSkpLw8/NjnNs44hLiMCxiiKmVKQYpBkjDpdSvXx+PiR60\na9cuQ41DTvz111+MmjIK8SDxf5ksFdD/R5/i94rz5MGTr07t7FtEF4i/U3r07cGByAPIm+WsDpSO\nJDD0NWTu1LkcPXqUZ8+eMWnSJJycnLJdaUZHR9O6Q2sexz9GXE8MZcm4AlcAz0D0j4hKlpU4dexU\nWgpdEw4cOMDIkSNZtWoV3bp1QxAEVq9ezbRp01i2bBm9e/fWeGx1EQSBRYsWsWjRIrZv307z5s21\nOn5MTAwTJ07k4sWLrFmzJs9an0ApuxkTE4MgCBQoUACpVEqZMmV4/vw5BQoUYMaMGURHR7N06dI8\nm8PXwo0bN3BwdECaX0pCzQSoBHwYa5OBe2Bxx4IiZkU48/eZLFfIgiAQEBDAs2fPSEhIwNLSkqpV\nq7Llry2s3LmSxF6JKpl8693QI9/VfPxz5R/Kl9fEQ1GHttEF4u+QqKgoSpUrRZJLkrLhX13Og/Vd\na5YtUQaznPpv4+LiqGtflxcFX5DSQgVzCgUY+RtR+m1pbly5gZWVelJhwr8mCV5eXuzfvz+DXOXN\nmzfp3bs37du3548//sjzFUFiYiIjRozg8ePH7N27V+tevHv27GH8+PH06tWLOXPm5Impgkwm4/Dh\nw/guWMD569cpYGKCHhCTnEyDmjVJNjGhX79+jBs3jgoVKrBz505++ikXnpzfABcvXsTB0QFxOzFU\nzeFgAQyuGWB9y5qAywHpZFzj4+PZsmULC30W8jb+LXrF9JAbyjFIMUAeKqe0TWkql6/M8bPHkdaR\nKus8Pn4LCEAIiG6JyPc+H+dOncvQ36/j86ELxN8hc+fNZfa+2Ug6ZhQfUIkEMF1hSvjL8CxbkD6k\nQ5cOnIk8g9RBqnpRiQAmf5vQqmgrjuxXXZVIJpPh6urK+fPnOXLkSJZBLzY2lmHDhhEaGsquXbvy\nTMf52bNndOvWjdq1a7Ny5Uqt7ge/efOGcePGERgYyLp169QuilOVw4cP4zJ0KCWkUlwSEuiJUjUR\nlJ1x+4E/zcy4nZyM29Sp+Pn5ERQU9Nl7sz8nz58/p/ZPtYnrEAeqC5ah/48+NvdtCLoVhJWVFZcv\nX6ZDlw7IbGQk1kpUZpI+/LUqgMfKFbVRlBH2De05c/oMBhUNEFuKEQwEjJKNMHluQgFRATwmejB4\n8ODPXiehIz26QPwdUv2n6tz78Z5GBR6pWO6xZO3UtTmmd58+fUr1OtVJGq+B+EAymC4z5d6texmM\nHjIjLi6Ovn37pvUu57SSTl05pxrBd+nSRc0JZs/JkycZOHAgU6dOZdy4cVrV8P7rr79wc3Nj+PDh\nTJ8+PU88mQHWr1nDVFdXdkokZK+oDP8AjgYGNHBw4EAeOg59DQwbOYwtT7Ygb67m1g9gtteMecPn\nUaNGDTr16IS4o1gln3G9u3pYnLXgyP4jPHr0iFevXiGWiCmQvwD169enadOm3/XN0ZfMtyMAq0Nl\nYt7GqLSXlB0ycxnR0R/7rWVkqe9S5LXkmikAGYO8ppylvktZ/MfibA8NDQ2lY8eONGzYkGXLlqlU\nca2np8fEiROxs7OjT58+XLhwgXnz5uVa6lIQBLy8vFi8eDG7du2iWbNmuRrvQ8LCwhg9ejRhYWEc\nPXpU60YCH3L48GF+c3XlvESiShzgJ+C6XE4jf3+2//UX/QYMyLO5fcnExcWxc8dO5KPUD8IAkjoS\nps2chlwuR9z133oKFRBqCsTrxdOtdzeCA4PzpF1NR96gU9bSoTE5JVNSUlJYt34dKbaaWRMCpNim\nsHbdWpU0o4cMGcKKFSvUbnuys7Pj5s2bPHjwgObNmxMWFqbxfBMTE+nbty9+fn4EBARoLQinFprZ\n2tpiZ2fH9evX8zQIy2QyXIYOZaeKQTiVksAhiYQJY8Zkqrv8PbB582b0K+hr5oIGUBoShATEpVQP\nwmnUgMSSiaxYuULDi+v4HOgC8XeIdX5ryKW8rKHEMMeK5ujoaOTIIedt5KwpCDJBlqWBubY0o1Nl\nMjt16sRPP/2kkRzh06dPsbe3RyQSZWpGoSnPnj2jdevWrF27Fn9/f6ZNm5bnbUFHjhzBJjmZphqc\nWwvl6tjPz0/Ls/o8REZGMnvObFp1aEWdhnVo2KIh/Qf3x9/fP9Ob0WOnj5FYNhf/wfRA+FHIWHCl\nIkl1kvBZ7qOSX7KOLwNdIP4O6dWlF6bBudhTlEDK05QcDRni4+MxMNXAlvEjDM0MiY2NTfeY8K9d\noDY1o/X19fnll1/YuXMnI0aMYOrUqdmuxD/k+PHjNGzYkNGjR7N+/Xqt7NnK5XJ8fHyoX78+7du3\n5/Lly5/MQMF3wQJc4uM1Pt8lIQHfBQu0OKNPT2BgIN16d6N0+dLMOTiHMxZnuFXxFleKX2FH1A46\nD+pM6YqlWb58ebqgF/MuRrNuhA8Roax01oRikGyenCfWizryBl0g/g4ZM2oM3ENpHq4Berf1aN+h\nPYULZ+/BZmFhgVya+7tyeZI8XeGVTCZj3LhxrF+/nitXrmRoT8otzZo148aNG1y9epU2bdpk6t6U\niiAILFiwgGHDhuHn58fYsWO1UhATHBxMkyZN2LNnD1euXGHKlCmfzNNXKpVyNiCAXrkYowMQ/Pgx\nFy9e5O3btygUCm1N75Nw8OBB7JrYcSD2AEljk0jqkKQUvikHVALBTiBhRAKhTULxWOKhbFMSiwGU\nNQa5fdvLSd9vrCbxpeK5dPlSLieh41OhC8TfIcWKFaNV61bo3dAgYKSA6LaIKa5Tcjy0UKFC6Mn0\nIDbHQ7PmPegp9NLS4HFxcXTu3JmnT59y6dIlrffkplKkSBGOHz9Os2bN+Omnn/D3989wTEJCAn36\n9GHPnj0EBATQtKkmidz0pKSkMG/ePJo0acLAgQM5e/bsJ+/3jImJIb+xMblZ0xsAopQUmjRpQqFC\nhTAxMaF48eLUrl2btm3bsnr1am1NV+ucOHGCvkP6Iu4tRmgoQFYdZ3pAGRD3FXPpzSUcuzkik8ko\nWbwkvM/lJGJQSykrA2YQ+TYyl5PQ8anQBeLvFO/53ljcsIDHapwkB9EhEQ7NHLC3t8/xcGNjYwYO\nHIjhLc1Xcoa3DRk0cBBGRkaEhobSuHFjSpUqxeHDh9UW+lAXAwMDfv/9dzZu3Ej//v2ZM2dO2sru\nyZMn2NvbY2Fhwfnz5ylRokSur3f79m0aNGjA2bNn+eeff3BxcUkz2PiUaKuj8cPbPJlMRkREBHfu\n3OHkyZPcuHHji/TBffv2LT369EDSTQI2Kp5kCEmOSVx7cY058+YwdOBQLO5ZaJ5aTgbuA9U0PB9A\nBiIz7dtp6sgbdH3E3zGXLl3CwdGBxBaJUJPsxTaSlKYPdYvV5eSRkyqrUT148IC6jeoiGStRv1lO\nBnqL9Lhw8gKmpqZ06dKFSZMmMXny5E/eDxkeHk7fvn0xNzdn2LBhTJgwgenTp+Ps7JzruUilUubM\nmcPKlStZsGABQ4cO/az9nklJSeSzsCBeLkfTkjAFyg45cRbP58+fH4lEgr6+PoULF6ZIkSIULlw4\nw/cf/lywYEG1tJgTEhLYu3cvIc+fkxgXh1WBAlSvXp2OHTtmmeb3+sOL6TumI+mkQcX3G7Debc3r\n0NeUq1KOVy1fgSYJm3+A64CzBuf+i/HfxszqNgsPDw/NB9HxydAF4u+cwMBAHLs7EpMUQ0KtBGVA\n/jDGvgaT2ybo3dOjf7/+rFy2Uu0+26atm3JVdlUpb6kOJ0HvkR75DfKjl6LH2rVr6dq1q3pjaJGU\nlBRat27NxYsXWbp0KS4uLrke89q1awwfPpyKFSvi6+tL8eLFtTBTzXn79i2LFy9m2bx5rFQo6Kvh\nOH8D/Q0NKVC6NFFRUcTFxaV7fsuWLQwYMIDExEQiIyN58+YNkZGR2X7//v17ChQokGPAjouLY++2\nbezcuZMmBgbUTExEJAjE6etz3tycF4aGjB4/npHOzukMShQKBTZlbHjd9rWyD0sDLLdZsn7OekLD\nQvlt5W9I+kjUyzsmgel6UwSpgNRVqlnOMhlMl5ryMOhhnm3d6NAuukCsA0EQ8Pf3Z+GShfif8sfY\nyhh9I31kiTKMDY0Z7zKeMaPGaBwkoqOjqV2vNhEVIlA0UuQscykAF4FbgBNwCSq+r0hwYPBnSdWC\ncnU1dOhQQkNDcXZ25ueff8bd3V3jlimxWMz//vc/tm7dio+PD7179/6sq+DIyEgWLVrE8uXL01LG\ntVH+CTTB0cyMK2ZmREVFoa+vT1JSUlpAjYyMpFatWtjYqJr7VSKTKUVksgvY9+/dI/rFC1wEgbFk\nHk9vA0uNjDhgZMTilStp164dBQoU4NKlSzgOciR+WLxm/r4AgdDoXSPOHDtDszbNuCm9SbJDsmoB\nNRlEe0X0atiLS9cu8aT2E5UUtTJwA1rJWnHq6CkNTtbxOdAFYh3piIuLIzIyEolEgrW1NcWKFdNK\ntW5oaCjlqpZDVloGjYGsYno4cBmIAgYA+QABLDZasGvFLtq3b5/ruajL48eP6datG3Z2dixfvhwT\nExNevHhB7969KVq0KBs3biR//vwqj3fu3DlGjBhBvXr18PHx4YcffsjD2edMeHg4lSpVSqv6TcUM\n8AcaqDneA6CxSESxsmVZtmyZ1p2msmKVry8L3N05JhaTuRN2eo4DPfX00Le0RCwWY2ZmRkLJBITe\nufhIjASbv20IexpGbGwsLdu15IHkAZKWEuV7OZvzzI+Z41DPgZ1/7WTz5s1MmD2BxP6J6qnSScB8\nkzn7Nu+jTZs2mr8OHZ8UXbGWjnRYWVlRoUIFatSoQcmSJbXWMhMeHo6xmTEUBXYCa4CrQNC/X1eB\n1cAulMcM578PLj1IqJXAwiULtTIXdTh27BiNGjVi3LhxrFmzJm1vvHTp0ly4cIFy5cpRp04drl+/\nnuNY8fHxuLi4MGDAABYtWsS2bds+exAGZYV4ZlrehhYWdDUy4oUaY70BHEUivHx8GD58OBs3btTW\nNLPlwoULzHB356SKQRjAAdgtCJihFE359ddfMbbIpVCKESSJlX2B+fLl45L/JYY1G4bZWjPM95rD\nEyABZUFWPHBPmc7OtysfnqM92b1jN4aGhgwdOpTmNZtjdtgMVGtlB6lyRT2oxyBdEP7K0K2IdXwS\nevbryd6Yvcp2kH8dY3gEpNbEmKH0aq1I5reH/xpAPLjzgDJlyuT5fAVBYO7cufj6+rJr1y4aNmzI\nhQsXOHHib2JiIjAwMKRQIRu6du3GkydPcHZ2Zvr06bi4uGSaYj5+/DijRo2idevWLFq0CGtr6zx/\nDTmRkpLCli1bmDNnDvny5ePWLWUiukiRIri7uzNmzBg2rFnDAk9PDkgk1MlhvPtAJ5GI4VOm8NuM\nGbx584YqVaoQGhqaJ9aMH9K5ZUu6+PvjpMG5Y0xNsfHwoFylSozxHkNC5wTNJ/IaSp0uxYtH6W9f\nEhIS2Lp1K0tWLCH8ZThSiRQzczMqVamEu6s7Xbt2zaCWJpFI6NKzC5eeXELcSgxFsrimAISD6LiI\nHq17sGHNBrWK2nR8fnSBWMcnwaacDa/av4LsNUCyxWqfFeunradHjx7am1gmxMfHM3ToUF69esXW\nrVs5fvxvfH29kMmi6d07kcKFQaGAsDADtm0zoUyZCnTvPoTNmzdTuXJl1qxZk9Za9e7dOyZPnszZ\ns2dZvXr1F7FSkUqlbNq0iXnz5lGhQgWmTZtG06ZNGThwIPXq1WPkyJGIRP+1vuzauZPxI0dSSxBw\nSUjAkf8K4BUoU7y+FhZcEQQWLlnC8BEj0s51dHSkd+/eDB48OM9eT0hICD9VrcrLpCSNBK3uAB3z\n5+fAyZM0bdcUsYtY41yhXoAejqaOHNxzULMBPkIulzN3/ly8l3gjzy8nvma8MmNkDEiBMLC8Y4mZ\n3Ixpv0xjrIt2BGV0fFp07ks6PgkJcQnkSiECkJvIef8+t0oJ2fP48WO6du1Ko0aN+OOPP+jRox3F\ni4fx559iWrSA9J9xcubOFXPo0F0WLvwfxYrVxcLCgp9++gk/Pz+ePXvGuHHj6N69O4GBgXm+KsyJ\npKQk1q9fz/z58/nxxx/566+/aNiwYdrzW7duzfS83n360KVrV3bv3o3XggUMefiQQoaGSCQSJMbG\nlC9dmrG//MLOPn3SBXCAoUOH4uvrm6eBeI2vL4MVCo1VJWsBZWQyQkNDKVOiDPcf3YcqGgwkgPlt\nc9y2uWk4k4wYGBgw7bdp/OLxCwcOHGDx8sU8/+c54kQx5hbmVKtWDbeVbrRt2/azFTLqyD26FbGO\nT8IPNj8Q3TM6VwYQlgctWem2kv79+2tvYh9w5MgRhg0bxuzZs+nevTsNG9Zm8OA3/PabjJwWGSkp\nMHq0KU+fVqd794F4eHhgbW2Nn5+fVhS3coNEImHNmjUsXLgQW1tbpk2bRv369TUeLzo6Gg8PD4yM\njJg1a1a2UqdSqRQbGxtu3LhB6dKlNb5mdnRu1ozh58+Tm8Y2T319RDNmUKpUKcbOH0tCHw3S08+h\n1KVShDwK0a1KdaiF7hZKxyehaPGikLmBkurEkGMLVXJyMrt27aJ52+aUq1YOm3I2VK1dFafRTgQG\nBmZ6jkKhYNasWYwePZr9+/czatQo+vXrRI8eUUydmnMQBjAygrVrk8ifopHZlgAAFCpJREFU/y4z\nZvzCoEGDKFiwIGvXrv1sClKJiYl4e3tTvnx5/P39OXDgAIcOHcpVEAawtrbm2LFjTJ48OUe9cRMT\nE3r37s2WLVtydc3siIuL09hxMJV8CgVRr17Ru3dvLBIs0LulZiAVg+iEiJnTZuqCsA610QViHZ8E\nl+EumAfmQjz3FZhITWjSpEmmT0ulUqZNn0Zhm8I4TXPinOU5njd5zqv2rwiuG8zmJ5tp0LwBtg1s\nOXHiRNp5cXFx9OjRg2PHjhEQEEDDhg25ceMGjx7dZfbsZLWmqK8Pa9cmI5crmD9/PtevX0dPT4/6\n9evz4MEDzV+7msTHx7NgwQLKly/PlStXOHbsGPv27dOaf/GJEycoXbo0lSurVp88dOhQNm3apDXp\nzI8xNzfPUsFLVeKB5WtW0blnZ+bOmIvFBQv07qgYUBNAtFOEU18nhgweksuZ6Pge0QViHZ+EgQMH\noniu0NgAwuy2Ga5jXTOtBo2NjaVJqyYs2rOI2N6xJPT/VyGsOMrisFIgaypDMlbC7dK36dqvKz5/\n+vDw4UMaNGhAkSJF8Pf3T1ttr1jhzZgxUjQpPC1UCLp2NWDDhnWYm5uzceNG3NzcaNq0aZZ7sNoi\nNjaWOXPmUL58eW7fvs2pU6fw8/OjVq1aWr3Opk2bGDJE9YBTr149DA0NuXz5slbnkUrpSpUIzOX+\n6DUjkDsoOMlJJkyfgLmFOdYXrREdEMFLMteNFoPeZT1EG0S4DnTFZ5FPruag4/tFt0es45MxymUU\nmwM2I3WUqqdc9AbMtprx/PFzihRJ38MhlUpp0qoJd2R3VFcwegcmW0wwSjHCe5E3I0eOTHsqPj6e\nUqUK8/BhEjlkXbPk2jUYMKAoT578Z5949+5devXqRbNmzfDx8cHMLCtLH/V5//49Pj4+LF26lPbt\n2+Pp6UnVqlW1Nv6HvHv3jrJly/Ls2TMKFFB9w3/+/Pk8e/YsT1yX/vnnH3o1a8YTsVgj58AwoKIh\nJLmjlHcVgEAwP2PO0AFD2XtoL/HEIy4lRmGqUBoqxImQP5TT0bEj7hPdsbOz0+pr0vF9oQvEOj4Z\n8fHx1LWvy/MfniNrJlMtGL8F0TYRa5eupV+/fhmenvq/qXjv9UbSQ01N32gw2WhCcGBwur7koKAg\nevduyP378WoMlh5BACMjPSQSaTpd7ri4OEaNGkVwcDB+fn65tjeMiYlhyZIl+Pr60qlTJzw9PfPc\nMnHVqlVpK211CA8Pp0aNGoSHh2v1JiSV+lWrMj04mI4anOupB961QdrloyeegOVRSwIuBRAaGkpA\nQABRMVGYm5lTwqYEPXv2/CIEWXR8/ehS0zo+GZaWlpw/dZ5y0eUwOWySvWerHLinXAkvmrMo0yCc\nkpLCshXLkDRTMwgDFAKhlsDyFcvTPRwfH4+lZe7+W+jpgaWlcTqjg8ePH7PQayF6xnoojBTUsK3B\n2LFjM8hKqkJ0dHRa0I2IiCAgIIANGzZ8Et9iddPSqdjY2FCvXj3279+fB7MC16lT8TQ3R93bp0fA\nnwYgzczVswIk1E1giucU2rRpw2+//caSRUuYM3sOzs7OuiCsQ2voArGOT0rRokW5ceUGTg2dMN9g\njsVuCwgGIlGaoYeD4XlDzJabUftFbQ75HWLM6DGZjrV//37kBeQai4Qk2yazau0qpFJp2mMWFhYk\nJuYuSSQIkJCQgrm5OYcOHaJhi4bUrFeTBWcXsOP9DgJLBiJtKmXFsRXkK5QPl/EuvHiRs5Dkmzdv\n8PDwoFKlSrx7946bN2+yZs2aTOUpc0tycjI3btzg5MmTnD59mrt37xIcHMyzZ89wcHDQaMwhQ4aw\nadMmLc9USf/+/bHr0YOuIpHKwfgZ0MwIxO3I8j0k1BU4dfIUERERmR+gQ4cW0KWmdXw2xGIxO3bs\nwHedL68jXpOcnIxlPkuaNWrGpPGTqFGjRrbnN2vbjPOW55WFWRpitd2KzQs206WLMi+p3AMtRkiI\nFE1VKAMDoV07azp27sW2g9tIbJAIP5K5fM47IADMH5hz9MDRTHuOIyIi8PLyYuPGjQwYMAAPDw9K\nltTQpy8HXr58yfIVy1m5ZiWCSEDfQh8EkL+XI0gF6tSow/59+9XaH05FLBZTokQJAgMD1XZeUgWZ\nTMZYJyeu7t7NXLGYdpDpnrEE2AFMMoT4NqDIwdXC9Jgp7u3cmfn7TK3PWYcO0AViHV8x5aqV43mT\n51k7OamA2d9m/DHoj3Tewv36dcHe/hATJmj2X8PZ2ZjLAZV4kvAMcXexaopiT8Fknwn+J/yxt1fm\nScPCwli4cCFbt25lyJAhuLu755lfsUKhwO1nN1auWomihoJk22T4MPMqAGFgessUHoG3lzfOY9R3\nrh85ciQVKlTg559/1trcP0QQBLZt24bP7NlEh4YyQiymliBgjrJg/5QBbNQDbCChBVBGhUGfQ9W7\nVbl/836ezFmHDl0g1vHVog39auOTxsztNhc3t/9kCS9cuMDIke158CBRJTGPD4mLg6JFDaCgMZJB\nEmUVrqo8BpP9Jlw+f5m1a9eyY8cOnJyccHNzS2dgr20UCgW9+/fm2D/HEPcQk6NW5FsQ7RLhMdaD\n6dOmq3WtixcvMmrUKLZt28b169eJjY3F1NSU4sWL0759e60Wcl2/fh2PCRO4E3QNhbmAYAJiG5DV\nB1R3rYQoKHakGK+ev9La3HTo+BCd1rSOrxYrKyteJeXuw9EoxSiDE1Ljxo2xtCzFkiWPmDRJrvJY\nggDu7sZgrM//27v/4KjKe4/j7/2RbfZHWCCIIiAVUEihAU2oFBig0Uhvua2hBpKOXJTh1xTkZxm9\nXG/HijUTyVBkQFhFLGCRAaJYsQhIQKEZpRJF6AVCtdHQQIJKELKbZNnk3D92yhizIdld4DT28/oz\n++xzzk5m9rPnOc/5fmszowxhgNsg2CNI+pB0Zv5yJqWlpddlQ9Aj//1IOIRzA23rfZsMgYkBlqxc\nwq3fvZVJ/9W2OtL19fWUlZXx8amP+WHGD7HeZiWYEMTWaMNx3oExxWDyQ5OZM2sOffv2je9DEX5+\necKkSby34TB1P66LfSIDLFE9bycSHW3WknZr+NDh2MriaPfWCMbfjWYVpywWC4WFb7J0aQfWrm3b\nF7BhwGOPJbBnTxesSTa4JbZTMoYZeDp5KCwsvNyW8FqqrKzk2dXPhpfQo2lAnwSBrADzFs4jFGq9\nYW55eTkpqSnMfGoml8Zeou7hOgI/CRDKDFE/pp6LORepmVSD7wMfqWmprHx2Zewf6muSk5NJ8Efz\nwSKogU7J0VxCi0RHQSzt1ryH5+H4yBF+1CkWJ6H3Lb0ZPHhws5d69epFUdG75OXdyPTpDlqqUGkY\n8N57MG6ck717+9EnZQD+VH90BUu+7hYwnAaLFi1i8uTJPP744zQ0RP6AVVVVPPnbJ+md0htvFy+e\njh5uuuUmcifm8v7777fpcL7nfeGNZLFUH70ZQt4Q27dvv+KwU6dOkXZXGuW9y6nJrYEUIu+i6gyX\nMi5R+1Atj/72UfKX5MdwUk3dc889XCq7BHGU+3YeczJx/MS4z0WkJQpiabcGDhxI/9v6Q4xlnD0f\neXh0fsubhvr168fBg0e58cb5ZGR4ycjw4PPBq6/C1q3wzDOQluZh4sSbGDHiN+zde5BPyj6BeDYE\nW8C42cDtdlNSUsKBAwe49957qaqqujyksrKScRPG0atPL/K251E2rIwLD17AP91P1c+q2Hp2K6PH\njqb/oP5N6mp/UygUYsWqFdQNjn3Z9mLqRfJ/13JgBoNBRt87murB1TQMbWjbD5TOEPhFgMVLFrca\n8q1O1bkzWVlZWA/H+FUXAOOEwdQpU1sfKxIjbdaSdu2tt97ivpz7qJ1UG9UGHOtfrPQ82ZMTR0+Q\nmNj6tuZgMMi2bdvYtWsb1dVnsVptdOnSjZ///AEyMzMv94Lt9t1uVP60ErrE+onAsdtBfnY+8+fP\np6GhgSeeeIK1a9eyceNGunXrxsi7R3Ku7zlCQ0PQ0t6mRqAUnLudLMtfxozpM5oNKS0tJW1kGv6Z\ncVwuXgJrvpXQpVDErkNbtmxhyv9OCdf/jnaVoBRSjqVw7HB8u5UPHTrEqP8YRWBqG3ewf431HSvj\nbhxH4abCuM5B5Eq0WUvatczMTPKfyGfRk4sITAg0feSmBda/WOl4qCNvH3y7TSEM4HA4yMnJIScn\n54rjXG4X1F9xSKsSQgkkJSUB4cbwixcvZvjw4YwfP57aUC2BkQGMO1v5/WwFUqC2ay0L/mcBnTt1\nZvz48U2GVFdXY/fE+RWQADaHjYsXL9KhQ/NmhE8ve5qaQTGEMMBt8Nmezzh06BDp6ekxn2J6ejoT\nsiaw5bUt4V3hbb1l/H/g/auXpb9fGvOxRdpCS9PS7s2ZPYeVS1bifMmJ4y0HfBFhUANwHDybPfQ8\n2ZOSgyVNakxfLSm3p0A8G7kNsJy2NCtXOWbMGFLTUvEP9Lcewl+XDIHsAA9OeZDz55vWFLXb7RiN\n8S+INYYasdubB/qxY8c4Xnoc+sc4sRXqBtWxdHn8Qbhm9Rru/t7duDa7aLX0VmP4x5p3n5eiXUX0\n6tUr7uOLXImCWL4VJj80meNHjjN3xFw6bOpA0stJOHc6cex24N7hxrXaxfc//j6+x3yU/rX0moQw\nwLxZ8/Ac8URum9cW5eBN8DarsHX69GmKi4thRAxzdgNLX0uz8pJdu3YlWB0ML2PHqiZ81R7p+d8P\nP/wQ2622uNbdGns3crDkYBwnGGa323lt62vMyp5F4nOJ4faGn9H0/1QDtj/bcK1yMaBqACXvlXDH\nHXfEfWyR1ugesXzr1NfXs2vXLioqKqitraVjx46kpaVd9b68kRiGQc8+PakYXQExXEi5XneRNymP\nuXPnNvn7rx//NQW7C6j/cYzr3p9B97e7c+qTU03u5aYMSuHEgBPQL7ZprcVWsrtms/kPm5u9tmrV\nKn710q/ie4b3HHQp7MLnFZ/HPsc3fPXVV6xfv56C5QVUVlTicDtoCDZAI2SPz2bBnAXceeedV+14\nIq1REItcZb7nfCzMW4j/AX/UlbW8u7x8+rdPmxUZ6d67O6czT8deztMAz/Me3nnjnSYhs27dOmYX\nzKZmQk30czaC2+dm3xv7GDJkSLOXX3zxReb45uAfG8dmsCrovqs7//jkH7HP0QLDMPD7/Zw/fx6n\n04nX6424xC5yrWlpWuQqmzF9BuMyxuF6xQVtvRj8O7jecLHjjzuahTDAuc/PRVeW8ZssYEu2UVlZ\n2eTPOTk54XvaFTHMeRR63tQzYggD9OjRA+uXcX7FfMk1aRAB4cItHo+HHj16kJycrBAW0yiIRa4y\ni8XCuhfWkTs6F/cGNxwBWio+VQ0JRQkkbU9ixx93MGzYsIjDQsFQ5CIYUTBsRpOWjwBOp5OXfv8S\nzlec8GUUk30K7n1uNq3f1OKQjIwM7DV2qGxxSKs8Rz3Mnj479glE2gEFscg1YLPZeMH3Ai+vfpmh\nXwzFucKJfY8dSoCPgIPgLnTjXudm2uBpHPngCKNGjWpxPleSK9y/Lw6WWkvEq+2srCyWP70c5x+c\n8DeuvNGsAfgA3NvcvP7K6xGrkv2T3W7n4V8+HO7YFIsvwFJlITs7O7b3i7QTukcsch2cPHmSdRvW\nUVZeRo2/hhuSb2DE0BHk5ubicrXW7gjG/HQMu43dEHkVuHU1kOhL5HT5aTp1irzGvXPnTmbMnsG5\nwDn8g/wYA4xwJyYDuAC2oza+c/g79O3Tlw1rNrRp89uZM2fo068PtQ/UQjQNpBrBuc3JrJ/MoiC/\nIIo3irQ/CmKRdqCoqIish7KomRJbcQzrn63k3pzLxvUbrzjOMAz2799PwTMF7C3aS52/DovFgruD\nm/vvv5/5s+eTmpoa1bE3bdrE1NlTCfwi0LaKY43h6mIDGUjxvuI2F10Raa8UxCLtwOXHokZWwK1R\nvjkErudcHNh5IOrHchoaGrBYLJdLeMZqzZo1zH1kLrU/qg03mWhpX9RZcO53kuJJYc+OPS1evYt8\nm+gesUg7YLFYWPb0Mlx/csGFKN5oQOKOREYOHRnTs7E2my3uEAaYNm0ab772Jj/4/AckrkjEvs8e\nLqhRRXjH9hFIejkJ7xYv8+6bR/G+YoWw/NvQFbFIO/JU/lPkPZMXrqud3MrgECS+mcjt3M67+99t\n073o6+HEiRMsX7mc/e/u58JXF0hMTKT7zd2ZOXUmWVlZOBwOs09R5LpSEIu0M6t9q1nwyAL4HtTd\nUdd8E1QALIctuD5yMTx9OK9ufhW3O5aGwyJyPSiIRdqhM2fO4Hvex4pVK2hwN4AXDKuBtc5KfXk9\nY/9zLAvnLuSuu+6K2J5QRP51KIhF2rFQKERxcTFnz54lGAzSqVMnhgwZwg03tKEfpIj8S1AQi4iI\nmEi7pkVEREykIBYRETGRglhERMRECmIRERETKYhFRERMpCAWERExkYJYRETERApiEREREymIRURE\nTKQgFhERMZGCWERExEQKYhERERMpiEVEREykIBYRETGRglhERMRECmIRERETKYhFRERMpCAWEREx\nkYJYRETERApiEREREymIRURETKQgFhERMZGCWERExEQKYhERERMpiEVEREykIBYRETGRglhERMRE\nCmIRERETKYhFRERMpCAWERExkYJYRETERApiEREREymIRURETKQgFhERMZGCWERExEQKYhERERMp\niEVEREykIBYRETGRglhERMRECmIRERETKYhFRERMpCAWERExkYJYRETERApiEREREymIRURETKQg\nFhERMZGCWERExEQKYhERERMpiEVEREykIBYRETGRglhERMRECmIRERETKYhFRERMpCAWERExkYJY\nRETERApiEREREymIRURETKQgFhERMdH/A0W3ogFjZHdMAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0xb4467b8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "#Imports that should really be at the top of the notebook \n",
    "import networkx as nx\n",
    "# Allows plots to be showed inline \n",
    "import matplotlib as plt\n",
    "%matplotlib inline\n",
    "\n",
    "# Preform a cypher query to get 50 instances where a person worked on an award\n",
    "# Note, I am using %cypher here beasue that dataframe formate is easier for networkx to convert \n",
    "results = %cypher http://neo4j:upintheA1R!!@localhost:7474/db/data MATCH d = (p) -[r]-> (a:Award) RETURN d LIMIT 50\n",
    "\n",
    "# Convert to graph object\n",
    "graph = results.get_graph()\n",
    "\n",
    "# Create a Color Map so the Graph will be colored \n",
    "color_map =[]\n",
    "for node in graph.nodes(data =True):\n",
    "    this_labels = node[1]['labels']\n",
    "    if 'Employee' in this_labels:\n",
    "        color_map.append('green')\n",
    "    elif 'Student' in this_labels:\n",
    "        color_map.append('yellow')\n",
    "    elif 'Award' in this_labels:\n",
    "        color_map.append('red')\n",
    "\n",
    "# Draw the graph \n",
    "nx.draw(graph, node_color = color_map)\n",
    "\n",
    "\"\"\"\n",
    "Notes \n",
    "Green Nodes are Employees\n",
    "Yellow Nodes are Students\n",
    "Red Nodes are Awards\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Network Analysis \n",
    "The networkx module also has built in tools to analyse graphs. The following measurements are used to acess how the nodes are related to each other in the graph database.  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Network Measurments \n",
    "This is the vacab for studing a network \n",
    "\n",
    " **Degree Centrality ** - counts the number of edges that a node has \n",
    "     - Nodes with a high degree of connections usally play an important role in a network \n",
    " **Betweenness ** - indicator of a nodes centality in a network. \n",
    "     - Equal to the number of shortest paths from all vertices to all others that pass through that node \n",
    " **Diameter** - The longest shrortest path over all pairs of nodes \n",
    "     - Often we want to find the shortest distance between two nodes, the diameter is the longest of theses paths \n",
    "     - Nodes that occur on many shortest paths between other nodes in the graph have a high betweenness centrality score  \n",
    " **Cliques ** - A clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.  \n",
    "     \n",
    "     \n",
    "Lets look how these measurements look on a sample set of data.\n",
    "  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run the Cell Below to create one of Networkx eample graphs, the Maze Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tuttle Graph\n",
      "-------------\n",
      "Number of Nodes:  8\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xl4leWd//FPAknMzhYWIbKNMiQoCWFRGgEBBYy1A1iw\ntNWOVHDScUNo1KKCoIil+AMVpaA4thKoJVptABVUFqcghMAMYVQgYABBs0AWgZOTnPv3B3BqBCTL\nSe7zJO/XdeUCJM9zvofLJ59z7wHGGCMAAGBFoO0CAABoyghiAAAsIogBALCIIAYAwCKCGAAAiwhi\nAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKC\nGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCI\nIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAs\nIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAA\niwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsIogBALCIIAYAwCKCGAAAiwhiAAAsam67AAC1U1xc\nrMLCQklS69atFR0dbbkiALVBixhwEJfLpfT0dF2fkKCOMTEa1ru3hvXurY4xMbo+IUHp6ekqLy+3\nXSaAGggwxhjbRQC4tJUrVuj+yZN1tTFKLS3Vj/XPLi23pHclLYqI0O7AQC1YvFjjb7/dXrEAqo0g\nBhxg4fz5mjd9ut46dUpJl/jeLEmjw8I0ddYs3TdlSkOUB6AOCGLAz61csULT7rpLm0+d0hXVvCZP\nUnJYmH7/yiu0jAE/RxADfszlcqlz27ZaXVKiPjW8NktSSlSU8vLzFRwcXB/lAfABJmsBfiwjI0O9\nPJ4ah7AkJUmK93iUkZHh67IA+BAtYsCPXZ+QoAd37dKYWl6/StKChARtzM72ZVkAfIggBvxUcXGx\nOsbE6ITbXesF/25JLYOCdCQ/n3XGgJ+iaxrwU4WFhYoJCanTrjtBktoEB6uoqMhXZQHwMYIYAACL\nCGLAT7Vu3Vr5LpfcdbiHW1JBeblatWrlq7IA+BhBDPip6OhoJcbF6d063OMdSX3i4xkfBvwYQQz4\nsdS0NC2KiKj19YsiI5WalubDigD4GrOmAT/Ghh5A40eLGPBjISEhWrB4sf4tNFR5NbguT2f2m16w\neDEhDPg5ghjwc+Nvv11TZ89Wcmiosqrx/Vk6s8/01Fmz2GcacAC6pgGHOHcMYi+PR6llZbpVVY9B\nfEdnxoRzAgI4BhFwEIIYcJDy8nJlZGRo0dy52pGTo7DKSl0WEqKiigr1iY9XalqaxowZQ3c04CAE\nMeBQxcXFGjhwoJ555hkNGjSIJUqAQzFGDDhUdHS0QkND1b59e0IYcDCCGHCwZs2aqbKy0nYZAOqA\nIAYcjCAGnI8gBhysWbNm8ng8tssAUAcEMeBggYGBtIgBhyOIAQejaxpwPoIYcDC6pgHnI4gBB6Nr\nGnA+ghhwMLqmAecjiAEHI4gB5yOIAQdjjBhwPoIYcDDGiAHnI4gBB6NrGnA+ghhwMLqmAecjiAEH\no2sacD6CGHAwuqYB5yOIAQejaxpwPoIYcDC6pgHnI4gBB6NrGnA+ghhwMIIYcD6CGHAwxogB5yOI\nAQdjjBhwPoIYcDC6pgHnI4gBB6NrGnA+ghhwMLqmAecjiAEHo2sacD6CGHAwghhwPoIYcDDGiAHn\nI4gBB2OMGHA+ghhwMLqmAecjiAEHo2sacD6CGHAwuqYB5yOIAQejaxpwPoIYcDCCGHA+ghhwsMDA\nQMaIAYcjiAEHo0UMOB9BDDgYQQw4H0EMOBjLlwDnI4gBB2P5EuB8BDHgYHRNA85HEAMORtc04HwE\nMeBgdE0DzkcQAw5G1zTgfAQx4GAEMeB8BDHgYIwRA85HEAMOVVxcrG+++UYlJSUqLi62XQ6AWgow\nxhjbRQCoHpfLpYyMDC2aO1fZe/aoZbNmqnC7VRoYqMS4OKWmpWns2LEKDg62XSqAaiKIAYdYuWKF\n7p88WVcbo9TSUv1YUvOzf+eW9K6kRRER2h0YqAWLF2v87bfbKxZAtRHEgAMsnD9f86ZP11unTinp\nEt+bJWl0WJimzpql+6ZMaYjyANQBQQz4uZUrVmjaXXdp86lTuqKa1+RJSg4L0+9feYWWMeDnCGLA\nj7lcLnVu21arS0rUp4bXZklKiYpSXn4+Y8aAH2PWNODHMjIy1MvjqXEIS1KSpHiPRxkZGb4uC4AP\n0SIG/Nj1CQl6cNcujanl9askLUhI0MbsbF+WBcCHCGLATxUXF6tjTIxOuN3e2dE15ZbUMihIR/Lz\nFR0d7cvyAPgIXdOAnyosLFRMSEitQ1iSgiS1CQ5WUVGRr8oC4GMEMQAAFhHEgJ9q3bq18l0uuetw\nD7ekgvJytWrVyldlAfAxghjwU9HR0UqMi9O7dbjHO5L6xMczPgz4MYIY8GOpaWlaFBFR6+sXRUYq\nNS3NhxUB8DVmTQN+rK4betzQvLlycnMVGxtbH+UB8AFaxIAfCwkJ0YLFi/VvoaHKq8F1eZJGh4Zq\n+I9/rAEDBmjt2rX1VSKAOiKIAT83/vbbNXX2bCWHhiqrGt+fpTP7TE+dPVsZGRlKT0/XpEmT9OCD\nD8rlctV3uQBqiK5pwCHOHYPYy+NRalmZblXVYxDf0Zkx4ZyAgPOOQSwqKtLdd9+t/fv3Kz09XT17\n9rTwDgBcCEEMOEh5ebkyMjL02AMP6Eh+vtqGhko6s0SpT3y8UtPSNGbMmAse8mCM0dKlS/Xoo4/q\nqaee0t13362AgICGfgsAvocgBhxo4MCBevjhh3X11VdLklq1alXtJUqfffaZfvazn6lbt25asmQJ\na4wBywhiwGFKSkp0+eWXKz8/X6FnW8Q15XK59Mgjj+ivf/2rXn/9dQ0ZMsS3RQKoNiZrAQ6zadMm\n9e/fv9YhLJ2ZjT1//nz98Y9/1IQJEzR9+nS53XXZwwtAbRHEgMN8+OGHGjp0qE/uNXLkSGVnZysr\nK0uDBg1Sbm6uT+4LoPoIYsBhPvzwQw0bNsxn92vXrp0yMzM1fvx4DRgwQG+88YbP7g3g0hgjBhyk\noKBA3bt3V0FBgYKCgnx+/507d+pnP/uZ+vXrpxdeeEFRUVE+fw0AVdEiBhzk448/VnJycr2EsCQl\nJCRo+/btCg0NVWJiorZu3VovrwPgnwhiwEF8OT58MeHh4Vq8eLF+//vf69Zbb9WcOXNUWVlZr68J\nNGV0TQMO0qNHD61cuVIJCQkN8nqHDh3SL3/5SwUGBur1119Xp06dGuR1gaaEFjHgEIcPH1ZBQYGu\nueaaBnvN2NhYrV+/XsOGDVNSUpLefvvtBnttoKkgiAGH+Oijj3TDDTcoMLBhH9tmzZrpd7/7nf72\nt79pypQpuueee3Ty5MkGrQFozAhiwCEaYnz4h1x77bXKzs5WaWmp+vbtq127dlmrBWhMCGLAAYwx\n3i5im6Kjo/XGG2/o0Ucf1fDhw7Vw4UIxzQSoGyZrAQ6wb98+DR48WIcPH/abE5P279+vCRMmqE2b\nNlq2bJnatm1ruyTAkWgRAw5wrlvaX0JYkrp3767NmzcrISFBiYmJeu+992yXBDgSQQw4gK+3tfSV\noKAgPfXUU/rzn/+sX//613rooYfkcrlslwU4CkEM+DmPx6MPP/xQN9xwg+1SLuqGG27Qzp07lZub\nq+uuu06ff/657ZIAxyCIAT+Xk5OjqKgode7c2XYpP6h169bKyMjQ5MmTlZycrKVLlzKRC6gGghjw\nc7aXLdVEQECAJk+erA0bNuj555/XuHHjdPz4cdtlAX6NIAb8nD8sW6qpuLg4bd26VR07dlRCQoI2\nbdpkuyTAb7F8CfBjFRUVatOmjT7//HO1a9fOdjm1snr1ak2cOFF33323Hn/8cTVv3tx2SYBfoUUM\n+LEdO3YoNjbWsSEsSTfffLOys7O1detWDRo0SAcOHLBdEuBXCGLAjzlpfPiHtG/fXmvWrNFtt92m\nAQMGKD09vdrXFhcXKzc3V7m5uSouLq7HKgE7CGLAjzlxfPhiAgMDNWXKFL333nuaOXOmfvWrX6m0\ntPSC3+tyuZSenq7rExLUMSZGw3r31rDevdUxJkbXJyQoPT1d5eXlDfwOgPpBEAN+yuVyacuWLRo0\naJDtUnwqMTFRWVlZat68uRITE7Vt27Yqf79yxQp1bttWr06erCm7dumE260DZWU6UFam4263Hty1\nS69MmqQrYmK0csUKS+8C8B2CGPBTW7ZsUc+ePdWiRQvbpfhceHi4li5dqjlz5iglJUVz586Vx+PR\nwvnzNe2uu5RZUqIPSks1WtJ3p3YFSRojaV1ZmTJLSjRt4kQtnD/fzpsAfIRZ04CfeuKJJ+RyufTM\nM8/YLqVe5eXl6Re/+IWKCgtVnJurT06f1hXVvVZScliYfv/KKxp/++31WSZQbwhiwE8lJyfriSee\n0I033mi7lHp38uRJdWzVSutdLvWp4bVZklKiopSXn6/g4OD6KA+oV3RNA36orKxMO3fu1I9+9CPb\npTSIv/3tb0oKCqpxCEtSkqR4j0cZGRm+LgtoEAQx4Ic2b96spKQkhYWF2S6lQSyaO1epZWW1vj61\nrEyL5s71YUVAwyGIAT/kr8ce1ofi4mJl79mjW+twj1sl7cjJYZ0xHIkgBvzQ+vXrG8VGHtVRWFio\nmJAQ1WXjyyBJbYKDVVRU5KuygAZDEAN+pqioSHv37lX//v1tl1LvKioqdOjQIVVWVNguBbCG3dcB\nP7NhwwYNHDiw0cwALisrU25urvbv3+/99dzXoUOHFBMTowKXS26dadnWhltSQXm5WrVq5cPKgYZB\nEAN+xmnbWhpj9PXXX3vD9fthW1JSom7duqlbt27q3r27evbsqZSUFHXv3l1dunTRZZddpusTEvTu\nrl0aU8sa3pEUbIzuu+8+3XzzzbrxxhsJZTgG64gBPxMXF6c//elPSkpKsl2KV3l5ub788ssqAfvd\nVm5YWJi6d+/uDdvv/r5Dhw4KDPzhUbD09HS9MmmS1tVy5vSwyEjdOmuWmjdvrjVr1mjjxo26+uqr\nNWrUKI0aNUqJiYmXrAGwhSAG/MjRo0cVHx+v/Px8NWvWrEFf+8SJE+e1Zs/9+ejRo+rYseN5YXvu\nz1FRUXV6bZfLpc5t22p1SYlPNvQ4ffq0Nm7cqDVr1mjNmjU6ceKERowYQWsZfokgBvzI8uXL9eab\nb+qtt97y+b09Ho+OHDly0bB1uVzntWbPfV1xxRUKCqrtCG71rFyxQtPuukubT53y+RaXubm53lCm\ntQx/QxADfmTixIlKTEzUf/7nf9bq+lOnTunAgQPnjdXm5ubq4MGDatGixUXDNiYmRgEBAT5+RzWz\ncP58zZs+XW+dOqVLdcxnSRodFqaps2bpvilTqv0atJbhbwhiwI907dpVmZmZiouLu+DfG2NUWFh4\nwYlRubm5KigoUOfOnS84Vtu1a1eFh4c38DuquZUrVuj+yZPVy+NRalmZbtU/Z5W6dWZi1qLISOUE\nBGjB4sV1PuyB1jJsI4gBP3HgwAFdd911OnTokA4fPnzRsA0MDLzoxKhOnTo1+NhyfSgvL1dGRoYW\nzZ2rHTk5anN27LegvFx94uOVmpamMWPG+HyJF61l2EAQAxZ8d23tuYDdsGGD8vLyVF5ernbt2l00\nbJtaGBQXF3t3zGrVqpWio6Mb7LVpLaMhEMRAPTDG6NixY+eF7bnfl5aWqmvXrlUCdtWqVRo+fLim\nTp2qyy67zPZbwPfQWkZ9IYjhE8XFxSosLJQktW7dukFbLbaUl5fr4MGDFwzb766tvVDL9vtra40x\n6tChg/7xj3+oa9euFt8VqovWMnyFIEatuVwu7zhe9p49igkJkSTlu1xKjItTalqaxo4d6+itGk+c\nOHHB3aJyc3OrrK29UNjWZG3tnj17lJKSogMHDtTju0F9obWMuiCIUSvnZrZebYxSS0v1Y1Wd2fqu\npEUREdodGOiTma315dza2ouF7XfX1n4/bH25tvb555/Xrl27tHTpUp/cD3YdOHDAG8obNmygtYwf\nRBCjxhpiracvXWxt7f79+3Xw4EG1atXqgrtFNeTa2tGjR+unP/2pJkyYUO+vhYZFaxmXQhCjRupz\n96Pa+v7a2u8HbmFh4Xlra8+Fbbdu3RQWFubzmmqisrJSMTExysnJUYcOHazWgvpHaxnfRxCj2ny9\nH3BNVFRUKC8v76KzkJs1a3bRsVp/X1ublZWlX/7yl9qzZ4/tUtDALtZaHjVqlG666SZay00EQYxq\nq/MJORERunvJEt1+kVZxWVnZBTewOHdu7bm1tRcKWyf/wHr22Wd16NAhPf/887ZLgWW0lpsmghjV\ndn1Cgh6sw5mxqyTNi4/X719++YJh+921td8P2y5duijk7KzsxmbkyJGaPHmyRo8ebbsU+BFay00H\nQYxqKS4uVseYGJ1wu72zo2vKLSlC0tVJSerRo8d5Ydu+ffsm94m/vLxcrVu31pdffskPVvwgWsuN\nF0GMasnNzdWw3r11oJbd0ud0CQ/XR//7v2xacdbmzZt1//33Kysry3YpcBBay40LH6HQoCorK3X0\n6FHx+e+M9evXa9iwYbbLgMNcdtlluummm/Tcc8/ps88+0z/+8Q8NGDBAb7zxhrp06aIf/ehHmj17\ntrKysuTxeGyXi0ugRYxqOdc1fdztVm23sHBLigwIUESrVmrWrJn69u2rpKQk76+XX3659fNwG9rg\nwYP1yCOPaOTIkbZLQSNBa9l5CGJUmy8may1ISNCGHTt0+PBhZWVlafv27d5fmzdvXiWY+/bt26jX\n1Z48eVJt27bVsWPHFBERYbscNFKMLfs/ghjVVuflS5GRuvuPf7zg8iVjjA4dOlQlmLOyshQcHHxe\ny7l9+/Z1fSt+4YMPPtDMmTO1efNm26WgiTh9+rQ2bdqk1atX01r2IwQxqs3lcim2TRutLStrkA09\njDH68ssvz2s5h4WFVQnmpKQktWvXrsbvp6F9/4SqOXPmKCQkRDNnzrRcGZoqf2ktN8XT276LIEa1\n/f3vf9eECRMUcfq0trjdVra4NMbo4MGD57WcIyIizgvntm3b1um1fOGHTqiKaN5ck6ZO1fTp0x19\nQhUah4ZuLTeF09uqzQCXUFFRYR577DHTqVMn88knn5gFf/iDiQ0NNdslYy7xtV0ysWFhZsEf/lBv\n9Xk8HrNv3z6zcuVKM23aNDN06FATHR1tYmNjzejRo81TTz1l1q5da/Lz8+uthgtZkZ5u2kVFmeGR\nkSZDMu7v/LuUS2aVZIZFRJh2UVFmRXp6g9YGXEpubq558cUXzS233GIiIyPNwIEDzaxZs8z27dtN\nZWVlne7Ns1EVQYwfVFhYaEaOHGkGDRpkjh496v3v5x6kYRERZtUFHqS/SmZoZKS1B6mystLs3bvX\npKenm6lTp5ohQ4aYqKgo07lzZzN27Fjz9NNPm/fee88UFBTUy+v724cVoC5OnTpl3n//ffPAAw+Y\nHj16mHbt2pk77rjDpKenm8LCwhrdi2fjfAQxLiorK8t06dLFTJkyxZSXl5/39y6Xy6Snp5vrExJM\neFCQ6RwebjqHh5vwoCBzfUKCSU9PNy6Xy0LlF1ZZWWk+//xzs3z5cjNlyhQzePBgExUVZbp06WJu\nu+02M2fOHPPBBx+YoqKiOr3OivR0Exsaar6sxg+ac19fnv2B0xQ+/cP5atta5tm4MMaIcUHLli3T\nb3/7W7344osaN27cJb+/uLhYRUVFkqRWrVo5ZrKFx+PR3r17q4w5Z2dnq23btueNObdo0eKS97N5\nQhVgQ3XHlnk2Lo4gRhUul0v33XefNmzYoIyMDMXFxdkuqcFVVlbqiy++qDIZbOfOnWrXrl2VpVR9\n+vQ57wNHfZ9QBfi7i83EDggI0EfPPMOzcQEEMbwOHTqksWPHKjY2VsuWLVNUVJTtkvxGZWWlPv/8\n8/PC+fLLL6/Scn703ns1dffuOm96sjE725flA1Z8t7X855de0mKXi2fjAghiSDqz5/HPf/5zTZky\nRdOmTWtyW03WRmVlpT777DNvMG/ZskW7tm3Tt1KdTqhqGRSkI/n5juneBy7FV6e3NdZno7b/Jmgk\njDGaO3euFixYoOXLl2vo0KG2S3KMZs2aKT4+XvHx8brzzjvPnFB1zTVq/u23tb5nkKQ2wcEqKipq\ndD9s0HQVFhYqJiREzd3uWt+jMT8bBHETVlJSol/96lc6cuSIPv30U8XGxtouyfnoSQBQQ+z23UTl\n5OSoX79+ateunTZu3EgI11FFRYW++uorfX3qlGr/mf9M91tBeTl7/qJRad26tfJdLp6NiyCIm6CV\nK1dqyJAheuSRR/TSSy8p5OzWcqgeY4z27t2r5cuX68EHH1RycrJatGihX//614qJjNS7dbj3O5JC\njNFDDz2kt956S6Wlpb4qG7AmOjpaiXFxdX42+sTHN7puaYnJWk2K2+1WWlqa3n77ba1atUqJiYm2\nS3KEc13327Zt07Zt27R9+3ZFRkaqX79+6t+/v/r166ekpCRFR0f75ISqW2bOVEBAgDIzM7VlyxZd\ne+21SklJUUpKiq688kofvzug/m3cuFH33HOPoj/7TP+oZeT80OltTkcQNxHHjh3TuHHjFB4erjfe\neKNRdu/4QmFhobZv3+4N3W3btsntdqtfv35Vvi522pOvNy0oLS3VunXrlJmZqdWrVysiIsIbyoMG\nDWqUmxug8fjv//5vPf7448rNzdUjjzyix6ZOZUOPC7GxnRca1ubNm03Hjh3NE088UefN2huT0tJS\ns2HDBjNv3jwzfvx4061bNxMZGWkGDx5spk2bZv7yl7+YAwcOGI/HU6P71tc2fh6Px+zYscPMmjXL\nXHvttSY6OtqMHj3aLF261Hz11Vd1/ecAfGbLli1mxIgRpnPnzmbJkiXeLXLZ4vLCCOJGzOPxmIUL\nF5qYmBjz97//3XY5VrlcLrNt2zazaNEi8+///u8mPj7ehIaGmv79+5vf/OY35rXXXjM5OTmmoqLC\nJ6/XEBvbf/PNN+b1118348ePNy1btjR9+vQxjz32mNmyZQsfuGDF9u3bTUpKiomNjTUvvfTSBfea\n59CH8xHEjVRZWZn5+c9/bnr37m327dtnu5wGVVFRYXbv3m2WLVtmUlNTTb9+/UxoaKjp1auXueuu\nu8xLL71ktm/fXu8HUjTkCVVut9ts2LDB/Pa3vzXx8fEmJibG3HHHHWblypXm+PHjPnpHwIVlZ2eb\nn/zkJ+byyy83L7zwgjl9+vQPfr+/n97W0BgjboT27dunMWPGKCEhQS+//LLCwsJsl1RvjDE6ePCg\ndzz3008/9R7a8N0x3T59+ig8PLzB6ysvL/cefr4jJ0dtzo5vFZSXq098vFLT0jRmzBifj3sdPHhQ\nq1evVmZmpjZt2qQ+ffp4x5Z79uzJzmnwid27d2vGjBn65JNP9PDDD2vSpEkKDQ2t1rW2ng1/RBA3\nMu+++64mTpyomTNn6p577ml0P3CPHTtWZSLVtm3bFBISUiV0+/bt65eT0WydUHXy5El99NFHyszM\nVGZmpgIDA72hPGTIkGr/4ATO+b//+z/NnDlTH3/8saZNm6b/+I//qNMHfqee3uYrBHEjUVlZqRkz\nZui1117TX/7yF1133XW2S6qz4uJi7wzmc8uHvv32W/Xt27dK8Hbs2NF2qY5hjFFOTo43lHfu3KnB\ngwd7g5mNXfBDvvjiCz355JN6//339dBDD+k3v/mNIiIibJfleARxI1BYWKgJEyaovLxcK1asuOjS\nGn926tQpZWdnV2npHjlyRImJiVVCt3v37o2ulW/T8ePH9d577ykzM1Nr165Vhw4dvKF87bXXqnlz\ndsGFtH//fs2aNUuZmZl64IEHdO+993I6mw8RxA6XlZWlsWPH6qc//anmzJnjiB+cbrdbOTk5VTbJ\n+OKLL9SzZ88qoRsXF+eI99NYVFZW6tNPP/W2lvPy8jRixAilpKRo5MiRat26te0S0cAOHjyo2bNn\n6+2339a9996r+++/Xy1atLBdVqNDEDvYK6+8oocfflgvvfSSbrvtNtvlXJDH49HevXurtHR37dql\nzp07Vwnd3r1767LLLrNdLr7jyJEj3glfH330kXr16uVtLV9zzTX0TDRieXl5evrpp/Xmm28qNTVV\nU6ZMUcuWLW2X1WgRxA50+vRp3Xfffdq0aZMyMjLUs2dP2yVJOjP+ePjw4SpjullZWWrRooU3cPv3\n768+ffrQreUwLpdLGzZs8LaWXS6Xbr75ZqWkpGjYsGFWZqTD944cOaI5c+YoPT1dkyZN0kMPPaQ2\nbdrYLqvRI4gdJi8vT2PHjlXnzp21bNkyRUZGWquloKDgvBnMxpjzZjC3bdvWWo3wPWOMvvjiC28o\nb9u2TQMHDvS2lrt162a7RNTQsWPH9Mwzz+j111/XxIkTNW3aNJ7bBkQQW1JcXKzCwkJJZ44Iq850\n/XXr1ukXv/iFpk6dqoceeqhBuwZLS0uVlZVVJXSLioqUlJRUpbUbGxtLl2UTU1JSog8++MC7H3bL\nli29oZycnKygoCDbJeIivvnmGz377LN69dVXdeeddyotLU3t27e3XVaTQxA3IJfL5V3Anr1nj2LO\nHj+Y73IpMS5OqWlpGjt27HkL2D0ej+bOnauFCxdq+fLluuGGG+q9zl27dlUJ3YMHD+qaa66p0tq9\n6qqrFBjISZr4J4/Hox07dnhby3v37tXw4cOVkpKiUaNGOXJGf2NUUFCgefPmacmSJZowYYIefvhh\nlgFaRBA3kJUrVuj+yZN1tTFKLS3VjyWdmw/slvSupEUREdodGKgFixdr/NmjvoqLi3XnnXfq66+/\n1ptvvqlOnTr5tK7Kykrt2bOnSuju2bNHV155ZZVj/nr16kXLBjX29ddfa82aNcrMzNS6dev0L//y\nL97WclJSl3qVAAAIAUlEQVRSEh/kGlhRUZH+8Ic/6OWXX9a4ceP06KOPsnbcDxDEDWDh/PmaN326\n3jp1SkmX+N4sSaPDwjR11iwNvekmjRkzRjfeeKPmz5+vkLMt6Noyxig3N7dK6GZnZ6tDhw5VWrqJ\niYmNeltM2OF2u7V582Zva/n48eMaNWqUUlJSdNNNNzGBrx6dOHFCzz33nF544QWNGTNGv/vd79Sl\nSxfbZeEsgrierVyxQtPuukubT53SFdW8Jk/SdcHBKg0O1gsvvqg77rijVq/91VdfVQnd7du3KzQ0\ntMqYblJSEssSYEVubq43lD/55BP169fP21ru0aMHcw18oKSkRAsXLtSCBQt0yy23aPr06erevbvt\nsvA9BHE9qush8aPCw3W4qKham54fP368yoH2n376qU6fPn3egfYdOnSo1XsB6tO3336r9evXeyd8\nBQcHe0N58ODBrDGvobKyMj3//PN67rnnNGLECD322GO66qqrbJeFiyCI61F6erpemTRJ68rKanX9\nsIgI3b1kiW4/O158zsmTJ7Vjx44qrd1jx44pMTHRO6bbr18/de3alVYFHMcYo//5n//xtpZ3796t\nIUOGeIOZSUUX9+2332rRokWaN2+ehg4dqscff9xv9hnAxRHE9ej6hAQ9uGuXxtTy+lWS/l/v3lrw\n6qtVQnfv3r2Kj4+v0tLt2bOnmjVr5svyAb9QWFiotWvXavXq1Vq7dq1iY2O9oTxgwAD+v9eZvdpf\nfvllPfvss0pOTtYTTzyhXr162S4L1UQQ15Pi4mJ1jInRCbdbtd0t2S0pQlLXHj103XXXeUP3mmuu\nqfPELcCJKioqtHXrVm9r+auvvvLuhz1ixAi/PP6yPp0+fVpLlizRM888o/79+2vGjBnq3bu37bJQ\nQwRxPcnNzdWw3r11oJbd0ud0CQ/XR//7v+ratauPKgMaj0OHDnn3w/7444/Vu3dvb2u5V69ejXZo\nxuVy6dVXX9XTTz+thIQEzZgxQ0lJl1qTAX/F0TYAHCs2NlaTJ0/W5MmTdfr0aX388cfKzMzUT37y\nE1VWVnr3wx46dGijWJLndrv12muvafbs2YqLi9OqVavUv39/22WhjmgR15NzXdPH3W7VdhsMt6SW\nQUE6kp9frS0wAZxhjNFnn33m7cLOyspScnKyt7XcUGtoa7OV7YVUVFToT3/6k2bNmqXu3btr5syZ\nGjhwoC9LhUUEcT3yxWStBQkJ2pid7cuygCanuLhY77//vjIzM7VmzRq1adPGG8oDBw706a5xtd3K\n9kIqKyu1fPlyPfnkk+rUqZNmzpypQYMG+axW+AmDerN8+XIzLCLCGKlWX0MjI016errttwE0KpWV\nlWbr1q3m8ccfN0lJSaZly5Zm3Lhx5r/+67/MN998U6d7r0hPN+2ioszwyEiTIRn3d57ncsmsksyw\niAjTLirKrPiBZ7uiosIsX77c9OjRwyQnJ5sPP/ywTnXBv9Eirkd13dAjJSpKefn51frkDKB2jh49\n6t0Pe/369frXf/1Xb2s5MTGx2hO+aruV7X1Tpnj/u8fj0apVqzRjxgxFRUXpySef1PDhwxvtpDOc\nZfuTQGO3Ij3dxIaGmi9r0BL+UjKxYWE/+IkZgO+5XC6zbt068+CDD5qrrrrKdOjQwUycONFkZGSY\nkpKSi15X1+fc4/GYjIwMc/XVV5u+ffua1atXG4/H04DvHDbRIm4AvvikDKDh7du3zzvha8uWLRow\nYIC3tXzllVdKqnvP14iwMHW68koFBAToySef1C233EILuIkhiBvIuWMQe3k8Si0r062qegziO5IW\nRUYqJyCgyjGIAPxDWVmZ1q1b590POzw8XCkpKQoNDdWnzz9f661srw0M1I8eeEDz5s0jgJsogrgB\nlZeXe2dT7sjJUZuzY78F5eXqEx+v1LQ0jRkzhjFhwM8ZY7Rz505lZmbqhTlztOjkSVZHoNYIYkuK\ni4tVVFQkSWrVqhXrhAEH8tVWtuwX0LSxs5Yl0dHRPHSAwxUWFiomJETN3e5a3yNIUpvgYBUVFfEz\noYkKtF0AAABNGUEMALXUunVr5btcqn17+EzXdEF5eZM7OQr/RBADQC1FR0crMS5O79bhHu9I6hMf\nT7d0E0YQA0AdpKalaVFERK2vXxQZqdS0NB9WBKdh1jQA1AFb2aKuaBEDQB2EhIRoweLF+rfQUOXV\n4Lo8ndlFb8HixYRwE0cQA0Adjb/9dk2dPVvJoaHKqsb3Z0lKPruVLbvoga5pAPARtrJFbRDEAOBD\nbGWLmiKIAaCesJUtqoMgBgDAIiZrAQBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYR\nxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBF\nBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBg\nEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAA\nWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEA\nABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEMAIBFBDEAABYRxAAAWEQQAwBgEUEM\nAIBFBDEAABb9f957Zur0xMpEAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0xd2170f0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Create The graph\n",
    "maze=nx.sedgewick_maze_graph()\n",
    "\n",
    "# Draw the graph\n",
    "nx.draw(maze)\n",
    "\n",
    "print \"Tuttle Graph\"\n",
    "print \"-------------\"\n",
    "print \"Number of Nodes: \", maze.number_of_nodes()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Degree and Centrality\n",
    "     - Counts the number of edges that a node has \n",
    "     - Nodes with a high degree of connections usally play an important role in a network "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Maximum number of Edges is  4\n",
      "The Minimum number of Edges is  1\n",
      "The Average number of Edges is  2.5\n",
      "The Median number of Edges is  2.5\n"
     ]
    }
   ],
   "source": [
    "# Maxinum number of connections  \n",
    "print \"The Maximum number of Edges is \",  max(maze.degree().values())\n",
    "\n",
    "# Lowest Number of Connections \n",
    "print \"The Minimum number of Edges is \", min(maze.degree().values())\n",
    "\n",
    "# Average Number of Connections \n",
    "print \"The Average number of Edges is \",np.mean(maze.degree().values())\n",
    "\n",
    "\n",
    "# median number of connections \n",
    "print \"The Median number of Edges is \",np.median(maze.degree().values())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Maximum Degree Centrality is  0.571428571429\n",
      "The Minimum Degree Centrality is  0.142857142857\n",
      "The Average Degree Centrality is  0.357142857143\n",
      "The Median Degree Centrality is  0.357142857143\n"
     ]
    }
   ],
   "source": [
    "# The Degree is is divided by the maximum possible number of connections \n",
    "# The bigger the number the more connections \n",
    "\n",
    "# Maxinum number of Normalized Degree Centrality   \n",
    "print \"The Maximum Degree Centrality is \", max(nx.degree_centrality(maze).values())\n",
    "\n",
    "\n",
    "# Lowest Number of Normalized Degree Centrality  \n",
    "print \"The Minimum Degree Centrality is \", min(nx.degree_centrality(maze).values())\n",
    "\n",
    "# Average Number of Normalized Degree Centrality  \n",
    "print \"The Average Degree Centrality is \", np.mean(nx.degree_centrality(maze).values())\n",
    "\n",
    "\n",
    "# median number of Normalized Degree Centrality  \n",
    "print \"The Median Degree Centrality is \", np.median(nx.degree_centrality(maze).values())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Centrility of this graph is 0.285714285714\n"
     ]
    }
   ],
   "source": [
    "# Centralization: How equal are the nodes \n",
    "# How much variation is ther in the centrality scroes amoung thenodes?\n",
    "# http://cs.brynmawr.edu/Courses/cs380/spring2013/section02/slides/05_Centrality.pdf\n",
    "# The closer to 1, there are popular nodes that interacts with many nodes\n",
    "# the closer to zero, the interactions between nodes are more evenly distributed \n",
    "\n",
    "max_degree = max(maze.degree().values())\n",
    "all_degrees = maze.degree().values()\n",
    "nodes_num = maze.number_of_nodes()\n",
    "\n",
    "centrality = sum([max_degree - x for x in all_degrees]) / float(((nodes_num - 1)*(nodes_num - 2)))\n",
    "print \"The Centrility of this graph is\", centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Betweenness\n",
    "- Equal to the number of shortes paths from all vertices to all others that pass through that node "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Maximum Betweenness measure is  0.357142857143\n",
      "The Minimum Betweenness measure is  0.0\n",
      "The Average Betweenness measure is  0.136904761905\n",
      "The Median Betweenness measure is  0.0833333333333\n"
     ]
    }
   ],
   "source": [
    "\n",
    "print \"The Maximum Betweenness measure is \", max(nx.betweenness_centrality(maze).values())\n",
    "\n",
    "print \"The Minimum Betweenness measure is \",min(nx.betweenness_centrality(maze).values())\n",
    "\n",
    "print \"The Average Betweenness measure is \", np.mean(nx.betweenness_centrality(maze).values())\n",
    "\n",
    "print \"The Median Betweenness measure is \", np.median(nx.betweenness_centrality(maze).values())"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Diameter\n",
    "     - Often we want to find the shortest distance between two nodes, the diameter is the longest of theses paths \n",
    "     - Nodes that occur on many shortest paths between other nodes in the graph have a high betweenness centrality score  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Diameter of this graph is 3\n"
     ]
    }
   ],
   "source": [
    "print \"The Diameter of this graph is\", nx.diameter(maze)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cliques\n",
    "     - A clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Cliques in the MAze graph are, "
     ]
    },
    {
     "data": {
      "text/plain": [
       "[[0, 2], [0, 5], [0, 7], [1, 7], [2, 6], [4, 3, 5], [4, 6], [4, 7]]"
      ]
     },
     "execution_count": 87,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n"
     ]
    }
   ],
   "source": [
    "print \"The Cliques in the Maze graph are, \", \n",
    "list(nx.find_cliques(maze))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### The above list of cliques are a little unintresting.\n",
    "Run the code cell below to see the clique list of another built-in graph, the lolipop graph\n",
    "\n",
    "You can see that the lollipop graph has a cluster of 10 nodes that make up the \"candy\" part of the lollipop while the \"stem\" of the lollipop is a line of nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Cliques in the Lollipop graph are,  [[9, 0, 1, 2, 3, 8, 4, 5, 6, 7], [9, 10], [11, 10], [11, 12], [12, 13], [13, 14], [14, 15], [15, 16], [16, 17], [17, 18], [18, 19], [19, 20], [20, 21], [21, 22], [22, 23], [23, 24], [24, 25], [25, 26], [26, 27], [27, 28], [28, 29]]\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xt4VOW99/93AkPIiQAhSAGFoPWnCTRDsLp9JFsxVFqs\n2RpaCdFr8xSU/ExbEAQj+wI23dhqPLAbrOkTMG23rZnEXUKFHygiat14ejSJEULxQNBYPIVABoaE\nmYFZvz+GpAQDJDOTrDl8XteVi5DMWrknK9d85r7Xfd/fKMMwDERERMQU0WY3QEREJJIpiEVEREyk\nIBYRETGRglhERMRECmIRERETKYhFRERMpCAWERExkYJYRETERApiEREREymIRURETKQgFhERMZGC\nWERExEQKYhERERMpiEVEREykIBYRETGRglhERMRECmIRERETKYhFRERMpCAWERExkYJYRETERApi\nEREREymIRURETKQgFhERMZGCWERExEQKYhERERMpiEVEREykIBYRETGRglhERMRECmIRERETKYhF\nRERMpCAWERExkYJYRETERApiEREREymIRURETKQgFhERMZGCWERExEQKYhERERMpiEVEREykIBYR\nETGRglhERMRECmIRERETKYhFRERMpCAWERExkYJYRETERApiEREREymIRURETKQgFhERMZGCWERE\nxEQKYhERERMNNLsBIsHMbrfT0tICQHJyMklJSSa3SETCjXrEfcBut9PY2EhjYyN2u93s5vgkHJ6D\nr5xOJzabjSyrlTEpKWRnZJCdkcGYlBSyrFZsNhsul8vsZopImFAQB0g4vHiHw3PwV1VlJeNGjuR3\nBQUsqa+n1e3mgMPBAYeDI243i+vrKV+wgEtSUqiqrDS7uSISDgzxW6XNZlw0ZIgxPTHRqAbDDYZx\n+sMFxkYwshMSjIuGDDEqbTazm9utcHgO/ip5/HHj4thY490znvu5Pt4F4+K4OKPk8cfNbraIhDgF\nsZ/C4cU7HJ6DvyptNuPi2Fjj0x78Djo+Pj39uwjXNyYi0j+iDMMwzO6Vh6qqykqWzZvHrvZ2Lunh\nMU3A1Lg4Hi0vZ3ZeXl82r0fC4Tn4y+l0Mm7kSLYdPUpmL4+tAW4eMoSm5mYGDRrUF80LeprQJuIf\nBbGPwuHFOxyeQyDYbDbKFyzgJYfDp+OzExK4e8MG8sLgTUlPOZ1OqqurKS0upm7vXlJiYgBodjqZ\nnJZGYVERs2bNCvm/DZH+oMlaPqqurmaix9PrAAOYAqR7PFRXVwe6Wb0SDs8hEEqLiyn0MYQBCh0O\nSouLA9ii4KYJbSIBZu7IeOiampFhbOzF/cSzP/4MRpbVqudgstbWViPeYukyOa23Hy4w4i0Wo7W1\n1eyn0+c0n0Ak8DQ07QO73c6YlBRa3W6fd0RxA8MsFg42N5tyTy1Yn4PH48HtdnPy5EncbneXj774\nWnNzM5t/9zs+d7v9ave4uDi2vPkmkyZNIioqKiC/i2Cj+QQifUM7a/mgpaWFlJgYBvrx4m0Bhg0Y\nwJYtWxg1ahQejwfDMDr/7cnn/jy2ubmZoVFRfv0BWIBEw+DOO+8kJiYmIEHp8XiwWCxYLBYGDhzY\n+XlffG3QoEEkJiYSHYDgbG9v59prr8XpdJKUlMSwYcMYNmwYQ4cO7fz8Ql8bOnQoAwYM8LstfcHp\ndLKooIBtvQhhgEuATW1t3FxQwG25ubpnLNINBbGJXC4XTz75JPHx8URFRREdHU1UVFSPPu/NY7s7\n7ujRo3gCMBgyYMAAsrOzGTNmTEBCcsCAAf3ao7Tb7fy2pAQ33jcWvnADbQMH8vnnnxMXF0draytH\njhzp/Lfjo7W1lZaWFj7++OMuX+v4/OjRoyQkJPQqxM/8f1+GXKDmE0TShDaRntLQtA86hnWPuN1+\nvXgHw9B0KD+HQMmyWllcX0+uj8dvBEqsVl6rq/OrHR6Ph6NHj3YJ73MFenePGTRoUK974R2fx8bG\nnvcNULD8jkTCkXrEPkhKSmJyWhpb/Hhh2gxkpqebFmDh8BwCpbCoiNIFC8j1ceZ0aWIihUVFfrcj\nOjq6c4g6NTW1V8cahsHx48fPG9b79+8/Z6B7PJ5z9rhjY2Op2b2bHD+eWw4wt6EBu90e8n8vIoGm\nHrGP/F57mpjI3evXmzpUFw7PIRC0nhpOnDhxzt73/v37qXrySb8ntI2Pj+eV3bt7/SZDJNwpiH0U\nDi/e4fAcAkUzgs+tsbGR7IwMDvix1hq8M8tf2b2bCRMmBKhlIuFBG3r4KCYmhpKyMm6NjaWpF8c1\nAbfFxVFSVmZ6gIXDcwiU2Xl5LH3wQabGxlLTg8fX4A3hpWvWhHUIg3fbymanE3/6w27gq7Y2rrrq\nKr7//e+zYsUKnnvuOQ4ePIj6AhLx+mm9ctgKhw0OwuE5BEpHFarshARjI9+sQvVnMG5MTAzrKlTd\nCdTmLwcPHjSee+45Y+XKlcYPfvADY8SIEcaoUaOMH/7wh8bq1auNrVu3Gl999ZXZT1ekXymIAyAc\nXrzD4TkEitPpNGw2m5FltRrxFosxLj7eGBcfb8RbLEaW1WrYbDbD6XSa3cx+VVFRYWQnJPgcxDcm\nJhq2bv5uPB6P8cknnxh//vOfjQceeMCYPn26MXToUOPiiy82brvtNuOXv/yl8eKLLxotLS0mPGuR\n/qF7xAHicrk6N8GvbWhgxOkh20MuF5np6RQWFZEb5BsahMNzCDS73c7hw4cBGD58eMTO+O3P+QSG\nYbB//37efffdzo/a2lpSUlK46qqrOj+mTJnCkCFDfHo+/UFVqaSnFMR9IBxevMPhOUhgmTmhzePx\n8MEHH3QJ5/r6esaOHdslnCdPnkx8fLzPP8dfqkolvlAQi0iPrVu7lsdWrGBTeztTLvDYGryT+pau\nWcPCJUsC3paTJ0/yt7/9jXfeeacznPfs2cOll17aJZwzMjIYPHhwwH/+2aoqK1lUUMAkw6Dw2DFu\n4R8bNbiBLUBpQgJ7oqMpKSsL+0l+0nMKYhHplY7AmejxUOhwkEPXwNmMd5OThqiofg8cl8vFnj17\nuoTzBx98wBVXXNElnCdOnBjQXmkwvUGR0KMgFpFeC6X5BO3t7bz//vtdwvnAgQNMnDixSzhfeeWV\nDBzY+80GtQZd/KUgFhG/hOJ8AofDwXvvvdclnA8ePIjVau0SzpdffjnR0efebkGb4kggKIhFRPC+\noaitreXdd9/tDOiWlhYyMzO7hPOECRM6C2T4vU1sQgJ3b9gQ8tvEin8UxCIi59DS0kJNTU1nr/md\nd97h+PHjnaH8/1VUsPrTT1WVSvyiIBYR6YUvv/ySmpoadu3axa+LizlmGD6XsQuXUqLiHwWxiIgP\nAlUMQ1WpREUfRERETKQgFhHxQaCqUh1yuRg+fHigmiUhSEEsIuKDpKQkJqelscWPc2wGMtPTdX84\nwimIRUR8VFhURGlCgs/HPxIVxchLL+1chy2RSUEsIuKj3Nxc9kRHU+vDsTXAgfh4EhMT+fa3v819\n993HwYMHA91ECQEKYhERH8XExFBSVsatsbE09eK4Jrz7TT+xYQO///3vqa+vxzAMJk2axN13382H\nH37YV02WIKQgFhHxw+y8PJY++CBTY2Op6cHja/DuM710zZrOfabHjh3L2rVr+eijjxgzZgzXXXcd\nt99+O7W1vvS1JdRoHbGISAAEsiqVw+Fgw4YNPP7446Snp7N8+XKuv/76zq01JbwoiEVEAiTQVamc\nTid/+tOfKC4uJjk5meXLl/PDH/7wvIUoJPQoiEVE+kAgq1KdOnWKTZs28dBDD+F0OikqKiIvLw+L\nxRKo5oqJFMQiIiHCMAx27NjBQw89xCeffMLSpUuZN28esbGxZjdN/KDxDRGREBEVFcVNN93EK6+8\ngs1mY8eOHaSmpvKrX/2K1tZWs5snPlIQi4iEoH/6p3/iL3/5Czt37mTfvn1ceumlPPDAA3z55Zdm\nN016SUEsIhLC0tPTefrpp6mtreX48eOkpaVRWFhIY2Oj2U2THlIQi4iEgXHjxvHEE0+wb98+hg0b\nxtVXX80dd9zB7t27/T633W6nsbGRxsZG7HZ7AForZ1IQi4iEkZEjR/LLX/6SxsZGvvOd73DTTTdx\nyy238MYbb/TqPE6nE5vNRpbVypiUFLIzMsjOyGBMSgpZVis2mw2Xy9VHzyKyaNa0iEgYO3HiBH/4\nwx945JFHGDt2LMuXL+f73//+eTcH6dicZJJhUHjsGLfQdXOSLUBpQgJ7oqMvuDmJXJiCWEQkApw8\neZJnn32Whx9+mAEDBvDAAw/wox/9iAEDBnR53Lq1a3lsxQo2tbcz5QLnrMG7Z/bSNWtYuGRJn7U9\n3CmIRUQiiGEYbNu2jYceeogvv/yS+++/n7lz5xITE0NVZSXL5s1jV3s7l/TwfE14985+tLxcPWMf\nKYhFRCLU//zP//Dwww/z3nvv8fOf/5z//NWveP7YMTJ7eZ4a4OYhQ2hqbu7x9p3yDwpiEZEIV19f\nzz333IPnzTd5y8dzZCckcPeGDeSpV9xrmjUtIhLhMjIyGNDWxv1+nKPQ4aC0uDhgbYok6hGLiEQ4\nu93OmJQUWt3uztnRveUGhlksHGxu9qvARSTy9XcuItJjdrudlpYWAJKTk/VCHWRaWlpIiYlhoNvt\n8zkswIhBgzh8+LCuby9paFpE+oQ2hBDpGQ1Ni4hPztfL1YYQoaVjaPqI242vFY41NO07DU2LCNCz\n4WOn00l1dTWlxcXU7d1LSkwMAM1OJ5PT0igsKuKLzz7j16tXs/UcG0JYgFwg1+Hwbggxfz5fff65\nNoQwUVJSEpPT0thSX0+uj+fYDGSmpyuEfWGISMQ6ceKEUVFRYUzNyDDiLRZjfEKCMT4hwYi3WIyp\nGRlGRUWF4XQ6DcMwjEqbzbhoyBBjemKiUQ2GGwzj9IcLjI1gTIyJMUaA8ekZ37vQx6dgXBwXZ1Ta\nbJ3tam1tNfbv32/s37/faG1tNevXE1EqKiqM7ISEHl+3sz9uTEw0bGdcQ+k5DU2LRKjeDB9/PyeH\nlzduPO+2h05gHLANfNoQYmZiIo89+STrH3/8nL3tWbNmacOIPuJ0Ohk3ciTbjh7Vhh79zex3AiLS\n/0oef9y4ODbWeLcHPZ13wRgBxuoLPK4CjGwfe1OVYCSAcf3gwefsbWcnJBgXDRnSpecsgVVpsxkX\nx8b6PaIhvaMgFokwPr/Yng7Mcz1m6unA7O57rWDsP/3Retb3Sk6fu6dvCi6OizNKHn/c7F9j2Ort\nm7RvDRqk6+EnDU2LRBC/hx/xbvJ/9uCjHRgDtPKP4W0nUA2UAnVAyumvNwOTgULAAywHdoGKDASR\njtsWEz0eCh0Ocuh622IzUJqYyG7DoN0wePv//l/S0tLMa3CI0zpikQhSXV3NRI+n1yEMMAVIxxuu\nZ2vBG7QdL9ZVeO8X/w5YgjegD5z+OAIsBjYAC4C/0PMQ5vRjN7W1saigQOuQ+8jsvDyampu5a8MG\nfm21MtRiYXx8POPj4xlmsVBitXL3+vX8vaWFX5eUcPvtt9PW1mZ2s0OWesQiESTLamWxH0tUNgIl\nwGtnfb0RyMYbtOuAx4BNcN56tjZgPfCKj21RkYH+Y7fbOXz4MADDhw/vskTJMAzuvPNO4uLi2LBh\ng1lNDGkKYpEIEaj9hJOAL07/23luvEPTZfR8qDkLb8/YrzcFViuv1dX5eAYJlGPHjjFlyhR+8Ytf\nMGfOHLObE3I0NC0SITr3E/bjHBYgAXj6rK8nARnAIno21GzHe984x4+25AC1DQ3Y7XY/ziKBkJiY\nSFVVFQsXLuSjjz4yuzkhR0EsIr0yGPgP4Oy7s5nABGAo3qHq88Xj2feUfXFmkQEx3+TJk1m9ejWz\nZ8/G6XSa3ZyQoiAWiRDJyck0O534Xl/HOzR9GEjjH5O2nHjv9/4ZaMB7rzgb71B11unvaUpVZCgs\nLCQ1NZVly5aZ3ZSQoiAWiRCd+wn7cY7NeHu+C/EuS+qYHV1++v92vjk7uhzvUHXVGedJxruMyd83\nBYdcLoYPH+7HWSSQoqKiKC8vZ8uWLWzatMns5oQMBbFIBCksKuLJhASfj38E7/BzDvAucB+wFXgJ\nuI2uQ80dxR1eOv2YZXhnVIP3nvJk8PtNQero0SoyEGSGDh1KZWUlBQUFfPLJJ2Y3JyQoiEUiSG5u\nLruBWh+OrQE+AXbiHZZOACo5/xKlDlPwzqR+jH/0jAvx9qJ9tQ7/etTSd6655hruv/9+5syZg9ut\nq3QhCmKRCBITE8OKX/6SGXh3qOqpJrw93nV4Z0UvAmLw3gfuqUvwri1ehPeecS6wB9/fFHwAfHbw\noGZNB6klS5YwfPhwVqxYYXZTgp6CWCTCzJ07l2NRUXwXb6BdSA0wFVgKzOYfO2w1A725O2sHhuEd\n2v4T3iAvAW7FtzcFJUBKTIxmTQep6Oho/uu//ouKigqef/55s5sT1BTEIhEmKSmJYTEx3Il37+jp\neIeaT57xGDfeDTOyTz/mUbwTtDoU4g3VC92d7ZhRnYW395wNfHb6+Cy8e03fizfofXlTIMFtxIgR\nPPPMM/zkJz/h4MGDZjcnaGlnLZEIY7fb+VZyMkdPncLDPwoz1AIjTj/mEN7Z0YV4h5DPLvJwrh22\nzlSFdxh60unzdFvvGO/w9DS8k6+uPf3YbosM4F0eVYI3hN3AMIuFg83NmrAV5B588EF27NjBzp07\nGTjwH1P67HY7LS0tgHd5XaReRwWxSIRpbGwk+zvf4cDx412+bse7Rhi8Q84Xekkcj3ef6NRuvtfT\n/abB28v9PjAT+AE9f1OgLS5Dx6lTp5gxYwbXXXcd//Zv/0Z1dTWlxcXU7d1LSkwMAM1OJ5PT0igs\nKmLWrFkMGnT227/wpSAWiTCNjY1kZ2RwwOHw6zzj6T6Iq/AuVep1aUO8Q+Cz6dmbguzERO5ev15F\nH0LEl19+yZVXXMEAt5vJAwZQeOxY96MkCQnsiY6mpKwsYspc+rPDnIiEoDN32LL4eA433p7q2ZO1\nnHiHo7fhQ2lDvPejb8MbvOfrkdcADVFR5Ob6WjJC+tuzFRXEnzjBc05nt6MkHevOcx0OaoDb5s/n\nq88/Z+GSJf3bUBNospZIhAnkDltnh2U1MPH093rrfPWOz9QE3BYXR0lZWUQNX4ayqspKHluxgjfO\nEcJnmwLsamvjsZUrqaqs7OvmmU5D0yIRyGazUb5gAS/5ODx9Ld6e79kDhwEpbcg36x13qMEbwkvX\nrImInlI4cDqdjBs5km1Hj/b6DVoNcPOQITQ1N4f1my71iEUiUG5uLnuio33eTON9vnlvOFClDWvw\nVmfq0LmUKjGRm4cM4dHycoVwCKmurmaix+P7KInHQ3X1hcZJQpuCWCQCxcTEUFJWxq2xsb3fTCMu\njrt+/nN+fNaxgSptmBAdzcUDBzI+Pp7x8fEMs1gosVq5e/16mpqbI2YCT7goLS6m0I+JgYUOB6XF\nxQFsUfDRZC2RCDU7L4+vPv+cqStWsKm9vUfLjM4cFr50/PgeH9sbsbGxvPj66wwZMgSA4cOHR+z6\n0lBnt9up27vX71GSuQ0N2O32sP07UBCLRLCFS5Zw0ejR3FxQwESPh0KHo/vNNBITaYiK6rKk5Oxj\n5zocnaUN/ZqN7XIxfvz4sH3RjSQtLS2kxMQw0I/CDxZgxKBBHD58OGz/JjQ0LRLhZufl0dTczF0b\nNvBrq5WhFkuPh4XPPHaD1cpA/C9tmJmeHrYvuCLd0axpEenCbrd3FlLo7bBweXk5zyxaxMtn7drV\nU9qkI7zY7XbGpKRwxO32a5Qk3LcyVRCLSMBoqYqcLctqZXF9vX9L2sJ8K1MNTYtIwPg7G1ubdISf\nwqIiShMSfD6+NDGRwqKiALYo+CiIRSSgZuflsfTBB5kaG9vz0oanZ2NraVL48XfNeiRsZaogFpGA\nW7hkCY/+7nfcPGQI0xMSzlnvOCsmRpt0hDmNklyY7hGLSJ9xuVydJe9qGxoYcfoF9ZDLxRWpqXzS\n0sKnn35KfHy8yS2VvrZu7Voe83HNerhTEItIv+huNva0adOYP38+d955p8mtk/5QVVnJIh/WrIc7\nBbGImGbbtm0sX76c9957j6ioKLObI/3A5XKxceNGfv6//zftHg8pMTGAd5QkMz2dwqIicnNzw344\n+kwKYhExjWEYTJo0ibVr13LTTTeZ3RzpJ/v27eN73/seu3fv5siRI0Bkb2WqyVoiYpqoqCiWLVvG\nI488YnZTpB9t3bqVmTNnMnToUFJTU0lNTY3YEAYFsYiYbM6cOezbt4/aWl8WuEgo2rp1KzfffLPZ\nzQgaGpoWEdM9+uij1NXVUVFRYXZTpI/Z7XbGjh3Ll19+qdnyp6n6koiYbsGCBUyYMIFPPvmE8ePH\nm90c6UM7duzguuuuUwifQUPTImK6pKQk5s+fz3/+53+a3RTpYxqW/iYNTYtIUDh48CCTJk3i448/\nZvjw4WY3R/qAx+Nh9OjRvPHGG0yYMMHs5gQN9YhFJCiMGTOGf/mXf+G3v/2t2U2RPlJTU8OwYcMU\nwmdREItI0Fi6dClPPPEEJ06cMLsp0gc0LN09BbGIBI309HSmTJnC008/bXZTpA9s27ZNQdwN3SMW\nkaDy6quvUlBQwN/+9jeio9VXCBdfffUVV1xxBV9//TUWi8Xs5gQV/ZWLSFC5/vrrSUpKYvPmzYB3\n3WljYyONjY3Y7XaTWyc9dfZ1e/7555k+fbpCuBsKYhEJKlFRUdx7773cf//9ZFmtjElJITsjg+yM\nDMakpJBltWKz2XC5XGY3Vc7idDqx2WzdXreV995LcnKyrls3NDQtIkGlo1Re6rFj3G8Y3ELXUnlb\ngNKEBPZER0dUqbxg13HdJhkGhceOdXvdnoyPp2HAAF23syiIRSRoqHh8aNJ184+CWESCQlVlJcvm\nzWNXezuX9PCYJmBqXByPlperh2USXTf/KYhFxHROp5NxI0ey7ehRMnt5bA1w85AhNDU3R1Qx+WCg\n6xYYmqwlIqarrq5mosfT6xdzgClAusdDdXV1oJslF6DrFhjqEYuI6bKsVhbX15Pr4/EbgRKrldfq\n6gLZLLkAXbfAUBCLiKnsdjtjUlJodbt9rsvqBoZZLBxsbiYpKSmQzZNz0HULHA1Ni4ipWlpaSImJ\n8as4ugUYMWgQhw8fDlSz5AJ03QJHQSwiImIiBbGImCo5OZlmpxO3H+dwA4dcLtUx7ke6boGjIBYR\nUyUlJTE5LY0tfpxjM5CZnh7R9xn7m65b4CiIRcR0hUVFlCYk+Hx8aWIihUVFAWyR9ISuW2Bo1rSI\nmE4bQ4QmXbfAUI9YREwXExNDSVkZt8bG0tSL45rw7ltcUlYW8S/mZvjss8+IGz6cHwwYoOvmBwWx\niASF2Xl5LH3wQabGxlLTg8fX4N2veOmaNdqv2AR/+tOfuPbaa1ly3338W3Gxrpsf/FkCJiISUAuX\nLOGi0aO5uaCAiR4PhQ4HOXQtp7cZWGuxsD82VuX0TOBwOPjpT3/K22+/zUsvvURGRgYAo8aMueB1\nK01MpCEqStftLLpHLCJBx+VyUV1dTWlxMbUNDYw4PXx5yOVi4mWXsffvf+fgwYMkJiaa3NLIUltb\nS15eHllZWaxbt474+Pgu3z/fdctMT6ewqIjc3FwNR59FQSwiQc1ut3fuvDR8+HCSkpK48cYbueee\ne/jxj39scusig2EYrFu3jgcffJB169YxZ86cCx7T3XWT7imIRSTkPPPMM/zxj3/khRdeMLspYe/Q\noUP85Cc/4auvvsJms3HppZea3aSwo8laIhJycnNzeeedd2hq6s1cXemtV199lcmTJ3PllVeya9cu\nhXAfURCLSMiJjY0lLy+PP/zhD2Y3JSydPHmSVatWkZ+fz1NPPcUjjzyi+7p9SEPTIhKSamtrmTVr\nFvv37yc6Wn2KQGlqaiI/P5+4uDiefvppRo0aZXaTwp7+ekUkJGVmZjJ06FBefvlls5sSNqqrq7nq\nqqvIycnhhRdeUAj3E60jFpGQNX/+fMrLy5k+fbrZTQlp7e3t3Hfffbzwwgts2bKFa665xuwmRRQN\nTYtIyDpy5Aipqak0NjZGfCk98C4ZamlpAbxlCnuyZGjv3r3k5eWRlpZGWVmZlhmZQEPTIhKyhg0b\nxsyZM3nmmWfMboppnE4nNpuNLKuVMSkpZGdkkJ2RwZiUFLKsVmw2Gy6X6xvHGYbBU089xfXXX8+i\nRYuw2WwKYZOoRywiIW3nzp3cd9991NXVERUVZXZz+lVVZSWLCgqYZBgUHjvGLXTdVnILUJqQwJ7o\n6C7bStrtdhYsWMC+ffuorKzkyiuvNOkZCKhHLCIhbtq0aRw9epTa2lqzm9Kv1q1dy7J589h69Cg7\njh3jNrpO+rEAucBLDgdbjx5l2fz5rFu7lrfeeovJkyeTkpLC22+/rRAOAuoRi0jIW7NmDV988QWl\npaU+3ScNNVWVlSybN49d7e1c0sNjmoBrLBbaBg/mv55+mltvvbUvmyi9oCAWkZD38ccfY7VayZgw\ngfp9+0iJiQGg2elkcloahUVFzJo1Kyw2pXA6nYwbOZJtR4+S2ctja4CZCQl81tISFr+LcKGhaREJ\naVWVlUydMoWMEydYuns3rW43BxwODjgcHHG7WVxfT/mCBVySkkJVZaXZzfVbdXU1Ez2eXocwwBRg\n4ulzSPBQj1hEQta6tWt5bMUKNrW3M+UCj60BbjtdkH7hkiX90bw+kWW1sri+nlwfj98IlFitvFZX\nF8hmiR8UxCISkny9Tzo1Lo5Hy8tDsjC93W5nTEoKrW63z7sxuYFhFgsHm5vD8v55KNLQtIiEHKfT\nyaKCAv7SixAGuATY1NbGooKCbtfWBruWlhZSYmL82hLRAowYNKizVrCYT0EsIiHH3/uk6R6P7pNK\n0FAQi0jIKS0uptDh8Pn4QoeD0uLiALaofyQnJ9PsdOL24xxu4JDLpS1Bg4iCWERCit1up27vXnL8\nOEcOUNvQgN1uD1Sz+lx7ezs7duxgWGwsW/w4z2YgMz1d94eDiIJYREJKJN0nPXnyJC+++CJz585l\n9OjRlJXCVnYaAAATu0lEQVSVMTMvjycTEnw+Z2liIoVFRQFspfhLZRBFRIKIYRi89dZbVFRU8Oyz\nzzJ+/Hjy8/N5+OGH+da3vuXd0KOyklrwaUOPhqgocnN9XfwkfUFBLCIh5cz7pBYfzxGM90kbGhqo\nqKjAZrMxaNAg7rjjDl5//XUuu+yyLo+LiYmhpKyMW31YunVbXBwlZWXaVSvIKIhFJKQkJSUxOS2N\nLX5sahEs90k//fRTKisrqaiooKWlhTlz5rBx40asVut5K0nNzsvjq88/Z6oPm5mE4vrpcKcNPUQk\n5NhsNsoXLOAlH2dOZycmcvf69eSZEEqHDh3iv//7v6moqOBvf/sbP/rRj8jPz2fq1KlER/du2k5H\nGcSJHg+FDgc5dC2DuBnvPeGGqKguZRAluCiIRSTk+Fv44OYhQ2hqbu63IVqHw8Fzzz1HRUUFr7/+\nOjNnziQ/P5+bbrrJ7za4XC6qq6spLS6mtqGBEafPd8jlIjM9ncKiInJzczUcHcQUxCISkoJ9i0uX\ny8X27dupqKjg+eefZ+rUqeTn55OTk0OCH7Oez8dut3fOBB8+fLjpQ+/SM7pHLCIhqbf3Sf8KzBk8\nmLvuvZfv/+AHfdImj8fDa6+9RkVFBRs3biQ9PZ38/HyeeOIJRowY0Sc/80xJSUkK3xCkHrGIhLTz\n3Sd1ACuBquhoDns83vXHFktA6xQbhkFdXR0VFRVUVlaSkpLCnDlzyMvL45JLerMTtkQqBbGIhLzu\n7pMePXGCE6dOMTk6mqUeD7fQdSLTFqA0IYE90dE+TWT66KOPsNlsVFRU4Ha7yc/PZ86cOaSlpQX4\n2Um4UxCLSFix2+2sfeQRnnrsMTa7XAGtU/zFF19QVVVFRUUFTU1NzJ49m/z8fK6++urzLjcSOR8F\nsYiElUBP4mptbaW6upqKigpqamq49dZbyc/PZ9q0aQwcqGk24j8FsYiEjUAtazp16hRbt26loqKC\nnTt3Mn36dPLz85k5cyaxsbF90XSJYHo7JyJhw986xf+P28306dPZvXs33/3ud8nPz+f3v/+9ZiJL\nn1KPWETCRpbVymI/tr7cCKwYM4ZX3n2XUaNGBbJpIuekIBaRsGC32xmTkkKr2+3zUJ8bGGaxcLC5\nWb1g6TeqRywiYSGS6hRLeFEQi4iImEhBLCIhzzAMvv76a75qb8ftx3mCsU6xhD/NmhaRkPTpp5+y\nc+dOdu7cycsvv0xsbCwjk5LYcvhwyNcplsiiHrGIhITm5maeffZZCgoKuOyyy7j66qvZsWMH06ZN\n44033qCxsZGHfvMbSv2obFSamEhhUVEAWy1yYZo1LSJB6dixY7z22mudvd5PP/2Uf/7nfyY7O5vs\n7GzS09O/sa1kqNUpFgENTYtIkHA6nbz11ludwfv+++/z3e9+l+zsbMrKyrjqqqsuuKVkTEwMJWVl\n3DJ3Lm+6XL3a4vK2uDhKysoUwtLvFMQiEchut9PS0gJAcnKyKfdET506xXvvvdcZvG+++SZXXHEF\n2dnZ/OIXv+C6667zaTvJrz7/HKfHw/8CnoMeFX24xWLhgTVrel2BSSQQFMQiEcLpdHaWCqzbu5eU\nmBiAgNbmPR/DMPjggw86g/fVV19l1KhRZGdnc88991BVVcXQoUP9+hlVlZU8tmIFtSdP8iZwMzAR\nKIQudYrdeCdmlQJ7gFPARaNH+/WzRXyle8QiEaCqspJFBQVMMgwKjx0LeG3ec/n73//eZWZzdHR0\n5z3eG2+8kdEBDL/u7g+7gGq8gVsLjDj99UNAJt6AzgV2o/vDYh4FsUiYW7d2LY+tWMGm9vaA1ubt\nzuHDh3nllVc6w7elpYUbb7yRG2+8kezsbC677LI+q9trs9koX7CAlxyObr9vBzr2yxoOnD0Yn52Q\nwN0bNpCn4WnpZwpikTAW6Nq8Zzt+/Di7du3qDN6PPvqIqVOndvZ6v/Od7xAd3T+rJANR8KHEauW1\nurpANkvkghTEImGqL5byuN1u3n77bV5++WV27txJTU0NmZmZncF79dVXmzK0q4IPEso0WUskTPlb\nmzfd4+HPf/4zaWlpnT3eXbt2cdlll5Gdnc3y5cvJysoiPj4+0E3vtc6CD27fN7g8s+CDglj6k4JY\nJEyVFhez+Bz3S3ui0OHg7n/9V0ZMmEB2djbz5s3jj3/8I8nJyQFspYhoaFokDAVsqHbgQA4eOhT0\nPcSO53vE7cbi4zk0NC1m0V7TImEoYLV5Y2JCojZvUlISk9PS2OLHOVTwQcyiIBaRsFBYVKSCDxKS\nFMQiYcjj8URcbd7c3Fz2REdT68OxNUBDVBS5ub4ufhLxnYJYJAy4XC5eeeUVli9fTmZmJldddRXJ\n8fERNVTbUfDh1thYmnpxnAo+iNkUxCIhyDAMPvzwQ5544gl++MMfMmLECB544AEsFgvr1q2jubmZ\nR/7P/4m4odrZeXksffBBpsbGUtODx9fg3bxkqQo+iIk0a1rkAoKhUhFAa2srL7/8Mtu3b2f79u2c\nPHmSGTNmMGPGDLKzs7+xrCiSa/PabDbuvvNOroqJYWF7e/cFHxITaYiKCuje2iK+UI9YpBtOpxOb\nzUaW1cqYlBSyMzLIzshgTEoKWVYrNpsNl8vVp204deoUb731VmdJwIsvvpj169dzxRVXsG3bNj77\n7DPKy8u5/fbbu13bG8lDtYZhkH7VVRSUl/Nrq5WhFgvj4+MZHx/PMIuFEquVu9evp6m5WSEsplOP\nWOQsZlUqAvjss886e7w7d+5k7NixzJgxg5tuuomsrCwGDx7c63P2Z9GHYOByuUhLS+Opp57ihhtu\nALyjGh3LsIYPHx4y970lMiiIRc7Q36F1/Phx/vrXv/Liiy+yfft2Dh06xPe+9z1mzJjB9773vYCV\nCex4czHR46HQ4Qjrodrf/va3/OUvf2H79u1mN0WkRxTEIqf1daUi8A6Zvv/++2zfvp0XX3yRt99+\nm8zMzM57vZMnT+6zakUul4vq6mpKi4upbWhgxOlh50MuF5np6RQWFZGbmxuyw9EAbW1tfPvb32bz\n5s1MmXKht1IiwUFBLELfTmz6+uuv2bFjR2f4JiYmctNNNzFjxgymTZtGYmJiQJ5Db4TrUO3DDz9M\nXV0dVVVVZjdFpMcUxCJcuKj8hZxZVN7lcvH66693Djc3NjYybdq0znu9EyZMCHDrBeDIkSNcfvnl\nvP7661x++eVmN0ekxxTEIgSmqPyKMWO41Grltdde48orr+zs9V5zzTVYLL6WIpCeWr58OS0tLaxf\nv97spoj0ioJYIl6gKhUNiY6m9KmnyMnJUanAPnKuNd1ffPEFEydOpL6+nrFjx5rZRJFeUz1iiXiB\nKip/UWwsN9xwg0I4wJxOZ+cks7q9e0mJiQGg2elkcloahUVFvPrqq8ybN08hLCFJQSwiQevMNd1L\nOtZ0n37D5Aa21Nfzm7vv5u22NkrKykxtq4ivFMQS8ZKTk2l2OnGDX0XlQ6lSUSjoWNO99Rxrui1A\nLpB7/Lh3Tfe999J27FjIbkQikUtbXErEU1H54FNVWcljK1awqwcbqwBMAXa1tfHYypVUVVb2dfNE\nAkqTtUSAiooK1t91F6+2t/t0fHZiInevX09eCO9IFSwiuViFRCb1iCWiGYbB9u3bKSkp4V2nU0Xl\ng0B1dTUTPZ5ehzB4e8bpHg/V1dWBbpZIn1EQS0QyDIMXX3yR6667jsWLF7N48WI2/PGPEVmpKNiU\nFhdT6OPGKgCFDgelxcUBbJFI39JkLYkohmGwY8cOVq9ezZEjR/j3f/93fvzjHzNgwAAAmr/8kqk+\nFH0I5SIJwcRut1O3dy85fpwjB5jb0IDdbtc9ewkJCmIJaufawKG3DMPgpZdeYvXq1Rw+fJhVq1Zx\n++23dwZwh4VLlnDR6NHcHCGVioJNoNZ0jxg0iMOHDyuIJSRoaFqCjtPpxGazkWW1MiYlheyMDLIz\nMhiTkkKW1YrNZsPlcvXoXB094KlTp7Jw4UJ+9rOfsWfPHubMmfONEO4wOy+PpuZm7tqwQUXlRaTP\nada0BJUzN3Ao7NjA4fT33MAWoDQhgT3R0eftjfa0B9wT4VqpKBh1bDd6xO32a033MIuFg83NulYS\nEjQ0LUGjxxs4OBze+7Pz5/PV55932cDBMAx27tzJ6tWrOXToEKtWrWL27Nk+BXCHpKQkvaD3k841\n3X4U4NCabgk1GpqWoODvBg4dPeCsrCx+9rOfUVhYSENDA/n5+X6FsPS//3fZMkoGD/b5+NLERAqL\nigLYIpG+paFpMZ2/GzjMiIvj8oyMziFof3vAYg6Px8OmTZtYuXIln334IX89dUobekhE0NC0mM7f\nDRwua28nMzOTkpISBXAIMgyDLVu2sGrVKgYOHMhjjz3GUbudW+fPZ1d7O5f08Dxa0y2hSkEspist\nLmaxHxs4LDMMSl5/XSEcYgzD4IUXXmDVqlW4XC7+4z/+g5ycHKKiogD4+osvtKZbIoKGpsVUHbNk\nW91un98VapZs3wvUem74x4S6VatWYbfb+cUvfkFubi7R0d+cstIxi15ruiWcabKWmKpzAwc/znHm\nBg4SOIFcz93hr3/9KzfccAM//elP+dnPfsb777/Pj370o25DGLSmWyKDesRiqsbGRrIzMjjgx9A0\nwPj4eF7ZvZvU1NQAtSyyBWo9d4c333yTlStXcuDAAVatWsUdd9zBwIG9f/ulNd0SjhTEYipt4BB8\nOtZz9/be7JnruTu88847rFq1ir1797Jy5Urmzp2LxeLrlRYJTxqaFlN1buDgxzm0gUPg+Lueu8N7\n771HTk4Ot912Gzk5OXz00UfcddddCmGRbiiIxXSFRUWUJiT4fLw2cAgMp9PJooIC/tKLJUMAlwCb\n2tpYVFBAXV0ds2bNYubMmUyfPp2PP/6Ye+65R8uJRM5DQSymy83NZU90NLU+HFsDNERFkZvr64aI\n0sHf9dwT2tq44YYbuPbaa/n4449ZuHAhg/3YIUskUiiIxXQxMTGUlJVxa2wsTb04LtQ2cLDb7TQ2\nNtLY2Ijdbje7Od9QWlxMoR+T5u47eZJJ48axdOlS4uLiAtgykfCmIJagMDsvj6UPPsjU2FhqevD4\nGmBqCGzg0BdLgPqC3W6nbu9ecvw4Rw7w3r59QfkmQySYKYglaCxcsoRHf/c7bh4yhOkJCVQDJ8/4\nvhvYCPyvgQOZHhPDo+XlzJ0/P2h7mVWVlYwbOZLfFRSwpL6eVrebAw4HBxwOjrjdLK6vp3zBAi5J\nSeky0ckMWs8tYh4FsQSVnmzgkLNmDacGDWLdr34VtL3MdWvXsmzePLYePcqOY8e4ja77yXaUdHzJ\n4WDr0aMsmz+fdWvXmtNYETGV1hFLUDt7A4cXnn+eRQUFXNbWxn0nT/q90URfqKqsZNm8eb0uWDA1\nLo5Hy8v7vM1tbW0cOHCgcyThwIEDfPDBB7zywgscA63nFulnCmIJGYHcaKKv+FvSMRAl/E6dOsXB\ngwe7hG1H4HYM4Y8fP57U1FQmTJjAhAkTSE1N5ZcPPMC/ffghvs4/3wiUWK28Vlfnc9tFIpGqL0lI\nOHOjiZ70Mjs2mpi6ciUXjR7dbz1jf5cApXs8VFdXk3eB9ra2tn4jYDs+b2pqIjk5uTNgJ0yYwIwZ\nMzr//61vfavbvZ1PnDhB6YIF5Po4c1rruUV8ox6xBL1g6GX2VJbVyuL6er97lS+9/TZNTU3nDFu3\n293Zmz0zcCdMmMC4ceOIjY3t9c8Opd+zSDhRj1iCXn/1Mv0VqCVAd7z3HgkJCYwdO7ZLwM6aNavz\n8+Tk5M66vYHSuZ7bh/vbobSeWyTYKIgl6JUWF7PYj40mCh0OSoqL/Qpij8dDe3s7bW1tHD9+nOPH\nj3d+3vHvJ598wtDoaL+XAF0UF8eOujouv/xyP87km9l5eXz1+edM9eFefDCv5xYJZgpiCWqB6mX+\n6+7d/OY3v8EwjG8E6Nn/dve1EydOMHjwYOLj44mPjycuLq7Lv/Hx8Zw6dQrPqVN+P+eoqChTiyMs\nXLKEi0aP5uaCAiZ6PBQ6HOTQdXb6Zrz3hBuiokybnS4SLnSPWIJaoOoVjxowgKm33sqoUaO6DdEL\nfS02Nvacxes7hFtJR5fLRXV1NaXFxdQ2NDDi9LDzIZeLzPR0CouKyM3N1XC0iJ8UxBLUAhXE4+Pj\neWX3blJTUwPUsu4FarJWsC0BOns9t9lvEkTCiXbWkqCWnJxMs9OJ249zuPH24oYPHx6oZp1TuJZ0\nTEpKIjU1ldTUVIWwSIApiCWoJSUlMTktjS1+nGMzkJme3i8BopKOItJbCmIJeqHUy4yUko4iEjgK\nYgl6odbLDNeSjiLSNxTEEvRCsZfZ05KO2YmJ3DxkCI+Wl/frntgiEjw0a1pCRigUfTiblgCJyIUo\niCWkVFVWsihEN5rQEiAR6Y6CWEKOepkiEk4UxBLS1MsUkVCnIBYRETGRZk2LiIiYSEEsIiJiIgWx\niIiIiRTEIiIiJlIQi4iImEhBLCIiYiIFsYiIiIkUxCIiIiZSEIuIiJhIQSwiImIiBbGIiIiJFMQi\nIiImUhCLiIiYSEEsIiJiIgWxiIiIiRTEIiIiJlIQi4iImEhBLCIiYiIFsYiIiIkUxCIiIiZSEIuI\niJhIQSwiImIiBbGIiIiJFMQiIiImUhCLiIiYSEEsIiJiIgWxiIiIiRTEIiIiJlIQi4iImEhBLCIi\nYiIFsYiIiIkUxCIiIiZSEIuIiJhIQSwiImIiBbGIiIiJFMQiIiImUhCLiIiY6P8Hhl61LsmNE7gA\nAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0xbd652e8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Create the Graph \n",
    "lolli_g = lollipop=nx.lollipop_graph(10,20)\n",
    "\n",
    "print \"The Cliques in the Lollipop graph are, \", list(nx.find_cliques(lolli_g))\n",
    "\n",
    "# Draw the Graph \n",
    "nx.draw(lolli_g)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
