{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# Imports \n",
    "import sys\n",
    "from py2neo import neo4j, Graph, Relationship\n",
    "from py2neo.cypher import CypherWriter\n",
    "import MySQLdb\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<_mysql.connection open to 'localhost' at 2f2b620>\n",
      "<MySQLdb.cursors.DictCursor object at 0x7f4ffba63fd0>\n"
     ]
    }
   ],
   "source": [
    "# Create MySQL connection\n",
    "user = \"lcdebaca\"\n",
    "password = \"qbRUy*uW7bUffBcBUBD7\"\n",
    "database = \"starmetrics\"\n",
    "\n",
    "# invoke the connect() function, passing parameters in variables.\n",
    "db = MySQLdb.connect( user = user, passwd = password, db = database )\n",
    "\n",
    "# output basic database connection info.\n",
    "print( db )\n",
    "\n",
    "cursor = db.cursor( MySQLdb.cursors.DictCursor )\n",
    "# Print Curser\n",
    "print(cursor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Found 200 rows\n",
      "['occupationalclassification', 'occupation_orig', 'employeeid', 'uniqueawardnumber']\n",
      "{'occupationalclassification': 'Undergraduate', 'occupation_orig': 'UNDERGRAD', 'employeeid': '90009387', 'uniqueawardnumber': \"'00.500 NONGrant\"}\n"
     ]
    }
   ],
   "source": [
    "# Test SQL \n",
    "\n",
    "\n",
    "# The Following is a Query of the starmetrics database\n",
    "# It collects the following variables for Purdue University between the \n",
    "#years 2008 - 2012:  \n",
    "#From the employee Table: id, employeeid, uniqueawardnumber, employeeoccupation\n",
    "#From the occupation Table: occupationalclassification \n",
    "\n",
    "# NOTE I LIMIT TO 200 BECAUSE THE REST OF THE NOTEBOOK WONT RUN OTHERWISE \n",
    "sql_select = \"SElECT employee.employeeid, employee.uniqueawardnumber, employee.occupation_orig, \\\n",
    "occupation.occupationalclassification \\\n",
    "FROM starmetrics.employee \\\n",
    "INNER JOIN starmetrics.occupation ON \\\n",
    "starmetrics.employee.occupation_orig = occupation.occupation_orig \\\n",
    "WHERE starmetrics.employee.university = 'purdue' AND starmetrics.employee.year BETWEEN 2008 AND 2012 LIMIT 200;\"\n",
    "\n",
    "result_count = cursor.execute(sql_select);\n",
    "\n",
    "# Count the number of rows returned \n",
    "print(\"Found \" + str(result_count) + \" rows\")\n",
    "\n",
    "# Testing\n",
    "one = cursor.fetchone()\n",
    "print(one.keys())\n",
    "print(one)\n",
    "\n",
    "\n",
    "# Store the results of the Query in a list\n",
    "results = cursor.fetchall()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# I want to test the code without a a ton of cases, so here is my example results list \n",
    "\n",
    "results = [\n",
    "    {'occupationalclassification': 'Undergraduate', 'occupation_orig': 'UNDERGRAD', 'employeeid': '90009387', 'uniqueawardnumber': \"'00.500 NONGrant\"},\n",
    "    {'occupationalclassification': 'Undergraduate', 'occupation_orig': 'UNDERGRAD', 'employeeid': '90009387', 'uniqueawardnumber': \"'00.500 NONGrant\"},\n",
    "    {'occupationalclassification': 'Graduate Student', 'occupation_orig': 'GRADUATE', 'employeeid': '90027173', 'uniqueawardnumber': '00.070 03-C-NE-PU'},\n",
    "    {'occupationalclassification': 'Faculty', 'occupation_orig': 'FACULTY', 'employeeid': '90014540', 'uniqueawardnumber': '00.070 03-C-NE-PU'},\n",
    "    {'occupationalclassification': 'Faculty', 'occupation_orig': 'FACULTY', 'employeeid': '90014540', 'uniqueawardnumber': '00.070 03-C-NE-PU'},\n",
    "\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Graph uri=u'http://localhost:7474/db/data/'>\n"
     ]
    },
    {
     "ename": "ConstraintViolationException",
     "evalue": "Label 'employeeid' and property 'uniqueawardnumber' already have a unique constraint defined on them.",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mConstraintViolationException\u001b[0m              Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-88-06c3f85926a1>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m()\u001b[0m\n\u001b[0;32m      8\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      9\u001b[0m \u001b[1;31m# Force nodes to have unique employeeids and uniqueawardnumbers\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 10\u001b[1;33m \u001b[0mgraph_db_test\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mschema\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mcreate_uniqueness_constraint\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"employeeid\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m\"uniqueawardnumber\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/py2neo/schema.pyc\u001b[0m in \u001b[0;36mcreate_uniqueness_constraint\u001b[1;34m(self, label, property_key)\u001b[0m\n\u001b[0;32m     58\u001b[0m         \"\"\"\n\u001b[0;32m     59\u001b[0m         self._uniqueness_constraint_template.expand(label=label).post(\n\u001b[1;32m---> 60\u001b[1;33m             {\"property_keys\": [property_key]})\n\u001b[0m\u001b[0;32m     61\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     62\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0mdrop_index\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mlabel\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mproperty_key\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/py2neo/core.pyc\u001b[0m in \u001b[0;36mpost\u001b[1;34m(self, body, headers, **kwargs)\u001b[0m\n\u001b[0;32m    314\u001b[0m                 \u001b[0mcontent\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;33m{\u001b[0m\u001b[1;33m}\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    315\u001b[0m             \u001b[0mmessage\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mcontent\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mpop\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34m\"message\"\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;34m\"HTTP POST returned response %s\"\u001b[0m \u001b[1;33m%\u001b[0m \u001b[0merror\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mstatus_code\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 316\u001b[1;33m             \u001b[0mraise_from\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0merror_class\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mcontent\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0merror\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    317\u001b[0m         \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    318\u001b[0m             \u001b[1;32mreturn\u001b[0m \u001b[0mresponse\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32m/usr/local/lib/python2.7/dist-packages/py2neo/util.pyc\u001b[0m in \u001b[0;36mraise_from\u001b[1;34m(exception, cause)\u001b[0m\n\u001b[0;32m    233\u001b[0m \u001b[1;32mdef\u001b[0m \u001b[0mraise_from\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mexception\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mcause\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    234\u001b[0m     \u001b[0mexception\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m__cause__\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mcause\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 235\u001b[1;33m     \u001b[1;32mraise\u001b[0m \u001b[0mexception\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    236\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    237\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mConstraintViolationException\u001b[0m: Label 'employeeid' and property 'uniqueawardnumber' already have a unique constraint defined on them."
     ]
    }
   ],
   "source": [
    "# Create connection to the Neo4jsdatabase using defaults\n",
    "# note, I imported Graph when I imported py2neo\n",
    "graph_db_test = Graph()\n",
    "print graph_db_test\n",
    "\n",
    "#Create the Neo4j Database \n",
    "graph_db_test.create()\n",
    "\n",
    "# Force nodes to have unique employeeids and uniqueawardnumbers\n",
    "graph_db_test.schema.create_uniqueness_constraint(\"employeeid\", \"uniqueawardnumber\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# Use this line to clear all nodes and relationships from the graph\n",
    "#(good for debuging) \n",
    "graph_db_test.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# First Things First,\n",
    "# Below is an exaple of how to create a single node with the properties employeeid, uniqueidnumber, occupation_orig, \n",
    "#and occupation identification. \n",
    "# If we wanted to make a single node, this would be the syntax \n",
    "new_employee_node = neo4j.Node(\"employee\", employeeid = '90014540', occupation_orig = \"FACULTY\", occupationalclassification = \"Faculty\")\n",
    "\n",
    "\n",
    "graph_db_test.create( new_employee_node )\n",
    "# Python uses a slightly different syntax to query the Neo4js database\n",
    "#If we were using the Neo4js Turminal, this would be the Cypher Query we would type:\n",
    "## CREATE (Employee1:Employee { id_num: \"4\", employeeid:'90014540', uniqueawardnumber:'00.070 03-C-NE-PU',occupation_orig:\"FACULTY\", occupationalclassification:\"Faculty\" })\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "If you want to test Cypher query syntax, This is a good site to experiemtn with;\n",
    "\n",
    "Cypher playground: http://console.neo4j.org/?_ga=1.113286210.459216022.1444237641\n",
    "\n",
    "Warning, I would suggest refreshing this page often "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# Above I saved the results of the SQL Query into a list called results\n",
    "# Below I iterate over that list, create properties based on the varibles in the SQL database,\n",
    "# and finaly create an 'employee' node with those properties\n",
    "\n",
    "for employee in results:\n",
    "    id_num = employee['employeeid']\n",
    "    occ_orig = employee['occupation_orig']\n",
    "    occ_class = employee['occupationalclassification']\n",
    "    award_num = employee['uniqueawardnumber']\n",
    "    # Wee tiny bit of data cleaning\n",
    "    if award_num[0] == \"'\":\n",
    "        award_num = award_num[1:len(award_num)]\n",
    "\n",
    "    # Create a node with above infomation (This node is not in the Graph yet though)\n",
    "    new_employee_node = neo4j.Node(\"Employee\", employeeid = id_num, occcupation_orig = occ_orig, \\\n",
    "                      occupationalclassification = occ_class)\n",
    "    new_award_node = neo4j.Node(\"Award\", uniqueawardnumber = award_num)\n",
    "    \n",
    "    new_employee = False\n",
    "    new_award    = False\n",
    "    # Check to see that the employee is not already in the graph \n",
    "    if graph_db_test.find_one(\"Employee\", \"employeeid\", id_num) == None:\n",
    "        new_employee = True\n",
    "        graph_db_test.create( new_employee_node )\n",
    "    \n",
    "        \n",
    "    \n",
    "    # Check to see that the award is not already in the graph \n",
    "    if graph_db_test.find_one(\"Award\", \"uniqueawardnumber\", award_num) == None:\n",
    "        new_award = True\n",
    "        graph_db_test.create( new_award_node )\n",
    "   \n",
    "    # Add relationships between the employees and the awards \n",
    "    # if noth bothe employee and the award are new, create a realtionship between them\n",
    "    if (new_employee & new_award):\n",
    "        new_relationship = Relationship(new_employee_node, \"worked_on\", new_award_node)\n",
    "        graph_db_test.create( new_relationship )\n",
    "    # if jus t he employee is new, then the award must already exisit \n",
    "    elif (new_employee):\n",
    "        # find the exsisting award node \n",
    "        exsitsting_award_node = graph_db_test.find_one(\"Award\", \"uniqueawardnumber\", award_num)\n",
    "        # Create realtionship between that node and the new employee\n",
    "        new_relationship = Relationship(new_employee_node, \"worked_on\", exsitsting_award_node)\n",
    "        graph_db_test.create( new_relationship )\n",
    "    \n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    " At this point we have a graph database that has awards and connected to those nodes are employees. In ASCI art, it looks somthin like this: \n",
    "\n",
    "            A       A \n",
    "           / \\    / | \\ \n",
    "          E   E  E  E  E \n",
    "There is an obvious missing realtionship here, right? Employees that \"worked on\" a grant \"worked with\" the other employees that worked on that grant. What we want is a graph that looks like this:    \n",
    "\n",
    "            A       A \n",
    "           / \\    / | \\ \n",
    "          E-- E  E--E--E \n",
    "            \n",
    "Lets Create those realtionships between employees"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 90,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# When looking at Employees and Awards, each Award has one to many Employees. So the quickest way to find a group of \n",
    "#employees that worked together is to find individual awards \n",
    "\n",
    "# for this we will use a straingt cypher command \n",
    "# Note, these cypher commands return RecordList Objects, Not Lists \n",
    "\n",
    "# Notice that we are asking Cypher to return n.uniqueawardnumber AS uniqueawardnumber\n",
    "# doingthis will allow us to access this attribute as:  print awards_record[1].uniqueawardnumber\n",
    "awards_record = graph_db_test.cypher.execute(\"MATCH (n:Award) RETURN n, n.uniqueawardnumber AS uniqueawardnumber;\")\n",
    "\n",
    "# Get length of Record \n",
    "awards_record_len = graph_db_test.cypher.execute(\"MATCH (n:Award) RETURN COUNT(*) AS count\")\n",
    "\n",
    "# Get the number of returned nodes as a number \n",
    "awards_record_len = awards_record_len[0].count\n",
    "\n",
    "# The Cypher returned a RecordList Object, but a list would be easiest to work with;\n",
    "\n",
    "\"\"\"\n",
    "The following loop wil add every award number to a list ( I don't need the whole object to find the\n",
    "employees who worked on that award )\n",
    "\n",
    "Note, I find while loops work better for this work than for loops \n",
    "\"\"\"\n",
    "count = 0\n",
    "awards = []\n",
    "while count < awards_record_len:\n",
    "    awards.append(str(awards_record[count].uniqueawardnumber))\n",
    "    count += 1 \n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# Next we want to get a list of employees that worked on each of those awards \n",
    "\n",
    "# for every award in our award list; \n",
    "count = 0 \n",
    "while count < len(awards):\n",
    "    # Create a Cypher Query that collects the employees that have \"worked_on\" that award;\n",
    "    tx = graph_db_test.cypher.begin()\n",
    "    statment = \"MATCH (n)-[r:worked_on]->(m {uniqueawardnumber:{NUM}}) RETURN n.employeeid AS employeeid;\"\n",
    "    # This bit of code subsitutes NUM for the award number contained in out awards list \n",
    "    tx.append(statment, {\"NUM\": awards[count]})\n",
    "    relivent_employees_record = tx.commit()\n",
    "    \n",
    "    # Create a Query that collects the number employees that have \"worked_on\" that award;\n",
    "    tx = graph_db_test.cypher.begin()\n",
    "    statment = \"MATCH (n)-[r:worked_on]->(m {uniqueawardnumber:{NUM}}) RETURN Count(*) AS count;\"\n",
    "    tx.append(statment, {\"NUM\": awards[count]})\n",
    "    relivent_employees_record_len = tx.commit()\n",
    "    \n",
    "    # Get the number of returned nodes as a number (Cuz remember, the cypher Returns a RecordList)\n",
    "    relivent_employees_record_len = relivent_employees_record_len[0][0].count\n",
    "    \n",
    "    #print relivent_employees_record\n",
    "    #print relivent_employees_record[0][0].employeeid\n",
    "\n",
    "    \n",
    "    #I want emplyees in a list, not a Record Object, \n",
    "    i = 0\n",
    "    relivent_employees = []\n",
    "    while i < relivent_employees_record_len:\n",
    "        relivent_employees.append(str(relivent_employees_record[0][i].employeeid))\n",
    "        i += 1\n",
    "    \n",
    "    # Next create Relatioships between the employees'\n",
    "    \"\"\"\n",
    "    What I'm doing here is saying connect the first employee with each employee that follows it in the list,\n",
    "    then repete the process with the next employee until you reach the end of the list \n",
    "    \n",
    "    There is a bug in the logic here\n",
    "    \"\"\"\n",
    "    current_employee = 0 \n",
    "    while current_employee < len(relivent_employees):\n",
    "        next_employee = current_employee + 1 \n",
    "        while next_employee < len(relivent_employees):\n",
    "            tx = graph_db_test.cypher.begin()\n",
    "            statment = \"MATCH (n {employeeid: {NUM1}}), (m {employeeid: {NUM2}})\\\n",
    "            CREATE (n)-[r:worked_with]->(m) RETURN r;\"  \n",
    "            tx.append(statment, {\"NUM1\": relivent_employees[current_employee], \"NUM2\": relivent_employees[next_employee]})\n",
    "            tx.commit()\n",
    "            next_employee += 1 \n",
    "        current_employee += 1\n",
    "    \n",
    "\n",
    "    #DONT COMMENT THIS OUT REN\n",
    "    count += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   | COUNT(*)\n",
       "---+----------\n",
       " 1 |        4"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_db_test.cypher.execute(\"MATCH (n)-[r:worked_on]->(m {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN COUNT(*);\") "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    | r                                                \n",
      "----+---------------------------------------------------\n",
      "  1 | (:`90003312`)-[r48701:worked_with]->(:`90022062`)\n",
      "  2 | (:`90003312`)-[r48702:worked_with]->(:`90014540`)\n",
      "  3 | (:`90003312`)-[r48703:worked_with]->(:`90027173`)\n",
      "  4 | (:`90022062`)-[r48704:worked_with]->(:`90014540`)\n",
      "  5 | (:`90022062`)-[r48705:worked_with]->(:`90027173`)\n",
      "  6 | (:`90014540`)-[r48706:worked_with]->(:`90027173`)\n",
      "  7 | (:`90017693`)-[r48707:worked_with]->(:`90026679`)\n",
      "  8 | (:`2623`)-[r48708:worked_with]->(:`15226`)       \n",
      "  9 | (:`2623`)-[r48709:worked_with]->(:`90013819`)    \n",
      " 10 | (:`15226`)-[r48710:worked_with]->(:`90013819`)   \n",
      "\n",
      "    | r                                                \n",
      "----+---------------------------------------------------\n",
      "  1 | (:`90003312`)-[r48701:worked_with]->(:`90022062`)\n",
      "  2 | (:`90003312`)-[r48702:worked_with]->(:`90014540`)\n",
      "  3 | (:`90003312`)-[r48703:worked_with]->(:`90027173`)\n",
      "  4 | (:`90022062`)-[r48704:worked_with]->(:`90014540`)\n",
      "  5 | (:`90022062`)-[r48705:worked_with]->(:`90027173`)\n",
      "  6 | (:`90014540`)-[r48706:worked_with]->(:`90027173`)\n",
      "  7 | (:`90017693`)-[r48707:worked_with]->(:`90026679`)\n",
      "  8 | (:`2623`)-[r48708:worked_with]->(:`15226`)       \n",
      "  9 | (:`2623`)-[r48709:worked_with]->(:`90013819`)    \n",
      " 10 | (:`15226`)-[r48710:worked_with]->(:`90013819`)   \n",
      "\n"
     ]
    }
   ],
   "source": [
    "# this will print all the reationships in the graph \n",
    "# ONLY RUN THIS IF YOU ARE USING THE SHORT RESULTS \n",
    "test = graph_db_test.cypher.execute(\"MATCH (n)-[r:worked_with]->(m) RETURN r LIMIT 10;\") \n",
    "print test\n",
    "test.to_subgraph()\n",
    "\n",
    "print test\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def recordlist_to_list(recordlist, record_property, len_of_recordlist = 1):\n",
    "    \"\"\"\n",
    "    Used to convert the result of a cypher query into a python list. \n",
    "    The Cypher Query should return a single property of the node as an alias, ie \n",
    "    graph_db.cypher.execute(\"MATCH (n) RETURN n.record_property AS record_property  \n",
    "    \n",
    "    Parameters\n",
    "    --------------------------------\n",
    "    recordlist: A RecordList object returned by a Cypher.execute command \n",
    "    record_property: The property that was returned by the Cypher.execute command as an alias \n",
    "    len_of_recordlist: the number of nodes returned by the Cypher.execute command. Defaluted to 1\n",
    "    \"\"\"\n",
    "    \n",
    "    count = 0\n",
    "    final_list = []\n",
    "    while count < len_of_recordlist:\n",
    "        command = \"recordlist[\" + str(count) + \"][0]\" +\"['\" + record_property +\"']\"      \n",
    "        final_list.append( eval(command))\n",
    "        count += 1 \n",
    "    return final_list"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "00.070 03-C-NE-PU\n",
      "90003312\n",
      "90022062\n",
      "90014540\n",
      "90027173\n"
     ]
    }
   ],
   "source": [
    "## Collect a collection of nodes to display\n",
    "# maybe i'll make this a subgraph later '\n",
    "\n",
    "# Get a award node (I picked a random Award number to seach for)\n",
    "# Notice that this Query return only the award number\n",
    "specific_award_node = graph_db.cypher.execute(\"MATCH (m {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN m;\")\n",
    "\n",
    "# Collect all the employees that worked on that award\n",
    "# Notice that this Query return only the employee id number \n",
    "associated_employees = graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN n;\") \n",
    "\n",
    "# Count number of employees that worked on that Awars ( this will be used below )\n",
    "num_associtated_employees = graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN COUNT(n);\") \n",
    "\n",
    "# Remember, all the queries above return RecordList objects, which is a little awkward to deal with. So i'm going to use \n",
    "# the function I created, record_to_list(),to convert the infomation I want into a python list \n",
    "\n",
    "# First, I convert the award node ( Note, because the award numbers are unique, I know there are only one of these)\n",
    "specific_award_node = recordlist_to_list(specific_award_node, 'uniqueawardnumber')\n",
    "\n",
    "# Next , I  need the number of Employees who worked on that project \n",
    "num_associtated_employees = graph_db.cypher.execute(\"MATCH (n:Employee) -[r:worked_on]->\\\n",
    "(a {uniqueawardnumber:'00.070 03-C-NE-PU'}) RETURN n;\").to_subgraph().order\n",
    "\n",
    "\n",
    "# Finally, I use the number of employees who worked on that node \n",
    "associated_employees = recordlist_to_list(associated_employees, \"employeeid\", num_associtated_employees)\n",
    "\n",
    "\n",
    "#print award node\n",
    "for item in specific_award_node:\n",
    "    print item\n",
    "\n",
    "#print associated_employees\n",
    "for item in associated_employees:\n",
    "    print item"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[u'00.070 03-C-NE-PU', None, u'90022062', u'90003312', u'90027173', u'90014540']\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAdkAAAFBCAYAAAA7ctUsAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3X98z/X+//H7ZrPtvV/M5uem/F7G0NFXqDSfimRJSqKE\nRIlImHBKp5yTH02oFYdqqdMvNPkRDtZQSUdsmE7aSfmRacx+/97z+8cyFop42my36+XyvsT79X69\nX4+91sVtr/f79XrPyRhjBAAALjnn8h4AAIDKisgCAGAJkQUAwBIiCwCAJUQWAABLiCwAAJYQWQAA\nLCGyAABYQmQBALCEyAIAYAmRBQDAEiILAIAlRBYAAEuILAAAlhBZAAAsIbIAAFhCZAEAsITIAgBg\nCZEFAMASIgsAgCVEFgAAS4gsAACWEFkAACwhsgAAWEJkAQCwhMgCAGAJkQUAwBIiCwCAJUQWAABL\niCwAAJYQWQAALCGyAABYQmQBALCEyAIAYAmRBQDAEiILAIAlRBYAAEtcynsAXB5Hjx5VTEyMkpOT\nlZuXp1p+frrhhht03XXXycnJqbzHA4BKyckYY8p7CNjzxRdfaObcufp09WpV69hRObVry7i4qHpG\nhly2blVgQIAiRo3S/fffLw8Pj/IeFwAqFSJbSRUXF2v0uHF64/33ldO7t0y3bpKPT9kHFRVJX38t\nz+XLVTcjQ5+tWaPAwMDyGRgAKiEiWwkZYzTokUe05D//Ufbf/nZmXM9cQS4ffCC/Tz/Vzq1bVa9e\nvcszKABUcrwnWwnNeeUVLdmyRdmRkZLD8ccrODmpsF8/HS8s1C09e2rX11/L2Zlz4gDgYvEvaQWw\nd+9ede3aVTVq1FCzZs0UExNTumzDhg0KDg6Wp6enunbtqp9++qnMuhEREfL395e/v78mTpyowsJC\nPf/ii8oeN05KT5eefFK6/XbpoYek7dtPrbhjh/Tww1J4uHTnndL48Srs3Fk/ZWZqw4YNmjBhgho2\nbCgfHx8FBgZq7NixKiwsLF192LBhCg4OVrVq1RQdHV1mpujoaLVv316+vr4KCgpSRESEioqK7Ow8\nAKjAiGw5KywsVK9evXTnnXcqNTVVCxYs0AMPPKB9+/YpJSVFd999t6ZNm6bU1FS1b99e9913X+m6\n8+fP1/Lly5WQkKCEhAStWLFCo0aNUkFAgNS0qfT881Lz5tLy5SVBnTpVSksrWfnqq6UXX5RWrJCW\nLSt5/MyZyuzZUzPmzdPDDz+sxMREpaena9u2bVq3bp0WLlxYuu22bdsqKipK11577RlnJ+fk5GjO\nnDk6duyYvvrqK23YsEGzZs26DHsTACoWXi4uZ99++61+/vlnjRkzRpIUFhamzp07a/HixQoMDFTr\n1q3Vp08fSdLUqVPl7++v7777Ts2bN1d0dLTGjRun+vXrS5LGjRunJ8aMUeaoUdKBA9K+fdKsWVL1\n6tJNN0lLl0pxcSVHrjVrnhqiuFhydpZq1ZJuuUWbFy2Sp6envLy8JJW8x+vs7FzmvdoRI0ZIktzd\n3c/4mh599NHSP9evX18DBgxQbGzspd1xAHAF4Ei2AiouLtbu3buVmJio0NDQ0vsdDoeaNm2qPXv2\nSJISExPVpk2b0uWhoaHKzMiQ2raV9u+X6teXTr8sp0mTkvtPSk4uebn49tulrVul8eMlDw+5t2ih\nvXv36sUXX5S3t7eCgoLUs2dP9erV6099PXFxcWrVqtWfWhcArmREtpy1aNFCtWvX1syZM1VQUKB1\n69Zp06ZNys7OVmZmpnx9fcs83sfHRxkZGZJ0xnIfHx/JGMnTU8rJKfnv6U7ef1KdOiUvF8fElAR4\n+nRJkvH0VFpamiZOnKiMjAxt375d7777rpYtW3bBX98bb7yhb775RuPGjbvgdQHgSkdky5mrq6ti\nYmK0atUq1atXT5GRkerbt68CAwPl5eWl9PT0Mo9PS0uTt7e3JJ2xPO3k+625uSVHsFlZZTeWmXn2\ns429vaVHH5W+/FLKypJTbq4cpz2uXbt2GjFihBYvXnxBX1tMTIwmTZqkTz/9VH5+fhe0LgBUBkS2\nAmjdurU+++wzpaSkaM2aNUpKSlKHDh0UEhKi+Pj40sdlZWUpKSlJISEhkqSQkBDt3LmzdHl8fLzc\nHQ7phx9KTmz6+eeyR65JSSX3n01RkeTkJDk7q2D/fjVs2LDM4oKCAnn+9sj4d6xZs0bDhg3TypUr\nS+cFgKqGyFYAu3btUm5urrKzszVr1iwlJydr0KBBuuuuu7R7924tW7ZMubm5eu6559S2bVs1b95c\nkjRw4EBFRkbq8OHDOnTokCIjI9UrPFyeq1dLQUElZwxHR0v5+dKmTSXxvemmko1u3lxyclRxsXTi\nhPTqq9L110s7dyqwTh19/vnnOnHihIwx2rZtm6KionT33XeXzlxQUKDc3FwVFxcrPz9fubm5Ovm5\nJhs3btSAAQO0bNkytW/f/rLvTwCoMAzK3fjx403NmjWNl5eX6dGjh0lKSipdtn79ehMcHGw8PDxM\nWFiY+fHHH8usO2HCBOPn52f8/PxMRESEOXHihHH38TFassTovfeM2rY1cnMzatjQ6KWXjGJjS25P\nPGFUr56Ru7tRQIBRz55Gn3xivDp1MosWLTLdu3c3fn5+xtvb27Rq1cosWrSozHa7dOlinJycjLOz\ns3FycjJOTk4mLi7OGGNMWFiYcXV1NV5eXqW3Hj162N+RAFDB8LGKldAjjz+ud5KSlBsRUfIS8Pna\ntk2+s2bp8P79Zd6TBQD8ObxcXAnNmTlTTVJS5Pr66yUvB5+PXbvkmD5dqz7+mMACwCXCkWwldezY\nMf3fHXfov25uyn3wwZL3Z88mPV1Oq1bJsXSpPn7vPd16662Xd1AAqMSIbCWWk5OjmS+9pLmvv658\nf39l3HqrVLeu5OoqpafLY+tWmc2b1eOOO/T8lClq2bJleY8MAJUKka0CCgsLtWrVKv3znXd0+MgR\nZWRm6uCBA5ry1FMaNnSoAgICyntEAKiUiGwVlJubK19fX2VlZcnFhY+vBgBbOPGpCnJ3d1ft2rV1\n8ODB8h4FACo1IltFNW7cWD/88EN5jwEAlRqRraIaNWqk//3vf+U9BgBUakS2imrcuDGRBQDLiGwV\nRWQBwD4iW0XxniwA2EdkqyjekwUA+4hsFVW3bl1lZmYqIyOjvEcBgEqLyFZRTk5OatSoES8ZA4BF\nRLYK431ZALCLyFZhvC8LAHYR2SqMy3gAwC4iW4URWQCwi8hWYbwnCwB28avuqrDMzEwFBAQoKytL\nzs78vAUAlxr/slZhXl5e8vHx0ZEjR8p7FAColIhsFcdLxgBgD5Gt4jj5CQDsIbJVHNfKAoA9RLaK\n40gWAOwhslVcVXxPtrCwUCkpKTp69Kjy8/PLexwAlRiRreKqypGsMUYbNmxQ99695e7pqcCmTXVV\ncLA8PD31lxtv1IcffkhwAVxyXCdbxRUVFcnhcCgtLU3u7u7lPY4VW7Zs0f2DB+uEk5Mye/aUbrlF\ncjhKFhYWSlu2yHvlSjkfPKi5M2dq4IMPlu/AACoNl/IeAOWrWrVqatiwofbv36/g4ODyHueS+/jj\njzVg6FDljB0rdeokOTmVfYCLi3Tzzcq4+WZp3z49NnGifjxwQH+dNKlc5gVQufByMSrt+7Kff/65\nHhg6VDl//7vUufOZgf2tZs2UPXeuXnztNf1z4cLLMySASo3IokJcxrN371517dpVNWrUULNmzRQT\nE1O6bMOGDQoODpanp6e6du2qn376qcy6ERER8vf3l7+/vyZOnCip5D3Y/kOGKLtBA2nKFKlnT2nU\nKGnv3lMrvvOO1KPHqVv37lLfvsp++mmNfuopvfXWW+rUqZM8PT0VFhZWZpubN2+Wt7d3mZuzs7M+\n/vhjSdL777+v4OBg+fr6yt/fX3fffbcOHz5sae8BqKh4T7YKM8YoLi5Ok8eO1YmjRxUYGKgafn7q\ndNttemjQINWoUeOyzFFYWKiWLVtqxIgRGj16tD777DOFh4drx44dqlmzppo0aaI33nhD4eHhmjJl\nijZv3qwvv/xSkjR//nzNnj1bGzdulCTdeuuteuKJJxQSEqJu/fopu1cv6f/+T6pZU1q1Slq4UHrv\nPcnD48xBoqOlhATppZfk+be/aXBIiLp06aK9e/dq48aNio2NPefXEBcXp/DwcCUnJ8vDw0MHDhyQ\nm5ubateuraysLA0fPlyFhYV6//33rexDABUTka2CCgsLNf/11/XqjBlySk3VkMxMNZVUXVKqpJUO\nhz4tLtY9ffpo/DPPqHnz5lbn2b17tzp27KiMjIzS+7p166YOHTooMDBQb7/9trZs2SJJys7Olr+/\nv3bu3KnmzZurU6dOGjJkiIYOHSpJevPNN7VgwQLVbthQKwICZO65p+zGevaUZs+WmjUre78x0oAB\n0qBB0m23STt2qOH8+dq/d68WLVqkd99993cjO3jwYDk7O2vRokVnLMvMzNTjjz8uPz8/zZ49+8/t\nJABXJE58Oo0xRomJiTp69KgKCwvl5+enVq1ayc3NrbxHu2QyMzN1X3i4srdt02vZ2bpJ0m/fqeyf\nna1kSQvef183LF+u95cvV9euXS/rnMXFxdq9e7fS09MVGhpaer/D4VDTpk21Z88eNW/eXImJiWrT\npk3p8tDQUO3Zs0ffxMfLvPde2Sf9/nupoEBq0ODMDSYkSCdOSDfdVPL3tm2VkpampKSkP5w1KytL\nS5cu1cqVK8vcv2XLFvXs2VPp6enq0qWL/vnPf57/DgBQKfCerKS0tDTNnTtXDVu0UIfu3dV7/Hjd\nO3myuvbvr4DAQI2LiND+/fvLe8yLVlBQoN7duingyy+1LjtbXXRmYE+qI+mvRUX6MDNT/cLD9cUX\nX1ibq0WLFqpdu7ZmzpypgoICrVu3Tps2bVJ2drYyMzPl6+tb5vE+Pj6lR72/Xe7j46PMzEwVFRVJ\np6+XlSX9/e8lR6onL9853dq1Upcu0snLmJyc5Orvr5SUlD+cf9myZQoICNBNJwP9qxtuuEEnTpzQ\nwYMH5erqqvHjx5/fDgFQaVT5I9not9/WY088IafrrlP2yJFS69Zlz0I9cEDzVq7Uq+3aadDAgXol\nMlLVqlUrv4EvwnOTJ6v6jh1amJd33t/4myVFZ2erT48e+v7QIXl6el7yuVxdXRUTE6NRo0Zp+vTp\nat++vfr27Ss3Nzd5eXkpPT29zOPT0tLk5eWltLQ0ORwOxcXFKSEhQcnJydqxY4dcXFxUWFx8aoW8\nPGnSJCkkRLr//jMHyM2VNm2SXnih7P1OTio+/XnOITo6WgMHDjzn8vr16+v5559X9+7dNWfOnD98\nPgCVR5WO7KzZs/XsSy8p5+WXpauvPvuDgoKU/9hj0oMP6u3nntOBvn21/MMPr7jQ5uTkaP5rr+nL\nnJwL/qbfLqlDYaH+9e67emTYMBvjqXXr1oqNjVVqaqqSk5N17733qlOnTjpy5Ig+//xz5eXlKTk5\nWYcPH9aePXvUr18/ubm5qbCwUNOnT1doaKjq1Kmjo7+ewPXjgQMyWVmSq2vJ2cV16khPPXX2jW/e\nLPn4SG3bnrrPGBUeP65atWrJ6Xcu/Tlw4IDi4uL+8KXggoICOc52BA2gUquykV2yZImemT5dOXPn\nSrVr//EKXl7KnjZNsZMmadRTTynq5ZftD3kJffTRR/qLpKZ/cv0RWVmKmDFDQx955Hej81tFRUU6\nduyYkpOTz7gdPXq09M8HDx7U8ePH5XA4VL16dWVmZqpFixaqUaOGUlJS5OLiooEDB2r58uWSSi6h\ncTgcmj9/vubMmaNXXnlFxhjddtttmjhxoj745BNt3LBB2rq15CXgiIhzD7luXcnJTqf79ls5nJ0V\nGBiogoICFRcXKy8vT87OznJ1dS192OLFi9W5c2c1atSozOr/+te/dOONNyooKEg//vijJk+erD59\n+pz3fgNQSZgrQGJiogkLCzO+vr6madOm5uOPPy5dtn79etOiRQvjcDhMWFiY+fHHH8usO2HCBFOr\nVi1Tq1YtExERYYwxpqioyNS56iqj224zatTIqFo1o0GDjGJjz37r3t3Iycno3XeNVqww7jVqmD59\n+pjq1asbLy8v4+XlZby9vU1xcfEZs0dHRxsnJyezcOHCMvdHRkaaunXrGh8fHzNkyBCTl5dnYc+d\n0qVdO/NxyTm0f+pWJJkmnp5m+/btpqCgwBw+fNjs2LHDrFmzxkRHR5sZM2aYp556yjzwwAPm1ltv\nNaGhoaZOnTrGxcXF1KpVy7Rs2dKEhYWZfv36mdGjR5tp06aZhQsXmhUrVpht27aZ4cOHm5o1axov\nLy/To0cPk5SUVDr7+vXrTXBwsPHw8Djn99jPz8/4+fmVfo/Xrl1rPIKCSr5v7u5GHh6nbnPnnvre\nfvihkYtLyff2tO+5x+23m3vuvdc4OTmVuQ0ePLjMtoODg80bb7xxxv6ePHmyCQwMNJ6enubqq682\nERERJicnx8J3FkBFVuEv4bFxDeVVV12le598Upl33VVy/eQnn5Rc0vHQQ2cOsGuXtGhRyX8XL5bq\n11f1V19V8//+V73vukt/+9vfzjl7amqqOnbsqOrVq2vMmDEaMmSIJGnt2rV66KGHFBsbq3r16ql3\n7966/vrr9Y9//OPS78BfXeXvr7hjx3T1RTzHrc7O+srTUzk5OfLz81OdOnX+8BYQEFDmyO9yKS4u\nVmDTpvp51CipXbsLW/mXX+Q+dKgOJCXJ39/fzoAAqoQK/3Lxt99+q59//lljxoyRJIWFhalz585a\nvHixAgMD1bp169KX4aZOnSp/f3999913at68uaKjozVu3DjVr19fkjRu3DgtWLBAHn5+JR8U361b\nyUbWrz/7xouKpHnzpIkTpV+vw5Sk/PBw/XfFChUUFPzu7E8//bRGjx6tDz/8UKf/LBMdHa2hQ4fq\nmmuukSQ988wz6t+//1kjW1RUpOzs7NJbVlbWOf/+e8tSUlN1sacsBbi7a9q0aRoxYkSFf0/a2dlZ\n/5w3T/cOHqyc2bPPftnO2WRlyTFlip6eOJHAArhoFT6yZ3Ox11DmFxdLw4f/8YY++khq00Zq3Ljs\n/Q0bStWr67XXXtP8+fMVFBSkRx99VDfddFNp3Hbs2KH169erY8eOOnTokNatW6fDhw8rOztb//73\nvxUaGqr+/fsrKytLJ06c0JEjR9S6dWvl5eWVCeXJE2ZO3jw9Pc/595N/rlGjhurXr19m2TdxcUpP\nS1PARez3LBcXBQUFVfjAnnTHHXdo9gsv6MmxY5Uzdar06w8155ScLMdf/6oHunXT5F8/nhEALkaF\nj+zp11COGTNGsbGx2rRpk8LCwpSZmamAgLLZOJ9rKOXsLHl7//6Gjx6VVq6UFiw46+KCGjWUduCA\nHA6H9u/fr8cff1xXXXWV/P395eHhoYSEBF177bXasGFDaUjz8/Pl4+MjqST41113nRwOh9zc3LR5\n82ZNnz5dTZo0KRNHNze3CzrR6Fz+2aaNNm/apCZ/cv18SdsKCjSzZcuLnuVyGj5smGoHBOihRx6R\nadq05BWMjh2lkz8oGCPt2iXHihUq3rZNkydN0tMTJlySfQ4AFT6yf+YaSu9fA/rb5Sevr8zMypKK\ni0/9Q3s2r7wiDRxY8sEFJ1/qPe0lX18/Py1fvFhdunSRJD322GPy9PTUrFmzNG/ePDVr1qz0I/bC\nwsLUt29fPfzww5KkDz74QJ07d9Y9v37k38kPPOjYsaNq1qx5EXvr3IaPG6cXduzQoNM+uvBCfCzp\nmpAQ6x+xaEPv3r3Vo0cPLVmyRC/Onat9s2bJzd9fcnZWQWqqavr6atzIkRr80UeX7fOaAVQNFT6y\nUsk1lJ999lnp3zt16qTBgwdLKnl/86SsrCwlJSUpJCREkhQSEqKdO3eqffv2kqT4+Hi1atVKu7/7\nThm//CLVrXvuje7YIe3eLc2ff+q+kSNLfpNLWJgKf/lFtc9x6c/GjRsVFxen1atXS5KOHz+uHTt2\nKD4+XnPnzi2d62Rk4+PjVadOHWuBlaQePXpopJub/pORofZ/Yv0ob2+N+r3LYCo4Nzc3DRgwQAMG\nDNCRI0eUkpKioqIi1axZU0FBQRy5ArCjnM9uPi8JCQkmJyfHZGVlmZkzZ5rGjRub/Px8c/ToUePr\n62uWLl1qcnJyzPjx403Hjh1L13v99dfNNddcYw4dOmQOHjxoWrZsaebPn28GDx9uXAYPNlq/3mjt\nWqOuXY0efLDkzxs2lFzGERNjtGxZyW3p0pJLQaKiSh4TGWn8GzQw6enppqioyKxdu9Z4e3ubuLg4\nY4wxJ06cMMnJySY5OdkcOXLEdOrUycyePdukp6cbY4xZs2aNqVu3rklMTDTHjx83Xbp0MU8//bT1\n/fjKnDmmncNhMi7w8p0oZ2fTIijI5OfnW58RACqTKyKy48ePv6TXUCYkJBiP2rWNbr21JJ6n3yZO\nPPu1ss7OpddSeoaFmSZNmhhfX1/j4+Nj2rZtaz744INzzn/zzTebRYsWlbkvMjLS1KlTp/Q62csR\nsOLiYjP0gQdMF4fDHD/PwC5ycjJ1fX3N999/b30+AKhsKvx1srZc27mzdl5/vUx4+IWt+L//yTF2\nrI4cOFD63u+VpKioSE+NHKmVixfrqawsPSDpt1+FkfSlpHkeHtrm66vVn32mFi1aXP5hAeAKV2Uj\nm5iYqA5duihzwgTpuuvOb6UjR+Tx5JNa+NJL6t+/v90BLdu4caNenTFDsXFx6iOpcW6u3CQdd3LS\nSk9PZXl767GxYzVk6FBOBgKAP6nKRlYq+X2ft/furawHH5Tp0UNyOcd5YMZIO3bIY/p0/X3KFI0Z\nNeryDmrRwYMH9dFHH2nn9u3asG6dHhkxQh07ddItt9wiZ2d+EyIAXIwqHVmp5Ij2wWHDtPe775Tf\no4eKunUr+YUBTk5SRoYUFyevlSvlXVSkqJde0l133VXeI1uxfft2DRs2TNu3by/vUQCg0rgiLuGx\nqWXLltq+ZYt2796tl6Oi9NHo0co8flzGGLl5eemGLl0UERWlrl27VuojO2dn5/P63akAgPNX5Y9k\nz6a4uFjGmCvm4wMvhfj4eA0cOFDx8fHlPQoAVBpV/kj2bCrzEeu5cCQLAJde1asJzorIAsClR2Qh\nicgCgA1EFpKILADYQGQhicgCgA1EFpKILADYQGQhicgCgA1EFpKILADYQGQhicgCgA1EFpKILADY\nQGQhicgCgA1EFpKILADYQGQhicgCgA1EFpKILADYQGQhicgCgA1EFpKILADYQGQhicgCgA1EFpKI\nLADYQGQhicgCgA1EFpKILADYQGQhicgCgA1EFpKILADYQGQhicgCgA0u5T0AypcxRps3b9aePXsk\nSfPmzVOTJk102223ycWF/z0A4GI4GWNMeQ+Byy8tLU3R0dGa+corOlFcrKJWrZTj4iL3oiK5/vCD\nXH/5RSOHD9ejjzyievXqlfe4AHBFIrJV0Pbt23VbeLhyW7ZUdni4FBoqOTmVfVBSktxXrpRzXJw+\nePtt9ezZs3yGBYArGJGtYr7++muF3X67skaPlm688Y9XSEyUx9SpejsqSvfcc4/9AQGgEiGyVcjR\no0fVIjRUJ0aOlG644fxX3LdPjokT9cXGjWrTpo29AQGgkuHs4gps79696tq1q2rUqKFmzZopJiam\ndNmGDRsUHBwsT09Pde3aVT/99FOZdSMiIuTv7y9/f39NnDhRkvTq668rp00bKTZWuvdeqWdPadQo\nae/eUyt++WXJfeHhUp8+0qxZUmCgcu67T8+9+KLy8vI0ZMgQ+fr6ql69epo9e3aZ7RYVFWnKlClq\n0KCBfHx8dO211yo9PV2SFB0drfbt28vX11dBQUGKiIhQUVGRpb0HAOWPyFZQhYWF6tWrl+68806l\npqZqwYIFeuCBB7Rv3z6lpKTo7rvv1rRp05Samqr27dvrvvvuK113/vz5Wr58uRISEpSQkKAVK1Yo\nKipK815/XXk33yxdc400f760YoXUrZv09NNSbm7JytnZ0sCB0tKlUnS0lJIivf66zO2369PVqzV+\n/HglJSXpp59+UmxsrGbMmKG1a9eWbvvZZ5/V1q1btXXrVqWnp+udd96Rm5ubJCknJ0dz5szRsWPH\n9NVXX2nDhg2aNWvW5dytAHBZ8XJxBbV792517NhRGRkZpfd169ZNHTp0UGBgoN5++21t2bJFkpSd\nnS1/f3/t3LlTzZs3V6dOnTRkyBANHTpUkvTmm2/qxRdf1M8eHsp4+eUzN9azpzR7ttSs2ZnLNm+W\n3npLWrRIHi+9JJdNm7Rs6VLdcsstkkqi+t133+m9995TamqqGjZsqISEBDVq1OgPv8bZs2crNjZW\nn3zyyYXvIAC4AnAkewUpLi7W7t27lZiYqNDQ0NL7HQ6HmjZtWnqta2JiYpn3TkNDQ7V//35lnO39\n1O+/lwoKpAYNzr7R+Hjp6qslSTnBwcpITz/juU9ud9euXXJxcdFHH32kevXqqUWLFoqKijrn1xMX\nF6dWrVqd75cPAFccIltBtWjRQrVr19bMmTNVUFCgdevWadOmTcrOzlZmZqZ8fX3LPN7Hx6f0qPe3\ny318fJSfny95e5fdSFaW9Pe/S4MGSQ7HmUP85z/SunXSkCElf//1wyl++9wnt3vw4EGlpaVp3759\n2r9/v5YsWaKpU6dq/fr1Zzz1G2+8oW+++Ubjxo270F0DAFcMIltBubq6KiYmRqtWrVK9evUUGRmp\nvn37KjAwUF5eXqUnE52UlpYm718j+tvlaWlpql69upSXd2qFvDxp0iQpJES6//4zB0hMlKZNk557\n7oyj3N8+98ntenh4SJKeeeYZubm5qXXr1urXr59Wr15dZv2YmBhNmjRJn376qfz8/C585wDAFYLI\nVmCtW7fWZ599ppSUFK1Zs0ZJSUnq0KGDQkJCFB8fX/q4rKwsJSUlKSQkRJIUEhKinTt3li6Pj49X\ngwYN5HHwYMkd+fnSlClSnTrSU0+dueF9+0qWR0RI7dqV3u2ckiKHp+cZz33yJd/TX8I+ndNpH3Sx\nZs0aDRuEa/C4AAAIF0lEQVQ2TCtXriydFwAqKyJbge3atUu5ubnKzs7WrFmzlJycrEGDBumuu+7S\n7t27tWzZMuXm5uq5555T27Zt1bx5c0nSwIEDFRkZqcOHD+vQoUOKjIzUiBEjVPz559Lx49LUqZK7\ne0lEf+uHH0ruf+IJ6frrT91fVCSPNWt07z336IUXXtCJEye0d+9eLVy4UIMGDZIkNWnSRDfeeKOm\nTZum/Px87d27Vx988EHpp0Vt3LhRAwYM0LJly9S+fXvLew8AKgCDCmv8+PGmZs2axsvLy/To0cMk\nJSWVLlu/fr0JDg42Hh4eJiwszPz4449l1p0wYYLx8/Mzfn5+JiIiwhhjTO9+/Yx69TJycjJydzfy\n8Dh1mzvXKDbWqHt3I2fnsssaNTL6xz9Mi3btTF5enhkyZIjx8fExderUMbNnzy6z3UOHDpnu3bsb\nLy8v07hxY7NgwYLSZWFhYcbV1dV4eXmV3nr06GFxDwJA+eISnirkq6++UtdevZT96qtSrVrnv2Ju\nrjzHjlXUxIkaOHCgvQEBoJLh5eIqpEOHDhr/+ONyTJ4spaae30p5efJ4/nnd3q6dHnzwQbsDAkAl\nQ2SrmGenTNHIPn3kGD265CMUz/WxhsZIu3bJMW6cugcF6d033yxzAhMA4I/xcnEVtWTJEv31H//Q\nT0eOKPeOO1TcurXk6Snl5Ejffy+v1avlXViop598Uo+PGCFnZ34eA4ALRWSruK+//lovR0Vp5549\nysjIkMPhULPGjTV6+HB17dqVuALARSCyAABYwmEKAACWEFkAACwhsgAAWEJkAQCwhMgCAGAJkQUA\nwBIiCwCAJUQWAABLiCwAAJYQWQAALCGyAABYQmQBALCEyAIAYAmRBQDAEiILAIAlRBYAAEuILAAA\nlhBZAAAsIbIAAFhCZAEAsITIAgBgCZEFAMASIgsAgCVEFgAAS4gsAACWEFkAACwhsgAAWEJkAQCw\nhMgCAGAJkQUAwBIiCwCAJUQWAABLiCwAAJYQWQAALCGyAABYQmQBALCEyAIAYAmRBQDAEiILAIAl\nRBYAAEuILAAAlhBZAAAsIbIAAFhCZAEAsITIAgBgCZEFAMASIgsAgCVEFgAAS4gsAACWEFkAACwh\nsgAAWEJkAQCwhMgCAGAJkQUAwBIiCwCAJUQWAABLiCwAAJYQWQAALCGyAABYQmQBALCEyAIAYAmR\nBQDAEiILAIAlRBYAAEuILAAAlhBZAAAsIbIAAFhCZAEAsITIAgBgCZEFAMASIgsAgCVEFgAAS4gs\nAACWEFkAACwhsgAAWEJkAQCwhMgCAGAJkQUAwBIiCwCAJUQWAABLiCwAAJYQWQAALCGyAABYQmQB\nALCEyAIAYAmRBQDAEiILAIAlRBYAAEuILAAAlhBZAAAsIbIAAFhCZAEAsITIAgBgCZEFAMASIgsA\ngCVEFgAAS4gsAKDcGGNkjCnvMawhsgCAy6a4uFj//ve/deudd8qzZk1Vc3GRq7u7ajVooFFPPql9\n+/aV94iXlJOpzD9CAAAqjKVLl+qJCROU7uKizDvukG64QfL1lYqKpCNH5LpmjaqtXatr27XT2/Pn\nq0mTJuU98kUjsgAA62ZGRurZGTOUM3Gi1KaN5OR09gfm58t5+XJ5L1miDatX6y9/+cvlHfQSI7IA\nAKvefOstjZw8WdmzZ0u1a5/fSps2yTcqSt988YUaN25sd0CLiCwAwJpjx44psHFj5c6dK1111QWt\n6/zhh+qclKRNa9dams4+TnwCAFjzxptvyqljxwsOrCQV9+qlr7/+WklJSRYmuzyILADAiuLiYkW+\n+qpywsP/3BO4uamoWzfNe+21SzvYZURkAQBW7Ny5U5mS1LLln36Ogm7d9O4HH1yymS43IgsAsOLo\n0aOqVrfuuc8kPh916igtJeXSDXWZEVkAgBUFBQVStWoX9yTVqqmosPDSDFQOiCwAwAo/Pz+ZtLSL\ne5K0NHn6+l6agcoBkQUAWNG2bVsVHjwoJSf/6edw2rJFN91886Ub6jIjsgAAKzw9PfXAgAFyWbXq\nzz2BMfJcuVLjR426tINdRkQWAGDNmMcfl+unn0o5ORe+8vbt8nN11U033XTpB7tMiCwAwJprrrlG\nvcPD5TFtWskvAjhfP/8sj5kz9eqsWXK6mLOTyxmRBQBY9db8+fp/np5yPPvs+R3R/u9/8hg7VtOf\neUY9e/a0P6BFfHYxAMC6goICDX70US1bvlyF3buroGdPqW7dUw8wRkpIkGPFCpmvv9bC115T//79\ny2/gS4TIAgAum//+97+aExWl6Lfflkv9+nLy8ZEKC1WUnKwa7u4aP3KkHnroIflewZftnI7IAgAu\nu6ysLO3atUupqamqXr26AgIC1Lp16yv6/dezIbIAAFjCiU8AAFhCZAEAsITIAgBgCZEFAMASIgsA\ngCVEFgAAS4gsAACWEFkAACwhsgAAWEJkAQCwhMgCAGAJkQUAwBIiCwCAJUQWAABLiCwAAJYQWQAA\nLCGyAABYQmQBALCEyAIAYAmRBQDAEiILAIAlRBYAAEuILAAAlhBZAAAsIbIAAFhCZAEAsITIAgBg\nCZEFAMASIgsAgCVEFgAAS4gsAACWEFkAACwhsgAAWEJkAQCwhMgCAGAJkQUAwBIiCwCAJUQWAABL\niCwAAJYQWQAALCGyAABYQmQBALCEyAIAYAmRBQDAEiILAIAlRBYAAEuILAAAlhBZAAAsIbIAAFhC\nZAEAsITIAgBgCZEFAMASIgsAgCVEFgAAS4gsAACW/H8z1R6HfQQxsgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f503ceec710>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Creating Networks Objects \n",
    "\n",
    "#Imports that should really be at the top of the notebook \n",
    "import networkx as nx\n",
    "# Allows plots to be showed inline \n",
    "%matplotlib inline\n",
    "# Matplotlib is the default package for\n",
    "# rendering the graphs\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "# Create the Networkx Graph \n",
    "G=nx.Graph()\n",
    "\n",
    "# Distonarys to contain colors and labels\n",
    "# Not nessasary\n",
    "custom_node_color = {}\n",
    "custom_labels     = {}\n",
    "\n",
    "#Create the networkx award node \n",
    "award_node = G.add_node(specific_award_node[0])\n",
    "custom_node_color[specific_award_node[0]] = 'r'\n",
    "\n",
    "#Create networkx nodes for the employees that worked on that node \n",
    "for item in associated_employees:\n",
    "    G.add_node(item)\n",
    "    custom_node_color[item] = 'c'\n",
    "    custom_labels[item] = str(item)\n",
    "    # We know at each of these employees are connected to the award, so lets draw those relationshipd \n",
    "    # Note, in Networkx relationships are called edges \n",
    "    G.add_edge(item, award_node)\n",
    "    \n",
    "\n",
    "print G.nodes()\n",
    "nx.draw(G,labels=custom_labels, node_color=custom_node_color.values())\n",
    "plt.show()\n",
    "\n",
    "\n",
    "# Idk why we always get a bonus None node, i like to thnk of it as a gift "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "import igraph;print igraph.__version__\n",
    "\n",
    "igraph.plot([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "cursor.close()\n",
    "\n",
    "# close connection\n",
    "db.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
