{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Networks and Neo4j\n",
    "\n",
    "This chapter will go over the basics on how to connect to a neo4j database, query the database, and analyse data.  \n",
    "\n",
    "Before you begin this lesson,\n",
    "\n",
    "* Read though the Instalation Guide \n",
    "* Start you neo4j server (You should be able to over console in the browser.)\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Programing\\Anaconda\\lib\\site-packages\\pandas\\computation\\__init__.py:19: UserWarning: The installed version of numexpr 2.4.4 is not supported in pandas and will be not be used\n",
      "\n",
      "  UserWarning)\n"
     ]
    }
   ],
   "source": [
    "# Imports \n",
    "import sys\n",
    "\n",
    "#from py2neo import authenticate, neo4j, Graph, Relationship\n",
    "from py2neo import authenticate, Graph, Relationship\n",
    "#from py2neo.cypher import CypherWriter\n",
    "#from py2neo import cypher\n",
    "#import MySQLdb\n",
    "import pymysql\n",
    "import numpy\n",
    "import pprint\n",
    "import pandas\n",
    "\n",
    "import networkx\n",
    "# Allows plots to be showed inline \n",
    "import matplotlib\n",
    "%matplotlib inline\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true
   },
   "source": [
    "### Connecting to the Neo4j Database \n",
    "\n",
    "To connect to the Neo4j Database we will be using the py2neo modual.\n",
    "\n",
    "In the cell below we will begin by creating a connection via py2neo. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Graph uri=u'http://localhost:7474/db/data/'>\n"
     ]
    }
   ],
   "source": [
    "# Set up connection to Ne04j local Database \n",
    "# You will need to authenticate your connection, use the next line as an example \n",
    "# authenticate(\"localhost:7474\", \"<YOUR USENAME HERE>, Default is: neo4j\", \"<YOUR_PASSWORD_HERE>\")\n",
    "\n",
    "database_host = \"localhost\"\n",
    "database_port = \"7474\"\n",
    "database_username = \"neo4j\"\n",
    "#database_password = \"<YOUR_PASSWORD_HERE>\"\n",
    "database_password = \"upintheA1R!!\"\n",
    "\n",
    "# set up authentication parameters\n",
    "authenticate( database_host + \":\" + database_port, database_username, database_password )\n",
    "\n",
    "# Create a variable for our graph and print our connection infomation\n",
    "graph_db = Graph()\n",
    "print( graph_db )\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Testing our connection\n",
    "To extract data from our database, we can pass cypher commands to py2neo using the Graph object instance's `data()` command.\n",
    "\n",
    "Run the cell below to tell py2neo to return a single node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'n': (c4bd3d9:Employee {employeeid:\"90014540\",position:\"FACULTY\"})}]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# The syntax below translates to,\n",
    "#'Match (Find) any node, lets call it n, and show me its data. Limit the results to 1'\n",
    "\n",
    "graph_db.data( \"MATCH (n) RETURN n limit 1\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Quick Review of Neo4j and Cypher \n",
    "\n",
    "When you think of data, you probably imagine an excel table where each row is an individual observation or data point. \n",
    "For example, \n",
    "\n",
    "|name | age | employee_id|\n",
    "|-----|-----|------------|\n",
    "|Joe  |  34 |   12345    |\n",
    "|Ann  |  54 |   12346    |\n",
    "    \n",
    "In a graph database, that row is more like a ball. \n",
    "\n",
    "\n",
    "##### (node: Employee {name:Joe, age: 34, employee_id: 12345})\n",
    "\n",
    "This ball is called a \"node\" in Neo4j. In fact, the little parentheses around Joe's information are designed to help the user think of Joe's information as a little ball. \n",
    "\n",
    "All the information about Joe is still there, but it's just not in a flat table format. Instead of storing each peice of Joe's information in a variable column, Joe's information is stored as **properties**, ie name, age, employee_id.\n",
    "Joe's node also has a **label**, *Employee*, to identify this node as belonging to an employee.\n",
    "\n",
    "Neo4j uses the Cypher Query Language to get information out of the Database. \n",
    "\n",
    "##### Components of a simple Cypher Query:\n",
    "+ MATCH      \n",
    "     - Essentially the same thing as SELECT in SQL \n",
    "+ (n)        \n",
    "    - Any node (the n is just a variable, could be any letter) \n",
    "+ RETURN     \n",
    "    - Needed in every query \n",
    "+ LIMIT      \n",
    "    - Same as in SQL \n",
    "\n",
    "The following query will return 20 nodes from the database:  \n",
    "##### graph_db.cypher.execute(\"MATCH (n) RETURN n LIMIT 20\")\n",
    "\n",
    "If I wanted to query just Award nodes, I would run this query;  \n",
    "##### graph_db.cypher.execute(\"MATCH (n:Award) RETURN n LIMIT 20\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{u'n.award_num': u'aw1000'},\n",
       " {u'n.award_num': u'aw1001'},\n",
       " {u'n.award_num': u'aw1002'},\n",
       " {u'n.award_num': u'aw1003'},\n",
       " {u'n.award_num': u'aw1004'},\n",
       " {u'n.award_num': u'aw1005'},\n",
       " {u'n.award_num': u'aw1006'},\n",
       " {u'n.award_num': u'aw1007'},\n",
       " {u'n.award_num': u'aw1008'},\n",
       " {u'n.award_num': u'aw1009'},\n",
       " {u'n.award_num': u'aw1010'},\n",
       " {u'n.award_num': u'aw1011'},\n",
       " {u'n.award_num': u'aw1012'},\n",
       " {u'n.award_num': u'aw1013'},\n",
       " {u'n.award_num': u'aw1014'},\n",
       " {u'n.award_num': u'aw1015'},\n",
       " {u'n.award_num': u'aw1016'},\n",
       " {u'n.award_num': u'aw1017'},\n",
       " {u'n.award_num': u'aw1018'},\n",
       " {u'n.award_num': u'aw1019'}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# You can use this cell to Test the Cypher Queries \n",
    "# The syntax below translates to, \n",
    "#'Match (Find) any nodes that are of type Award and show me the award number (award_num) data for each\n",
    "# of the nodes returned. Limit the results to 20'\n",
    "graph_db.data( \"MATCH (n:Award) RETURN n.award_num LIMIT 20\" )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cypher Examples \n",
    "\n",
    "The below are some examples of different cypher commands executed using py2neo.\n",
    "\n",
    "Note: The object returned by Py2neo is a neted list of dictonaries where each dictonary represents a single node."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{u'e.employeeid': u'90014540'},\n",
      " {u'e.employeeid': u'90026679'},\n",
      " {u'e.employeeid': u'90017693'},\n",
      " {u'e.employeeid': u'90028696'},\n",
      " {u'e.employeeid': u'90013819'},\n",
      " {u'e.employeeid': u'90001118'},\n",
      " {u'e.employeeid': u'90001300'},\n",
      " {u'e.employeeid': u'90023086'},\n",
      " {u'e.employeeid': u'90017074'},\n",
      " {u'e.employeeid': u'90025003'},\n",
      " {u'e.employeeid': u'90000321'},\n",
      " {u'e.employeeid': u'90001779'},\n",
      " {u'e.employeeid': u'90012327'},\n",
      " {u'e.employeeid': u'6663'},\n",
      " {u'e.employeeid': u'90028695'},\n",
      " {u'e.employeeid': u'90013011'},\n",
      " {u'e.employeeid': u'90004139'},\n",
      " {u'e.employeeid': u'90002533'},\n",
      " {u'e.employeeid': u'90022882'},\n",
      " {u'e.employeeid': u'90027179'}]\n"
     ]
    }
   ],
   "source": [
    "# Collect 20 Employee Nodes \n",
    "\n",
    "# The syntax below translates to, \n",
    "#'Match(Find) any nodes of type Employee \n",
    "# then show me the employee ID (employeeid) of the employee nodes. Limit the results to 20'\n",
    "node_query_single =  graph_db.data( \"MATCH (e:Employee) RETURN e.employeeid LIMIT 20\" )\n",
    "\n",
    "pprint.pprint( node_query_single )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{u'a.award_num': u'aw1000', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1001', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1002', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1003', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1004', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1005', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1006', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1007', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1008', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1009', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1010', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1011', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1012', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1013', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1014', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1015', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1016', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1017', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1018', u'e.employeeid': u'90014540'},\n",
      " {u'a.award_num': u'aw1019', u'e.employeeid': u'90014540'}]\n"
     ]
    }
   ],
   "source": [
    "# Collect 20 Award Nodes and 20 employee Nodes \n",
    "\n",
    "# The syntax below translates to, \n",
    "#'Match (Find) any nodes that are of type Award and Match(Find) any nodes of type Employee \n",
    "# then show me the award number (award_num) of the award nodes \n",
    "# and the employee ID (employeeid) of the employee nodes. Limit the results to 20'\n",
    "node_query_multiple =  graph_db.data(\"MATCH (a:Award), (e:Employee) RETURN a.award_num,e.employeeid LIMIT 20\" )\n",
    "\n",
    "pprint.pprint(node_query_multiple )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{u'a.award_num': u'aw1000',\n",
      "  u'e.employeeid': u'90014540',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1001',\n",
      "  u'e.employeeid': u'90026679',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1002',\n",
      "  u'e.employeeid': u'90017693',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1003',\n",
      "  u'e.employeeid': u'90028696',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1004',\n",
      "  u'e.employeeid': u'90013819',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1005',\n",
      "  u'e.employeeid': u'90001118',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1006',\n",
      "  u'e.employeeid': u'90001300',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e.employeeid': u'90023086',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1476',\n",
      "  u'e.employeeid': u'90023086',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1145',\n",
      "  u'e.employeeid': u'90023086',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1008',\n",
      "  u'e.employeeid': u'90017074',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1477',\n",
      "  u'e.employeeid': u'90017074',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1146',\n",
      "  u'e.employeeid': u'90017074',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1009',\n",
      "  u'e.employeeid': u'90025003',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1147',\n",
      "  u'e.employeeid': u'90025003',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1478',\n",
      "  u'e.employeeid': u'90025003',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1010',\n",
      "  u'e.employeeid': u'90000321',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1148',\n",
      "  u'e.employeeid': u'90000321',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1479',\n",
      "  u'e.employeeid': u'90000321',\n",
      "  u'type(r)': u'WORKED_ON'},\n",
      " {u'a.award_num': u'aw1011',\n",
      "  u'e.employeeid': u'90001779',\n",
      "  u'type(r)': u'WORKED_ON'}]\n"
     ]
    }
   ],
   "source": [
    "# Return 20 relationshipswhere an Employee worked on an Award\n",
    "\n",
    "# The syntax below translates to, \n",
    "#'Match (Find) any instances of a node of type Award is conneted to a node of type employee. \n",
    "# For each relationship found, return the award number and the employee id of the nodes in that relationship. \n",
    "# also return the relationship type, 'WORKED_ON'\n",
    "#Limit the results to 20'\n",
    "relationsip_query = graph_db.data(\"MATCH (a:Award) <-[r:WORKED_ON]- (e:Employee) RETURN a.award_num,e.employeeid,type(r) LIMIT 20\")\n",
    "\n",
    "pprint.pprint( relationsip_query )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{u'a.award_num': u'aw1003',\n",
      "  u'e1.employeeid': u'90000919',\n",
      "  u'e2.employeeid': u'90028696'},\n",
      " {u'a.award_num': u'aw1003',\n",
      "  u'e1.employeeid': u'90028696',\n",
      "  u'e2.employeeid': u'90000919'},\n",
      " {u'a.award_num': u'aw1004',\n",
      "  u'e1.employeeid': u'90024693',\n",
      "  u'e2.employeeid': u'90013819'},\n",
      " {u'a.award_num': u'aw1004',\n",
      "  u'e1.employeeid': u'90013819',\n",
      "  u'e2.employeeid': u'90024693'},\n",
      " {u'a.award_num': u'aw1005',\n",
      "  u'e1.employeeid': u'90001652',\n",
      "  u'e2.employeeid': u'90001118'},\n",
      " {u'a.award_num': u'aw1005',\n",
      "  u'e1.employeeid': u'90001118',\n",
      "  u'e2.employeeid': u'90001652'},\n",
      " {u'a.award_num': u'aw1006',\n",
      "  u'e1.employeeid': u'90025754',\n",
      "  u'e2.employeeid': u'90001300'},\n",
      " {u'a.award_num': u'aw1006',\n",
      "  u'e1.employeeid': u'90001300',\n",
      "  u'e2.employeeid': u'90025754'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90026898',\n",
      "  u'e2.employeeid': u'90023086'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90004472',\n",
      "  u'e2.employeeid': u'90023086'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90022371',\n",
      "  u'e2.employeeid': u'90023086'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90023086',\n",
      "  u'e2.employeeid': u'90026898'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90004472',\n",
      "  u'e2.employeeid': u'90026898'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90022371',\n",
      "  u'e2.employeeid': u'90026898'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90023086',\n",
      "  u'e2.employeeid': u'90004472'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90026898',\n",
      "  u'e2.employeeid': u'90004472'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90022371',\n",
      "  u'e2.employeeid': u'90004472'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90023086',\n",
      "  u'e2.employeeid': u'90022371'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90026898',\n",
      "  u'e2.employeeid': u'90022371'},\n",
      " {u'a.award_num': u'aw1007',\n",
      "  u'e1.employeeid': u'90004472',\n",
      "  u'e2.employeeid': u'90022371'}]\n"
     ]
    }
   ],
   "source": [
    "# Pattern Query \n",
    "\n",
    "# Retrun 20 instances of the pattern where two employees worked on the same award. Return only the employeeid of each employee  \n",
    "\n",
    "# The syntax below translates to, \n",
    "# 'Match (Find) any instances of two nodes of type employee having a relationship with a node of type award.\n",
    "# Return the employeeid of each of the employee nodes in that relationship.\n",
    "# Also, return the award number of the award in the relationship.  \n",
    "# Limit the results to 20'\n",
    "pattern_query = graph_db.data(\"MATCH (e1:Employee) --> (a:Award) <-- (e2:Employee) RETURN e1.employeeid, e2.employeeid, a.award_num LIMIT 20\")\n",
    "\n",
    "pprint.pprint( pattern_query )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Using Python to Automate Cypher Tasks \n",
    "\n",
    "An advantage of using python to interface with neo4j is that you can send commands to neo4j in a saved and reproducable manner. In theory, all the work we did copying and pasting commands into neo4j in the instalation chapter can be replaced with python commands.\n",
    "\n",
    "To demonstrate this we will add some new Nodes and Relationships to our graph.\n",
    "\n",
    "Roke College prides itself on providing research opertunities for its Students. Students are often employeed by the university to provide research assistance to falcitly members on the awards they work on. \n",
    "\n",
    "To fully add the Students to the database we will need to \n",
    "    1. Create a variable to to the location of our files. This is the directory\n",
    "    where your student_data.csv and award_data.csv files are saved. \n",
    "    Example: data_directory_path = \"Users/Smith/Documents/myData\"\n",
    "    2. Load in the student nodes via a csv file \n",
    "    3. Create a WORKED_ON relationship between the students and the awards on which they work\n",
    "    4. Createa WORKED_WITH relationship between students and their peers who worked on the same awards \n",
    "    \n",
    "\n",
    "_NOTE:_\n",
    "\n",
    "_You may nottice that here we are using the MERGE command instead of the CREATE command to create relationships. This is done to prevent duplicate nodes and relationships from being created. A CREATE command will create a new node or relationship regarless of wheather that entitiy already exsists. The MERGE command will create that node or relationship only if it does not already exsist._\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Load in Student Nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Store data directory path for re-use\n",
    "data_directory_path = \"/Users/lcdebaca/Documents\"\n",
    "\n",
    "\n",
    "# The syntax below translates to, \n",
    "#'Load the file at the location <File Path>.\n",
    "# For each row in that data, create a node of type Student with the properties employeeid and position\n",
    "cypher_string = '''USING PERIODIC COMMIT\n",
    "LOAD CSV WITH HEADERS FROM \\\"file://'''\n",
    "cypher_string += data_directory_path\n",
    "cypher_string += '''/student_data.csv\\\"\n",
    "AS row CREATE (:Student {employeeid: row.employeeid, position: row.occupation_orig});'''\n",
    "\n",
    "graph_db.data( cypher_string )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Create Worked on Relationships with Awards "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# The syntax below translates to, \n",
    "#'Load the file at the location <File Path>.\n",
    "# For each row in the file, find the Award node and Student node that corespond to the \n",
    "# arard_num and employeeid in that row.\n",
    "# if there is not already a WORKED_ON relationship between the two, create one. \n",
    "\n",
    "cypher_string = '''USING PERIODIC COMMIT\n",
    "LOAD CSV WITH HEADERS FROM \\\"file://'''\n",
    "cypher_string += data_directory_path\n",
    "cypher_string += '''/award_data.csv\" AS row\n",
    "MATCH (a:Award {award_num: row.uniqueawardnumber})\n",
    "MATCH (s:Student {employeeid: row.employeeid})\n",
    "MERGE (s)-[r:WORKED_ON]->(a);'''\n",
    "\n",
    "graph_db.data( cypher_string )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Create Worked With relationships between the students and exsstiing staff "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# The syntax below translates to, \n",
    "# Find the instances where a two nodes have a WORKED_ON relationship with an Award node,\n",
    "# if there is not an 'WORKED_WITH' relationship between the two, creat one. \n",
    "cypher_string = '''MATCH (n1)-[:WORKED_ON]->(a:Award)<-[:WORKED_ON]-(n2)\n",
    "MERGE (n1)-[r:WORKED_WITH]-(n2);'''\n",
    "\n",
    "graph_db.data( cypher_string )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### If you would like to see the new data, open your neo4j console. you'll see that we now have a new node label, Student. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Networkx\n",
    "### Plotting and Graph Anlysis \n",
    "\n",
    "Networkx is a python modual for creating, displaying and analysing graph data. \n",
    "\n",
    "We can load data from our neo4j graph into networkx by preforming queries and passing that data to networkx.\n",
    "\n",
    "Run the cell below to see an example"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "# def neo4jProcessor(graph_db,cypher_query):\n",
    "#     \"\"\"\n",
    "    \n",
    "#     \"\"\"\n",
    "#     results = graph_db.data(\"MATCH (p) -[r]-> (a:Award) RETURN p.employeeid,a.award_num LIMIT 50\")\n",
    "#     df = pandas.DataFrame(results)\n",
    "    \n",
    "#     # Create the graph \n",
    "    \n",
    "#     G = nx.Graph()\n",
    "#     for node_dict in results:\n",
    "#         G.add_node(node_dict['p.employeeid'])\n",
    "#         B.add_node(i, bipartite=0)\n",
    "#         for j in df.columns:\n",
    "#             B.add_node(j, bipartite=1)\n",
    "#             if (df.ix[i,j] > 0):\n",
    "#                 B.add_edge(i, j, weight=df.ix[i,j])\n",
    "#     return B\n",
    "    \n",
    "#     return df\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{u'p.employeeid': u'90014540', u'a.award_num': u'aw1000'}, {u'p.employeeid': u'90026679', u'a.award_num': u'aw1001'}, {u'p.employeeid': u'90017693', u'a.award_num': u'aw1002'}, {u'p.employeeid': u'90028696', u'a.award_num': u'aw1003'}, {u'p.employeeid': u'90000919', u'a.award_num': u'aw1003'}, {u'p.employeeid': u'90013819', u'a.award_num': u'aw1004'}, {u'p.employeeid': u'90024693', u'a.award_num': u'aw1004'}, {u'p.employeeid': u'90001118', u'a.award_num': u'aw1005'}, {u'p.employeeid': u'90001652', u'a.award_num': u'aw1005'}, {u'p.employeeid': u'90039108', u'a.award_num': u'aw1006'}, {u'p.employeeid': u'90001300', u'a.award_num': u'aw1006'}, {u'p.employeeid': u'90025754', u'a.award_num': u'aw1006'}, {u'p.employeeid': u'90023086', u'a.award_num': u'aw1007'}, {u'p.employeeid': u'90026898', u'a.award_num': u'aw1007'}, {u'p.employeeid': u'90004472', u'a.award_num': u'aw1007'}, {u'p.employeeid': u'90022371', u'a.award_num': u'aw1007'}, {u'p.employeeid': u'90017074', u'a.award_num': u'aw1008'}, {u'p.employeeid': u'90004472', u'a.award_num': u'aw1008'}, {u'p.employeeid': u'90028781', u'a.award_num': u'aw1008'}, {u'p.employeeid': u'90024665', u'a.award_num': u'aw1008'}, {u'p.employeeid': u'90025003', u'a.award_num': u'aw1009'}, {u'p.employeeid': u'90028781', u'a.award_num': u'aw1009'}, {u'p.employeeid': u'98101941', u'a.award_num': u'aw1009'}, {u'p.employeeid': u'90002437', u'a.award_num': u'aw1009'}, {u'p.employeeid': u'90000321', u'a.award_num': u'aw1010'}, {u'p.employeeid': u'98101941', u'a.award_num': u'aw1010'}, {u'p.employeeid': u'90001461', u'a.award_num': u'aw1010'}, {u'p.employeeid': u'90019735', u'a.award_num': u'aw1010'}, {u'p.employeeid': u'90001779', u'a.award_num': u'aw1011'}, {u'p.employeeid': u'90001461', u'a.award_num': u'aw1011'}, {u'p.employeeid': u'16578', u'a.award_num': u'aw1011'}, {u'p.employeeid': u'8791', u'a.award_num': u'aw1011'}, {u'p.employeeid': u'90012327', u'a.award_num': u'aw1012'}, {u'p.employeeid': u'16578', u'a.award_num': u'aw1012'}, {u'p.employeeid': u'90024642', u'a.award_num': u'aw1012'}, {u'p.employeeid': u'8391', u'a.award_num': u'aw1012'}, {u'p.employeeid': u'6663', u'a.award_num': u'aw1013'}, {u'p.employeeid': u'90024642', u'a.award_num': u'aw1013'}, {u'p.employeeid': u'1646', u'a.award_num': u'aw1013'}, {u'p.employeeid': u'90028695', u'a.award_num': u'aw1014'}, {u'p.employeeid': u'1646', u'a.award_num': u'aw1014'}, {u'p.employeeid': u'90008389', u'a.award_num': u'aw1014'}, {u'p.employeeid': u'90013011', u'a.award_num': u'aw1015'}, {u'p.employeeid': u'90008389', u'a.award_num': u'aw1015'}, {u'p.employeeid': u'90028845', u'a.award_num': u'aw1015'}, {u'p.employeeid': u'90004139', u'a.award_num': u'aw1016'}, {u'p.employeeid': u'90028845', u'a.award_num': u'aw1016'}, {u'p.employeeid': u'90026452', u'a.award_num': u'aw1016'}, {u'p.employeeid': u'90002533', u'a.award_num': u'aw1017'}, {u'p.employeeid': u'90026452', u'a.award_num': u'aw1017'}]\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'\\nNotes \\nGreen Nodes are Employees\\nYellow Nodes are Students\\nRed Nodes are Awards\\n\\n'"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzs3XlcFPX/B/A3IOdys7tcireogOB9oeaRSXah5ZnmrVl5\nm1ZqpXiQpnnnmTfYV8nUNDOztMMb8cAjUTLzFgEB2V3Y1+8PhJ/IArs7szu7+H4+HvvI2NmZzwzL\nvOdzvT82AECMMcYYk4St1AVgjDHGnmcciBljjDEJcSBmjDHGJMSBmDHGGJMQB2LGGGNMQhyIGWOM\nMQlxIGaMMcYkxIGYMcYYkxAHYsYYY0xCHIgZY4wxCXEgZowxxiTEgZgxxhiTEAdixhhjTEIciBlj\njDEJcSBmjDHGJMSBmDHGGJMQB2LGGGNMQhyIGWOMMQlxIGaMMcYkxIGYMcYYkxAHYsYYY0xCHIgZ\nY4wxCXEgZowxxiTEgZgxxhiTEAdixhhjTEIciBljjDEJcSBmjDHGJMSBmDHGGJMQB2LGGGNMQhyI\nGWOMMQlxIGaMMcYkxIGYMcYYkxAHYsYYY0xCHIgZY4wxCXEgZowxxiTEgZgxxhiTEAdixhhjTEIc\niBljjDEJcSBmjDHGJMSBmDHGGJMQB2LGGGNMQhyIGWOMMQlxIGaMMcYkxIGYMcYYkxAHYsYYY0xC\nHIgZY4wxCXEgZowxxiTEgZgxxhiTEAdixhhjTEIciBljjDEJcSBmjDHGJMSBmDHGGJMQB2LGGGNM\nQhyIGWOMMQlxIGaMMcYkVEnqAjDGmFAZGRn04MEDIiLy8fEhDw8PiUvEmP64RswYs0oqlYri4uKo\nTUQEBSoU1DE8nDqGh1OgQkFtIiIoLi6O1Gq11MVkrFw2ACB1IRhjzBBb4+Np9PDhFAbQyEeP6FX6\n/+Y9DRHtIqJlrq50ztaWFq5YQT179ZKusIyVgwMxY8ziPd30/L+4OFo6cyZ99/gxNS7ncyeJKNrF\nhSbMmEGjxo0zeTkZMwYHYsYsBPdzFqdSqSghIYGWxcZSYnIyKRwdKVujIahUdJKIgvTcz3UiinRx\noblr1nDNmFkkDsSMSUhXsCEiuqdSUcP69WnkpEnUvXt3cnBwkLik5qWr6TmfiKoS0R4iamTg/k4S\nUVd3d7p+795zdy2Z5ePBWoxJZGt8PFVVKmnt8OE0LimJ0jUaupaVRdeysuihRkNjk5JozbBhFKRQ\n0Nb4eKmLazaL5s+niYMG0Q+ZmbT/0SOKpoL+3wQiCiXDgzARUWMiCtFqKSEhQcyiMiYKrhEzJoFF\n8+fTvClTuJ/zGVvj42nioEH0++PHJZqe2xDRWCLqZuS+txPRwogIOpSYKKiMjImNAzFjZlZWsCnN\n89DPqVKpqKpSSXsyM0vUejOIKJCI0sn45AcaIvKyt6f/7t177vvfmWXhpmnGzEilUtHo4cNphwFB\nmKhgYNJ3OTk0evjwCjs3NiEhgUK1Wp1Nzw+ISEHCMhDZE5HcwYHS0tIE7IUx8XEgZsyMygo25ano\n/ZzLYmNpZFaW1MUoU0ZGBl29epWuXr1KGRkZUheHVRAciBkzI6HBZmRWFi2LjRWxRJYhIyODEpOT\n6bVS3vchontU0LxsLA0R3Verydvb26DPcQYvZmociBkzk/KCjT5eI6JT589XuNrYgwcPSOHoWGrT\nswcRNaSCjFnG2klEjUJCDOof5pHtzBw4EDNmJuUFG308z/2cI4lomYDPL3Nzo5GTJum9fWnTqArZ\nU8EI7p+zsuiHzEyaOHgwLZo/X0AJ2fOKAzFjTHI+Pj50T6Uqs+m5GxGdI6JTRuz/JBGdt7Ghbt30\nm/y0NT6e5k2ZQr/rMb2MqKD//vecHJo3dSrXjJnBOBAzZib6BJvyGNvPaek8PDyoYf36ZTY9OxLR\nQiJ6gwqmc+nrOhXMw164YoVeWbV4ZDszNw7EzCx4tKl+waY8xvRzWouRkybRMlfXMrfpSUQTiCiS\nCmq55TlJBfOvJ8yYoff8ax7ZzswOjJlIbm4utmzZgsjwcMjs7VHN1RXVXF0hs7dHZHg4tmzZApVK\nJXUxzWrLli3o6OoKEBn16uDmhri4OKlPwyRyc3Ph6+6Ok3pch3gi+BKhIxG2E0Hz1HtqImx7cq18\n3d0Rb+D1igwPx3Yjfz94cuw2EREmukqsIuJAzEwiPi4Ovu7u6OTmhgQdN8rtROjo6mrUjdKaGRJs\nnn2dIIKvu3uFfniJj4tDFWdn/KPH9VARIY4IzYngSIRAR0dUlckgs7dHm4gIxMXFGXyt0tPTIbO3\nL/Z9NfSlJoLM3h7p6ekmukqsouFAzES38MsvUcXZGSf0DC5VXFyw8MsvpS622RgSbApf/zy5Ts/D\nQ4sx3585MTG4evUqrl69KigApqSkoJqAFovCV1WZDFevXhXxqrCKjAMxExUHGf3ww0rZCltUOrq6\nit70XBZzB+L09HSkpKQgJSWFa9DPMQ7ETDTmbna19puYVMHGWqhUKowbNw5elSpBVqkSqspkqCqT\nwdHGBhE1axrV9FyewqZptQmbpnnsBHsWB2ImGsEDkVxdyx2IVNFuYiqVCsuWLYOnnR1k9vZFwUZI\nP2dF8dtvv0Eul+P48eNIT08vanoeO3Yspk6darLjmnKwFo+dYLpwIGaiMfVo04p6E1u7di169OhR\nLNhYYw1fTElJSVAqldi/f3+J93788Ue0bdvWZMcW+kDZws4OU6ZMgVarLbZf7o5gpeFAzERh6tGm\nFfkm1qNHD6xdu1bqYliMa9euITAwEPHx8Trfz8zMhEwmw+PHj01yfKFdLN5OTqhduzaaN2+O7777\nDvn5+Tx2gpWJAzEThSkHuVTkm5hGo4GXlxdu3rwpdVHKZK7++Lt376JOnTpYtGhRmds1bdoUv/32\nm8nKIfQ7l5eXh23btqFx48aoW7cuvJ2decoaKxVn1mIW7dl0gxlEdPXJq6z8XNaSbvDYsWMUFBRE\n/v7+UhelBHMv//fo0SN6+eWX6a233qIPPvigzG3btm1Lv/32m2jHflbPXr1oQkwMRTo7G5XBy87O\njrp3707Hjx+n6OhoClarOVMXK53UTwKsYjDVaNMtW7agvUyGLUSIJIKMCNWevGRPfraFCpI76Nqn\nPgPApDRlyhRMnjxZ6mKUYO7+eJVKhRdffBFDhgwp0beqy86dO9GpUyfBxy2PGCPbOVMXKw8HYmaw\n0popTXHDCQ4Kgg8ROhGVHhCoIN1hvBXexBo3boxff/1V6mIUY+7++Pz8fPTu3RtvvPEGNBqNXp9J\nS0uDq6sr1Gq10cfVl0qlQlxcHNpERBg8sp0zdTF9cCBmetFn2tCGDRtEzaM8JyYG8ic3e70CAhEW\nWtFN7M6dO/Dw8DBLMNGXufvjtVotRo0ahTZt2iAnJ8egz4aHh+Ovv/4y+JhCGDqynTN1MX1wIGbl\n0reZUunmJtqglPi4OFR2cjI8IOioGVvqTWzDhg2Ijo6WuhhFpMiDPWvWLISFheHhw4cGl3fUqFGY\nM2eOwZ8zJw7ETB88WIuVadH8+TRx0CD6ITOT9j96RNFEVOmp9+2pYMH2n7OyaM+jR2STl0ev2NsL\nWi+2cIDW97m5hq8HS0Sjichyh2f9vx9//JGioqKkLkYRcy//t2bNGlq5ciX9+OOP5OnpafAx27Zt\nS4cOHTL4c+YkxRrUvOSoFZL6SYBZLmObKX3s7RHg4GB0H6PgDF1UsCqPJTdN5+XlQS6X4/r161IX\npYg5BxV9//338PPzw6VLl4wu7927d+Hh4YG8vDyj92EO5riuFS3j3POGAzHTSWgzpYeTk9GjTUW5\ncRkRHMzp6NGjCAkJkboYRcw5qOjQoUNQKBQ4duyY4HLXq1cPJ06cELwfUzL1GtQVNePc84QDMdNJ\njLzRGzduLDbaVGlri8pOTmWONhUtIBAhXY+bmFQ+++wzjB8/XupiFDFXX+aZM2egVCrx008/iVLu\nESNGYP78+aLsy1RM2fdekTPOPU84EDOdxG5OS09PR926dbF79+4ya0yiBQQifF/OTUxKLVq0wM8/\n/yx1MYqYIxCnpqaicuXK2LJli2jljouLw+uvvy7a/kzFFKPRK3LGuecNB2JWgqmaKStXrozU1NQy\njy1WQAgigr+Tk0XecO7fvw93d3fk5uZKXZQipl7+rzB15cKFC0Ut93///Qdvb2/k5+eLul9TELP2\nKsUId2Y6PGqalfDgwQNSODoWGx1tKHsikjs4UFpaWtHP0tLSyh35KdYo0ztENHrKFOrZq5eAPZnG\n/v37qV27duTo6Ch1UYp4eHhQw3r1aJeAfewkokYhIeTh4VHs51lZWdS1a1fq3r07jRo1SlA5nxUQ\nEEDe3t50/vx5UfdrCqPGjaO5a9dSV3d36uTqSglElPfU+xoi2k5EHd3cqKu7O81ds4ZGjRunc1/m\nHuHOTIsDMTMLlUpFarWaXF1dy9zOw8ODGtavLzgg1KlalSZ98omAvZjO3r17qUuXLlIXowgASkhI\noNS0NJpra/wtYZmbG42cNKnYz9RqNXXv3p0aNGhAM2fOFFpUncTKO22OaT89e/Wi6/fu0ZBVq+ir\niAjytLenajIZVZPJyMvenhZGRNDQlSvp+r17ZT5ELouNpZFZWUaXY2RWFi2LjTX680xkUlfJmeUx\nRTPlrVu3oFQq9Tq+GAPFLHGAFlCQztHX1xcpKSlSFwVarRa7du1Cw4YN0bBhQyQkJAhq7nS1s8Pf\nf/9dtP/8/Hz06dMHr732mt6pK42xfv16vPXWW0Z9VuppP8asQc1pMyseDsRMJ7EHa50/fx5169bV\n69gVuf/r5MmTqFOnjqRl0Gq1+PHHH9GsWTOEhoYiISGhaKEFowcAOTujd69eUCgU2LhxI/Lz8zFm\nzBhERkYanLrSUNeuXYNSqdRrsYinWeu0H87WVfFwIGY6Ca2VtnN2LlYrPXz4MFq2bKn38RcvXgyF\njY1RAcGSbprPmjlzJkaPHi3Z8Q8cOIDWrVujbt262Lp1q85BTkIGFZ06dQr169dHWFgY6tati7S0\nNLOcV1BQEC5evKj39tY87YcDccXDgZjpJLRW6mJjgz59+uDWrVsACjIpde3aVa9jHz9+HAEBAej+\n+usG3SyVRPB0dLToQBwZGYkff/zR7Mc9fPgwXnjhBdSqVQsbN24sNxuVkOX/VqxYAXd3d/j5+Znt\nXPv164cVK1bota21T/sx9Qh3Zn4ciFmphNywvlm7FhMnToSPjw8WLFiANWvWoF+/fuUec8eOHZDL\n5fjuu++KyuDl5ITmRKUHBPr/ZRAtrfbytIcPH8LNzc3kTbVPO3LkCDp37oxq1aph7dq1BvXVGrP8\n386dO+Hn54eLFy/i559/RpUqVfDee+8hOztb7FMrZtWqVejbt2+521WUbo+WoaG8xnEFwoGYlUlo\nE96FCxfQqVMn+Pn54c033yz1OFqtFgsWLEBAQACOHz9e9PPCVZgWU0HaShkVJOuo+uTfbaggr7TK\nQmsvT/vf//6HqKgosxzr5MmT6Nq1K6pUqYKvv/5acPDQZ1DR77//DrlcjqNHjxb97OHDh+jbty+C\ng4NFSWlZmsuXL6Ny5crl9hNb80BArVaLv/76C4MHD4aLiwta2dkZfx4WmnHuecWBmJVLSDMlUHAD\n6d69O9zd3dGnTx/8999/xd7XaDR4//33ERISUizhh67aSzoRrj55pVtJ7aXQ4MGDRU9o8aykpCS8\n8cYbCAgIwOLFi82WNOTs2bNQKpXYt2+fzve3bt0KpVKJzz//3CQjqLVaLfz8/ModjW7OhS3Ecv/+\nfXz11VcIDQ1FzZo1MXv2bKSmplaImj0rwIGY6cWYZsqnjRw5EnPnzsXkyZPh4+ODefPmQa1W49Gj\nR+jatSs6depUoqZlzbWXZ2m1WgQGBuLy5csm2f/58+fRo0cP+Pr6Yv78+WZt/i5MXbl58+Yyt7tx\n4wY6d+6MZs2aCVp1qTQ9e/bEN998U+r71jTtJz8/HwcOHECvXr3g4eGBPn364ODBg8UG11l7Xzf7\nfxyImcGMmfvYq1cvbNq0CQBw8eJFdO7cGbVr10atWrUwePBgqNXqEp+xxtpLac6cOYMaNWoYPMWm\nPJcvX0bfvn2hUCgwZ84cZGVlibbv9PR0pKSkICUlpdTf87179xAcHIwFCxbotU+tVoslS5ZALpdj\n2bJlol6PZcuWYcCAAaW+bw2jjW/evIlZs2ahZs2aCAsLw6JFi/DgwYNSt7fm0d/s/3EgZmbx0ksv\nYc+ePUX/n5iYCLlcDk9PT/To0QP//vtvse2tqfaij9jYWLz33nui7e/q1asYOHAg5HI5ZsyYgYyM\nDFH2a0iCi0ePHqFZs2aYPHmywce5cOECmjRpgqioKNy8eVOUsp87dw41atQo9rP8/HykpKRg9+7d\nmDRpEvwrVbK4QKzRaLBz50689tpr8PT0xNChQ3H06FG9H1KEdh0x6XEgZmbRtGlTHDlyBACwd+9e\nyOVyxMfHIzs7G5988gl8fHwQGxtbdJMXq/ZSxdkZhw8fNmtTrS4vvPACdu3aJXg/169fx7Bhw+Dt\n7Y2pU6fi4cOHIpSugCEJLjZt2oSXXnoJgwYNMrpWq1arMW3aNPj6+mLbtm2Cyq5SqXDu3Dm4ublh\n/Pjx6N27NyIiIuDs7IygoCC89NJLePfdd+FsZ2cx035SUlLwySefICAgAC1atMDq1avx6NEjo89f\nSNcRk5YNAEidZpNVfLVq1aK9e/fSL7/8Qp9++ilt376dWrduXfT+33//TaNHj6Zr167R4sWLqUaN\nGtQxPJyuCcinS0Tka2tLdr6+lJaWRg4ODqRUKvV6+fj4kJ2dndDTJiKiR48eUUBAAN2+fZtkMplR\n+7h58ybNmjWL4uLiaNiwYTRhwgTy8fERpXxERIvmz6d5U6bQd48fU+Nytj1JRF3t7Mg3OJhOJiVR\npUpClgchOnLkCPXr149atWpFixYtKrFoxNOys7Pp0qVLlJycTBcuXKALFy5QcnIypaamUtWqVenR\no0fUpEkTeuutt6hevXpUt27dYvnN20RE0NikJOpmZFm3E9HCiAg6lJho1OdVKhXt2LGDVq9eTYmJ\nifT222/T4MGDKSwszMgSlZSRkVG02Iq3t3eZ15NZBg7EzCy8vb2pT58+9NNPP9GePXuoVq1aJbYB\nQLt27aLRo0dTeHg4/fzDD/QwL4/sjTymhoi87O3pv3v3yN3dnR49ekR3794t8bpz506Jn6Wnp5OX\nl5fegdvNzY1sbGyIqOBG+ODBAyIqWE3q4MGDtHTpUtq/f7/B53Dnzh2KjY2ldevW0cCBA2nSpEmk\nVCqNvCK6bY2Pp4mDBtHvjx9TkJ6fuU5Ekc7ONHftWlFWuMrOzqYJEybQ3r17af369RQWFlYUaJ8O\nuHfu3KE6depQvXr1qF69elS/fn2qV68e1a5dmxwdHWnhwoWUnJxMK1as0HmcuLg4WjNsGP1s5ANe\nRzc3GrpyJfUy8JyTk5Np9erVtHHjRmrQoAENGTKEoqOjycnJyahyiOXZ7yoHbWlwIGYml52dTa6u\nrhQZGUk7duwotyb3+PFjio2NpYUxMbQmP1+S2kteXh49ePBAZ+DW9SpcWarS48eUmZtLXnZ2ZGNj\nQw/z88nT2ZnqNmtGs2fPpsDAQFIoFOUugXj//n2aO3curVq1it5++2366KOPyN/f38grUTqVSkVV\nlUrak5lp8JJ6J4moq7s7Xb93jxwcHAw+NgC6fft2sdrt4cOH6fz582RnZ0fh4eEUEhJSLOBWr169\nzJaKxMRE6t27N128eFHn++Y83+zsbPr2229p9erVdO3aNRo4cCANGjSIatasaeCRxaVSqSghIYGW\nxcZSYnIyKZ58F++pVNSwfn0aOWkSde/e3ajfKTOSdK3i7Hlw584dNG7cGPb29gbPaV2wYIFVJC0o\n7FvtIJOV2rfa0tYWMltbeHl6wt7eHh4eHqhduzZat26N6OhoDB8+HFOnTkVsbCyio6Ph7u6Onj17\n4vTp0yZd9N4cU8SeHjA1d+5cDBo0CC1atICHhwcUCgXatm2L4cOHY+HChfjpp5+QlJSEbt26ISws\nDElJSQadT15eHjw9PXH79u1StzHltB+tVovjx49j+PDh8PLywquvvorvv//epKtPGcJaF7qo6LhG\nzEzmwoUL1LVrV3r55Zdpz549dPXqVYM+L2VtTV+G9q1Gu7jQ+OnTqf+gQcVq1P/88w/t2rWLjhw5\nQn5+fqRUKikzM5Pu3r1LmZmZ5OPjo3czuUwmK2omL4+YfaZqtZquXLlSrCn5woULdPnyZfLx8SnR\nnFyvXj2Sy+U69wuANm7cSOPHj6eJEyfS+PHj9e6zf/XVV6l///701ltvlbrNovnzac7kybRLo9H7\n9zZhxgwaNW6czm0ePnxImzdvptWrV1NmZiYNHjyYBgwYQIGBgXqV2RyM+a6Wdc5MPByImUkcPHiQ\nevXqRbGxsRQSEkLvvvsunThxwuD9GN1/6eJCc9esEaX/0pRly8rKosWLF9OCBQuoS5cuNG3atBL9\n5xqNhu7fv69XE/mdO3eIiPQK2E5OTtSkQQNK12jI2OFWGiJyt7GhKrVq0fXr1ykoKKhEwK1bty65\nubkZtf/U1FR65513CABt2LCBqlWrVu5n5s6dS9evX6fFixeXuk1KSgpFhIeTs40NNSCikVlZ9BpR\n0XXQENFOIlrm5kbnbWxo4YoVJb5LAOjQoUO0evVq2rVrF3Xp0oWGDBlCHTp0IFtbW6PO11Qs+e+I\nETdNM/GtW7cOSqUSBw4cAAD8+OOP6NSpk9H7s8SkBWIsHjBnzhz4+vqiZ8+euHDhgmhly8rKwtWr\nV3HkyBHs3LkTq1evxqxZszBmzBj06dMHnTp1QoMGDSCXyyEXOD0MRAh0dMSePXvw+PFj0c7haXl5\neZg7dy7kcjm++eabcqdLHT16FGFhYaUmJMnLy0OrVq2wYMECo6b93L59G7Gxsahduzbq16+P+fPn\n4969eyY5dzFUlIUuKjIOxKxM+mRXKqTVajFt2jRUr14dycnJRT/fsmULevToIagchX1bre3tLSJp\ngdC+1WY2NmjatCnOnDlj8rKWJiUlBdVkMsGB2Fzr2iYlJaFBgwaIjo7G3bt3dW6Tm5uLDRs2wMPW\nFrJKlXQmJJk+fTo6dOhQou+9rIxxeXl52LNnD7p16wYPDw8MHDgQf/75p+iZ0kyhIqWKrag4ELMS\nDMmu9PRn+vbti2bNmpUYKLN06VKMGDFCcLlUKhVCQkIQXqNGUe0lwMEBDkSo7eeH9evXm+3JvSKk\n37TGdW1zc3Px4Ycfwt/fH7t37y72nj4DkV5wcYGLjQ2WLF6s1/FSU1Px6aefokqVKmjSpAlWrFgh\nWhYzc6kI39WKjgMxK8aYUZUPHjxA27Zt0b17d53rzs6YMQMff/yxKOULCAhAampqsdrL2bNn0b17\nd1SvXh07d+4U5ThlqUjpN631Jv3DDz8gMDAQvXr1wo0bN0TtvlCpVNi2bRteeukleHt74/3330di\nYqKZz1AcFem7WpFxIGZFjLmZTZk8GXXq1MGECRNKnWYzduxYzJ07V3D5MjIy4OLiUupx9u3bh+Dg\nYHTt2hVXrlwRfLzSWMPiAfoS3GxpxnVtn22pqSqTwb9SJVQigsLGRvB0pIsXL2LChAlQKpVo164d\nNm7cKHlqVGNotVpkZ2fjxo0b2LNnD6o4O1eI72pFJiw3HaswtsbH07wpU/QeVdmYiH7PyaHGc+bQ\n64MG0dy5c0vdNi0tjUJDQwWX8eLFixQcHFzqiNTOnTvTmTNnaMGCBdS8eXMaOXIkTZ48mVxcXAQf\nu6Lq1q0bjR0xgk4RGTVF7LyNDXXrZuzkJ/1tjY+n0cOHUxhA4x49oleJqJJGQyoiqkpEewC9RwMT\nEQUR0Xc5OdR1+HDKzsmhdevW0eXLl+mdd96hw4cPU506dUxyHvoCQDk5OfTw4UOjXjY2NuTl5UUy\nmYzUKpWk58LKx4GYkUqlotHDh9MeA6Y2EBXczH4koq7btpF6+fJS5+umpaWRt7e34HJevHiR6tat\nW+Y2Dg4ONGnSJOrbty+NHz+e6tevT1999RW9/vrrZGNjI0pKPx8fH7qnUpGGSFD6zftqtSjXRQhH\nR0dauGIFvWHE1JZoFxdauGKFyTMwFc5//UHH/NcEIgolwx8iiAoeJqtmZtKiRYto2rRp9Oqrr5K9\nvbG/0ZKMDaZpaWmUnp5Otra25OXlVeqrVq1apb7n7OxMRAUpLAMVCtJotVb/Xa3IOBBXMMYEmoSE\nBArVao2+mYVotZSQkFBq/t2HDx+K8kd84cIFqlevnl7bVq5cmbZu3UoHDhyg9957jz799FNyVKsp\nOSVFcEo/Dw8Pali/Pu0SkAhjJxE1CgmxiNy+PXv1ojs3b1KkEckeTD2/tLyWmmVENFbA/j8kooVl\n1OoNCaZpaWklfmZnZyc4mApR0b6rFRUn9KgAhOaONfWKNCEhIbR161bBzdPR0dHUp0+fMjMmPauw\nSTNYpaIxKlVBk+aT9zREtIuIlrm60jlbW51JG0oj1eIBplR4rUK1WqMSXIitvMxqGUQUSETpZHyN\nQkNEHra21HfQoFIDbnnB9OmXt7d3sf+XelEHoor5Xa1wJO2hZoIJzR1rjlGVfn5+uHHjhuBzDQ4O\nxtmzZ/Xe3pSJQCpqkoTSElw4EqFJnTpmXde2vIFkKUSoJnAQEojgb2+PadOmYcOGDdi1axd+//13\nnD9/Hjdv3jRZkhJzqqjf1YqEA7EVEyPQmHIEcHp6Oq5cuQJ7e3vcunVL0Lmq1Wo4OjrqvXCEKRP7\nm/MYUnp6iljfvn2xfPlysx6/vKlVYgXi52FEcEX/rlo7DsRWSqw/LLEDcYlkIDIZ5ERlJgPRR3Jy\nMmrVqqXXtuaoARRmHJv60UcIcHCwqPSbprB8+XIMHDjQbMfTp6UmnQgyIqtKSCIlS0wVywpwILZC\nYgYaMbMrrV2zxmRLrCUkJOCVV17Ra1tTpfTTlXEsyNkZdkSQ2dqirZOTRaTfNIWTJ08iJCTEbMfT\n9wEx8sn2rvQSAAAgAElEQVT3ytjf9fOWNaqwK6ujq2uF/a5aIw7EVkjsQCNGdqXaAQEmfdqeOXMm\nJk6cqNe2psgWVV5ffDwRQhwd4WVrCxc7O70WD7AmarUaMpkMmZmZZjmevoF4CxE6CvhdmzMhiaUw\nZqELZlociK2Q2IFGaGAPcXREgIODSfuf+vXrhzVr1pS7nViDz5xsbfHvv/8CMLxJL9DZGdM+/ljn\n4gHWrFWrVjh48KBJj6HRaHD69Gl89dVXcLK1LbelJpcIvkQ8EMlIZS10wcyHA7GVMcUoZyFN3X8S\nwcUMN8ImTZrgzz//LHe7lJQUVBVhRSG/SpXg6+uLD95/nwe5PDFmzBjExsaKus9///0X27Ztw8SJ\nE9G2bVu4uroiODgY/fv3R93AQL0eOOOJUOXJdX/ef0fMOvE8Yitz9epV6hgeTteMnBNYKNDBgd7/\n7DOqWrUqyWQyOn78OK2bN4/+VKkMyq7U0MGBwmxt6dfcXKPK0dHVlYauWlXmHEUA5O7uTqmpqZSX\nl0f//fcf3bhxQ+d/r1+/TrKcHLprVGn+XzWZjGavWkVD336bDhmR7OQkEXV1d6fr9+6ZPPOUucTF\nxdH27dtp27ZtRn3+0aNHdOLECTp69CgdPXqUjh07Rmq1mpo3b170atq0KXl5eRUdT9/5r4uIaB4R\nfUdkUEKSUePGGXUujImJA7GVESsQB9jbU5voaLK1taWsrCzKzs6m1CtXKOvGDdoL6HUze9nOjmwc\nHGjZ48eCk4H8fPQo3bp1S2eAvXbtGp08eZIqVapEbm5uVLlyZQoMDNT5X1dXVwqpXZseajSCUvp5\n2dvTwuXLKW7MGOMTIejxkGFNUlJSqH379nT9+vVyt83Ly6Pz58/TsWPHigLv1atXKTw8vFjgrVat\nGtnY2OjcR3kJPZ61lYhGU0HKy5FEJklIIkaKVMaexYHYyhTmjhUj0Px3716JG4k+2ZUWOzvTORsb\n6jVgAK1dsYIy8/MFZTZyJSI1Ednb25OTkxPJZDJyc3MjT09P8vb2Jo1GQ5cvX6ZRo0aRl5cXubq6\nkkwmI5lMVvTvp//7YvPmNPbMGcEPBwBMmnHM2gAguVxO586dI39//2Lv3bhxoyjgHj16lE6dOkWB\ngYHUvHlzatasGTVv3pwaNGhgcOvA1vh4mmhAHmw1Ea0kok9tbCjX1pYUTk4EgO7m5pKTjQ3Vb96c\nvvzyS2rRooXeZRCauY6x8nAgtkKmTkmpVquLbjynzp8n+ZMbzH21mhqFhNDISZOoW7dudOPGDVFq\n50HOzvT1tm3k4+ND2dnZlJ2dXVRLz8rKop9//plu3rxJkZGRJd7Ttb1Go6GmAB01sjztnJ2p1ejR\ntGjePMrIyxP0kFHaA4+1ioqKogEDBpBSqSxqXj569GiZTcxCFS76YGge7HcGD6a0tDQioqJc56tW\nraKFCxdSrVq1aMKECRQVFVXqal5ExVd9Glm46tOT94SkSGWsGGm6ppkQ5lxDtqxRleZal3fkyJFY\nuHCh3tcnKysLSjc3oweQudrZITw8HEpbW5Ofm6XTaDRISkrCypUrMXjwYCgUClSqVAktW7bEmDFj\nEBcXh5SUFGi1WpOWQ8z5r2q1Gps3b0bDhg1Rt25drFq1SmcqS06AwcyFA7EVspTcsWImAylr6kT7\n9u2xb98+g8pmdOYxZ2fEPwkupnjIKMzIlZKSYpHTRUobxdyvXz8sWbIECxYsQIcOHSQpW2nzX53t\n7BDk5WXw/FetVosDBw7g5Zdfhq+vLz7//HPcu3cPAKeEZObFgdhKWcqNwhTJM57l5+eH69evG1w2\nQ2s0vnZ2CA8JgUajEfUh486dOyUyclVzdRWc9lOozMxMHDx4EHPmzEF0dDQCAgIgl8vRtWtXTJ8+\nHfv27UNaWlqxz9y9exceHh7Iz883e3mf9nRLTVJSEhQKhaAynT9/HoMHD4anpyeGDh0Khaur5A+6\n7PnBgdiKWULTmambyR8+fAiZTGZ006chTZqbNm7Eiy++iKFDh0Kr1aJJcLDgh4ywqlVNlvbTEHl5\necWamENDQ+Hi4mJUE3P16tVx8eJFk5XVGPXq1cOxY8cE7+fWrVt444030NzGxvjvdCkpUhkrDQdi\nKyd17lhTN5P/9ddfaNy4sdHlS09Px4ULF/DVV1+hZVhYuSn9MjMz0aRJE4wfPx5+fn5o6+ho9A25\nGRE8bG0leVB6uom5Xbt2cHV1RZ06dYqamI8fP250ra1nz57YsGGDKOUUy7hx4/DZZ5+Jsi9ztPIw\n9jQOxBWA1LljTdlM/s0336Bv374GlUfX4gyFTcEtQ0Px1Vdf4eLFi6X20d66dQsuLi5o06aNoIcM\nFyL8bYJr8qxHjx4Z3MQsxJdffon3339ftP2JYf/+/WjevLng/ZhjfW7GnsWBuIKRKnesqZrJP/zw\nQ8TExOhdjvIWZ9CnKXj8+PFo3bo1AgICMHrUKKMeMuREmG1kAC+rleDZJuawsDCjm5iNdfjwYTRr\n1sxk+zdGbm4u3N3diwZbGctcMwEYexoHYiYafZrJW9nbG9RM/tprr2Hbtm16bSvGw8CGDRtQs2ZN\n3L9/v2gQ0HvDhxu03wAHB9R1cDD6Jv50H+ONGzewfft2fPjhh6I3MRsrKysLLi4uyM3NNetxy/Pa\na69h06ZNgvbBgZhJgQMxE1VZzeTN69eHm5sbMjIy9N5f7dq1cf78+XK3E6N5/OjRo5DL5Th37lzR\nfn/77TcoFArMmjlT77744KAgwX2MlT08TN7ELER4eLgog6PEtHz5coO7MZ5lril5jD2NAzEzGV3N\n5C+++CK2bNlS7udSUlKQnJwMBweHcmt8YgwYS01NReXKlbFjx44S+//uu+/g7++Pc+fOldsXf/fu\nXVH6GJ3t7HD69GmTJ8ow1tChQ7FkyRKpi1FMamoq5HK54KlVPFiLmRsHYmZWW7du1ZkQQtcAqyAX\nFzgSlTvXVvAUKldX1KpVC9OnTy+13CtXrkSNGjVw8+ZNAKX3xT8vTZurVq1Cv379pC5GCfXr18fR\no0cF7cOcmesYAzgQMzPLzc2FQqHAlStXin4mdICVGDWYKh4e5dY+Z8yYgfDw8DKbHMUKxIGOjsWu\nkaVJSkpCcHCw1MUoYfz48fj0008F7cNSMtex5wcHYmZ248aNw0cffQRA+ACrZ6ebpBMh5ckrXc+b\np759elqtFu+//z7atWunMzfx0+UR2sfoaGOD+vXrIyEhwSKbpzUaDVxdXfHw4UOpi1LMgQMHRBnR\nbSmZ69jzgQMxM7vz58/D398fmzdtEnyzS0lJQVWZDFuIEEkEGRGqPXnJnvxsCxFU5exX36bgvLw8\n9OjRA926dUNeXp7ObUTpYwwPx65du9CwYUM0bNgQu3btsriA3LZtW+zfv1/qYhSjUqng7u6Ou3fv\nCt6XJWSusxSWniPd2nEgZpJo0aIFfFxcBDf/LVy4EC5E6ERUerM2EXyJEC9CIAYKmi47duyI4cOH\n6wyOYvYx5ufnY/v27QgNDUXz5s2xb98+iwnIEyZMwMyZM6UuRglvvPEGNm7cKMq+pM5cJ6WyEuNI\nmSO9IuJAzCQxbNgwtLKzMz5YubpiwNtvG1ZjIcJCHe8ZM90kIyMDjRo10tkfaYo+xvz8fMTFxSE4\nOBht2rTBr7/+KvRXINi3336L119/XepilLBixQr06dNHtP0VTsmLqFkTjjY2Zs9cJwUxEuMw/XEg\nZpJoFRoqqPl2LBGUNjaGN2vrqBkbO93k9u3bqFWrFpYtW1biPVP1MWo0Gqxfvx41atRAx44d8ccf\nfxhcbrGkpqbCz8/PYmroha5fvw4fH59Suw6MNW/ePAwfPlySzHXmxE3y5seBmJmd0Hy+uVTQ1Gx0\njZOK9xkLmW6SkpKCgIAA/O9//yvxnilvaGq1GqtWrUJQUBC6dOmC48ePG1V+IbRaLZRKJf7991+z\nH7s8oaGh2L9/v6j9mm+//TbWrFkjQuksFw9SkwYHYmZ2Qqf4bKGCfl9jP9+BCHFPB2aB000SExOh\nUChw4MCBEu+Zuo8xNzcXS5cuRWBgIF577TWcPn3a6PMwxiuvvILt27eb9ZhlKezXrKFQwNnWVtR+\nzbCwMJw8eVLkElsOnrYlHQ7EzOyEBuJIIuGjkkV+kj948CAUCgVOnTpV4j1zrI6Vk5ODBQsWwM/P\nD2+++aZeaUHFMH36dEyaNMksxyqPKfs1c3Nz4ezsXOq0tYpAjMQ4nMjEOByImdkJmWubTgXTkoSm\nkHQhQqCzs6h9W9u2bYO/v3+ZiThMvTpWVlYWvvjiCyiVSvTp0weXLl0S/RhP+/HHH/HCCy+Y9Bj6\nMHW/5qlTpxASEmLCM5Aep/aUDgdiJokW9esb9UefQgVzhI29WRS+5EQY8M47op/X8uXLUbNmTdy+\nfVv0fRsiMzMTMTExkMvlGDBggMnSZT548ABubm6iD4wyhDn6NY1ZF9ua8DrM0rIlxszo+PHj1K9f\nPzqTmkrz7e0lK4eTszPt/uEHunPnjqj7HTFiBPXr14+ioqIoMzNT1H0bws3NjT755BP6+++/qUqV\nKtSkSRMaPnw4/fvvv6Iex9vbm3x9fenixYui7ldfKpWKRg8fTjseP6YgAz4XRETf5eTQ6OHDSa1W\nl7v96dOnKTw83OhyWroHDx6QwtGRKgnYhz0RyR0cKC0tTaxiPTc4EDOTU6vVFBcXRy1btqQePXpQ\nREQEpaSk0BVnZzpl4L58iOguEWkElEdDRA/z8qhfv340YsQIAiBgbyVNmzaNWrRoQdHR0aRSqUTd\nt6E8PT1p+vTpdPnyZfL29qaIiAj64IMP6NatW6Ido3nz5nTs2DHR9meIhIQECtVqqZERn21MRCFa\nLSUkJJS7bVJSEkVERBhxFMb0IHWVnFVct2/fxvTp0xEQEIAOHTpgx44dxZowjW1S9LaxEaUvKzc3\nF6GhoYIXk9clLy8Pb775Jt58801Jm22fdefOHYwbNw5eXl4YN24c7ty5I3ifCxcuxIgRI0QoneHM\n0a+p1Wrh6ekpyrWyVLwOs7Q4EDPRnThxAv3794enpyeGDRuGM2fOlLqtMYNs+vftK2h0ZzMidOnS\nBdeuXcPJkyehVCrx33//iX4dcnNz0b59e4wcOdLikl78999/eP/99+Ht7Y3Jkyfj/v37Ru/rr7/+\nQqNGjUQsnX7M1a/5zz//wM/Pz4xnJg0erCUdDsRMFGq1GvHx8WjVqhWCgoLwxRdf4MGDB3p9Nj4u\nDko3NzQn0muurdD5jko3N4wfPx7e3t7o2bMnhgwZgq5du5okWGZkZCAiIqLMtY6l9M8//2DYsGHw\n9vbGtGnTjFpN6fHjx3BxcUFOTo4JSlg6c639vHPnTnTp0sWMZyYNXodZOhyImSB3795FTEwMAgMD\n8cILLyAhIQEajcbg/ahUKjRt2hT1K1fWa66tGCNlMzIy8OWXX6JKlSpwdXXFmDFjTBKMb926hRo1\nauDrr78Wfd9iSUlJwYABAyCXyzFjxgxkZmYa9PnGjRvjzz//NFHpdDNXILakudKmxAk9pMOBmBnl\n5MmTGDBgADw9PTFkyBAkJSUJ3ucPP/yAZs2a6T3XVqy5o2q1GjNnzoSdnR3q1KmDtWvXIjc3V/D5\nPO3vv/+Gv7+/RWWh0uXSpUvo06cPlEolYmNjkZWVpdfn3n33XXz11VcmLl1x5urX7N69+3NT0+MU\nl9LgQMz0plarsXXrVrRu3RpVqlTBnDlzBPUtPisvLw+VK1c2KKgXZlNq5+wsOIXk9OnT0bhxY3Tu\n3BkBAQGYPXu2qAvfnzx5EgqFwiJWTirPuXPn8Oabb8LPzw8LFiwoN6PUN998U+qKR6Zcy9Yc/Zo1\na9ZEcnKyqOW2ZNM+/hjyJw+vQh5wmf44ELNy3b17FzNnzkRgYCDatm2Lbdu2GdX8rI+pU6figw8+\nMOgzp06dgpubGxrXri0ohaRGo0Hjxo2xcuVKnD59Gv369YOXlxfGjBmD1NRUY0+pmAMHDkChUJg9\nJ7SxEhMT8dprryEwMBBLly4ttaXg/PnzqFmzZtH/m2stW1P3a2ZmZsLFxcVk33dLk52djYiICPTv\n378oR/oGIlyigmQ66UY84LLycSBmpUpMTMTAgQPh6emJQYMGITEx0eTHvHbtGnx8fPQe+HP//n3U\nqFEDGzZsACA8heS5c+cgl8tx7do1AAVL6k2YMAHe3t7o3bu3zlzShvr2228REBCAlJQUwfsyl2PH\njiEqKgpVq1bFqlWroFari72fl5cHNzc33L9/36xr2ebm5kIuk5msX/P3339H06ZNBZXRWmi1Wrz9\n9tvo06cPHj9+jA0bNiA0KAiORFAQQUkERyJ4ECG4alVs3LiR+4RFwoGYFaPRaPC///0Pbdq0QeXK\nlTFr1izcu3fPrGXo3LkzNm/eXO52Go0GHTt2xPjx40U9/pw5c9ChQwfk5+cX/Sw9PR1z585F5cqV\n0bFjR+zdu1fQwK6lS5eiVq1aVjc39Y8//kDHjh1Rs2ZNrF+/vtgc6fbt22PwO++gspOTWZo109PT\n8e6778LTwwMBDg4m6ddcunQphgwZYlT5rM2iRYsQHh6O9evWme1BihXgQGxlTNXfdu/ePcyePRtV\nqlRBZGQkvv322xK1HnP59ttv0b59+3K3Gz16NF566SXRE2bk5eWhRYsWWLp0aYn3VCoVNmzYgLCw\nMISGhmLdunVG1wqmTp2Kxo0bGzxC2RL8+uuvaNOmDYKDg7FhwwZs2rQJvm5ukD8JcqYe6LNjxw5U\nrlwZQ4YMQVpamskWfRg2bBiWLFli7GWyGocOHYJSqcTUjz4y6eIZTDcOxFbAlP1tp0+fxuDBg+Hp\n6YkBAwZYxHqrubm5UCgU+Pvvv0vdZu3atahduzbS0tJMUoaLFy9CLpeXupKSVqvFvn370KlTJwQG\nBiI2NtbggV1arRbDhg1Dx44ddfa9mnKQkxi0Wi0+/ugjuNrZobmNDXyITD715ebNm+jevTtq166N\ngwcPFnvPFGs/N2vWDIcPHzbm8liNGzduwN/fH5MnTeIR0xLhQGzhTNHfptFosH37drRr1w4BAQGI\niYmxuCbScePGYfLkyTrf+/PPP6FQKHDhwgWTlmH+/Plo06ZNsSZqXRITE9G3b9+itJHXr1/X+xh5\neXmIjo5Gz549kZ+fb7ZBTmJ4uha6hQgdjQjCRYOmylnLNj8/HytXroRcLsfHH39c6hgCMdd+zsvL\ng4uLCzIyMoy6PtYgNzcXLVq0wGeffcZziCXEgdiCid3c9uDBA8TGxiIoKAitWrVCfHy8ZM3P5UlO\nToafn1+J8v37778ICAjA7t27TV6GvLw8REZGYsGCBXpt/88//xTlce7bt6/eg9seP36Mtm3b4qXO\nna2mb+7Z+aaRT8pnbCAuaxrRxYsX0bZtWzRt2tSgqW1CB+5duHABNWrUMPhz1mTEiBF44403sGnT\nJmGjz8t5kGJl40BsocScWH/mzBkMHToUnp6e6N+/P44fPy7RWZXt2abY1q1bY8eOHUXv5+TkoEmT\nJpg9e7bZyvT333/Dx8cHly5d0vszDx8+RGxsLAICAtCpUyfs27ev3IFdc2JioLCxsYq+uWczMKUT\nQfbMg4OhL12JNVQqFWJiYuDj44MFCxaYffGM+Ph4REdHm/WY5rRmzRoEBwcjIyOD80xLjAOxBRIj\n1VxOTg6+++47tG/fHgEBAZg+fbrki9XrUlZTbP0qVRAREQGVSgWtVou+ffuid+/eZl9AYfHixWjZ\nsqXBgUClUmHdunUIDQ1FgwYNsGHDBp3Nd9aWzejZubspRKgm4CZe+Ho61eSRI0cQFhaGqKgo0eZw\nG2ry5Mn4/PPPJTm2qR07dgxyuRzJyclmWzyDlY4DsQUSmqQg0tERcrkcLVu2NKhPzNz06f9uTgSl\nqyv69OmDRo0aITs72+zlzM/PxwsvvIAvvvjCqM9rtVrs3bsXHTt2ROXKlTF37tyiG5Y15vd9tvYk\nZiA+e/YsRo8eDV9fX2zevFnSVauioqKKtchUFHfu3EFQUFBRulVz5exmpeNAbIHEaCZqXLu21KdR\nJkP7v+VE+GzKFMnKe/XqVcjlcpw/f17Qfk6ePInevXvD29sbEyZMwOLFi62qb05X7amwaVpozmcX\nOztUqVIF77zzjqipU40VEBBQlNilotBoNGjfvj0++uijop9xIJYeB2IL8zw0E5m7KVasaUBff/01\nmjZtKkq6w9TUVIwdOxaednZW1TdX2k1bjMFaPg4O+Omnn8x2LmW5e/cuPDw8LG4daaHGjx+Pzp07\nF+tmMdfiGax0HIgtTEV/OjVXU6wppgFptVq8+OKLmDlzprGnX0x6ejpklSpZ1UNXad9PodOXWjs4\nYN26dWY5h9I8/cC2Y8cOtG3bVtLyiC0+Ph7Vq1fX2dpQ19/fqh4IKxoOxBamogdiwUn69WiKNWWu\n4+vXr0Mul+PMmTNCLgMA6/xdl1Z7yiWCLxmf0EPp5ibJWIbSHticbW1RXS63qHnbQpw5cwZyuVxn\nrvT4uDh429ujvYDvYHmLZ7CycSC2MBW9mUiM/u/m9eqV2sxsqlSHT1uzZg0aNmwoeA62NQZioPTf\nYTwRqpDhKS6VtraQyWSoWrUqevXqhYULF+LYsWMmD4DmXJxCSg8fPkTNmjWxcePGEu8VtlD9JfBB\nihN6CMOB2AJV1Dl9YvV/OxIh6Em2pKebmc3V96zVavHyyy/js88+E+V6WNtDV1mtGgufBGNDH4S0\nWi0uXryIb775BsOGDUNYWBhkMhkiIyMxceJEJCQk4NatW6Kdgzke2CxBfn4+Xn755VKXFn36d2ns\ng1SAg4NVP6hYAg7EFsjUa6xKRbQaIBGuUvFai9LNDd7OzmZ7or9x4wYUCoXgZRGt8aGrvH7+eCqo\nXXV88vvRmfNZj5pmRkYG9u/fj+nTpyMqKgpeXl6oVq0aevfuXVRrNqZVwtrmbQvx6aefok2bNqVe\np2e/f4Y+SAUQoXZAgJnPquLhQGyBrHFuqT7EDsRP/yyGCuYcG/3wYsQ0oMJVmHQt2KAva33oKi+Y\nqYgQR4Q2VDC1qSoRgqigNSO0alWj5rfn5+fjwoULWLt2LYYOHYrQ0FCDa80V9W9Ll507d6Jy5cql\nXpPSWqj0epB6ss0mstxuMGvCgdhCVcSndtGaYqlg7urTPzdlruPSaLVavP766/jkk0+MviZCA4PM\n1hbr16+XJGe4vs276UT4ngj+Tk6YExMjahnS09Px008/4fPPP0eXLl3g6elZVGtetGgRjh8/Xuza\nmGOwoDmUNyXv8uXLUCgU+PPPP0vdR1kPxroepKo++XebJ++pnmxrqQNDrYkNABCzSIvmz6d5U6bQ\nd48fU+Nytj1JRNEuLjRhxgwaNW6cOYpnlDYRETQ2KYm6Gfn57US0kIgOPfWzDCIKJKJ0Iqpk5H41\nRORlb0//3btHHh4een/u9u3bFB4eTrt376amTZsadeyt8fE0cdAg+v3xYwrS8zPXiSjS2Zl6f/AB\nHT16lK5du0ZjxoyhIUOGkJubm1HlKJSRkUEPHjwgIiIfH58yr8fW+HgaPXw4hWq1NDIri16j//8d\naIhoJxEtc3Oj8zY2tHDFCurZq5egspVHq9XSpUuX6K+//ip6paamUqNGjahly5a099tv6bPUVGHf\nv4gIOpSYKGax9aJSqSghIYGWxcZSYnIyKRwdiQC6p1JRaO3a9NbgwRQZGUkZGRk0dOhQioqKojZt\n2lBOTg5lZ2dTTk5O0Ss7O5vu3LlDR3fvplv5+WUeN4OI0p7825uInv02VJPJ6ODZs1S9enUTnPXz\ngQOxhbO0G51QcXFxtGbYMPo5K8uoz3ckoqFE9PRZXn3y82sCy2bsDSU+Pp6mT59Op06dIicnJ6OO\nbehDV5StLbWKiqIdu3cTEdHx48dp3rx5dODAARoyZAiNGjWKAgIC9D6+zps8Ed1Tqahh/fo0ctIk\n6t69Ozk4OJT4rFqtpoSEBPpqxgw6feECuRORk5MTpeXlUaOQEBo5aRJ169ZN52fNISMjg44ePUoH\nDx6kr2Jj6RFg8gc2AKRSqUoEQV0BUZ//v/Hvv3Tnn38oDKAPAXqVit8HdhHRXBsbOmtjQzbOzuTu\n4UFNmzYlFxcXkslk5OLiUvSytbUlrVZLRESzP/uMMrRasjfx9WBl40BsBQpvdMtiY+nU+fMkf3JD\nu69WW8SNzhAqlYqqKpW0JzOTGhn42ZNE1JUKaoNPn6nUgRgA9ejRg2rUqEGxsbFGH9+Qh65ps2ZR\nzMyZtG7dOurcuXPRPq5du0YLFiygTZs20euvv04TJkygkJAQvY4bBtDIR4903uSXubrSOVtbnQ97\n+fn5tGTJEpoxYwaNHDmS3n77bbK3tydvb2+LujlfvXqVOoaH0zUjHwIL+VeqRBGdOpGNjU2ZwdPB\nwaFYAHw2IJb1/0//+8fduylh7Vr6XqXS7yHNxoYmzZ5N4ydNKvp5aQ9at7KyqA4RfURE3an435U+\npGwhqFCkaxVnxhC6xqoxxxMjPeTTjO7/poKBJLr6IMXIdSxk0Mndu3fh5+dXZp+cPgxZ2P63336D\nUqlESkpKif3cv38fMTEx8PPzQ1RUFH755Red6RqFTuNJSkpCs2bN0K5dO4OWipSCWIMFAx0dsWTJ\nEuzevRsHDx7E0aNHcfbsWaSkpOD27dvIzMwUJQ0qIM5YEb3mS1PB4Ctdf19l9plb6AwNa8OBmJVg\nivSQzzI4AFDB1IrSthFjsFZEjRqC1rzdtm0b6tSpI9oKUfo8dC1atAjh4eGlHvPx48dYtWoVgoOD\n0ahRI8TFxRUFCSE3+Q0bNuDjjz+GQqHAypUrkZ+fL8o5m5K1zdsWY4T3l7Gxov6d6TqGtYwit2Qc\niFkx5sw2VHisjq6u5U6TKO9JXWiu40hHR9SoUQP+/v6YMGECkpKSjDqn3r17Y+zYsSV+boqWBaBg\n5HSmc2IAABxWSURBVHa/fv3Qp0+fMhcoyM/Px86dO9G2bVtUrVoV8+bNg6+bm6DR2tHR0bh586Zo\n52IOLUNCrGbettAR3iGOjghwcBCt5UnXA5mlztCwNhyIWREpsg092xRbxdkZctI9TaKsl9Bcx4VP\n9snJyfjoo49QpUoVNGjQAPPmzTMo2Ny/fx8BAQE4dOiQWVoWACAnJwcNGzbE/Pnz9dr+yJEjaNas\nmaB5122dnKymSVKtVuP7779H9+7d4ezsjFaVKhl93uZsihWS7CWXCN5C/h7K+Luz5kxjlooDMQMg\nzbzlR48e4ZdffkFMTAxefvlleHp6onLlyghwc8MGI24gxqbo03UO+fn5OHjwIAYOHAhPT0907twZ\nmzZtQlZWVrnn9f3338NXqTS4ZUFIrTk1NRW+vr745Zdf9NreGjN6GUKr1eLEiRMYNWoUFAoFIiMj\nsXLlSty+fdsqEnoITQcrtIWoLRUk63j6O7uNCh5ErD33tiXiQMzMkm1Iq9UiNTUVW7Zswfvvv49G\njRrBxcUFLVu2xPjx47F9+/aimqeQJrmFRFCS4bmOy5KdnY24uDhERUXB09MT/fv3x/79+0vtT174\n5ZfwtbPTqwx/EsHbwQF1/f0F15oPHDgAPz8//PPPP2VuV5HXvL5x4wZiY2MREhKC6tWr49NPP8WV\nK1eKbWMNyXKEDiwTY8yEB1GZgwWZeDgQM5NkG8rNzcVff/2FL7/8Et27d0dAQAB8fX0RHR2NuXPn\n4o8//sDjx491lkfog4GHk1P5fc9GPtnfunUL8+fPR8OGDREYGIgPP/wQZ8+eLXrfkJt8YSrBDkSi\n9cfPmzcPjRs3Rk5OTqnbWOuqT6XJzs7Gpk2b0LlzZ3h5eWHIkCE4dOhQmQPILH3RByG/o8JZBGI8\naJ0+fdpsMzSeZxyImSjNlC1DQvDdd99h4sSJaN26NVxcXBAREYGRI0di06ZNuHr1apmDiZ4ltNZi\nyDQgY509exYffvghAgMD0bBhQ3zxxRdQ6jkAythVisqj1WrRq1cvvPPOO6Ve74oQiPPz8/Hrr78W\ndR106dIFcXFxZT6APEuvwYISNcUKGeGdQoRqAn+3Uv9+nzcciJ9zYjVTOhChY8eOmD59On7++Wdk\nZmYKLptYtRZTz73Oy8vDzz//jDZt2ug1AErMvmxdsrKyEBYWhiVLluh8X6xpPM62toiLi8Pdu3fF\nvqSlunz5MqZMmYKqVasiLCzM4MF0zzLHA5uxjH1A5kBsfTgQP+csvXZkybWWZ+lz4xRrdHd5rly5\nAqVSiUOHDhld1rJe24hQ29cXL774Itzd3VGrVi3069cPy5YtQ2JiomgJLQAgLS0Ny5cvR8uWLeHr\n64uxY8ciMTHRoBYWfZg7WU55jO0ysoQEN8wwHIifc5YeiIGStZZAR0cobW0totZSSN+WBaGjWQ1Z\n/Wfv3r3w9/fHjRs3Srwn5vKLeXl5OHv2LFauXImBAweibt26cHNzQ/v27fHxxx9j165duHfvnkHX\nU61WY9euXXjzzTfh7u6Ot956C7t375ZklSmpCBkr0ZjMvxoZMx4H4uectWUbSk9Px5UrV9CoUSMs\nWLDA5MfTl74PNOZernHWrFlo3rx5iTWTTT1S/sGDB9izZw+mTp2KTp06wd3dHbVr10b//v2xfPly\nnD59usSoc61Wi1OnTmHMmDFQKpVo1aoVvv76a6SlpRn2y6hAjB0r4e3ggLaOjqI8aDHT40DMrHJO\naVJSEhQKBe7cuWPW45ZGn0As5mhWfR96tFotunfvjqFDhxb7uVqtxquvvAK5jY1ZpvHk5eXhzJkz\nWLFiBQYMGIDg4GC4ubmhQ4cOGDVqFAYNGoR69eqhWrVqmDp1Ki5fvmzQ/isyY8ZKfDFrFlzt7Cx+\nvjQrwIGYidpMaU7jx49H//79zX5cXfRpWZBqEE1mZibq16+PFStWAACuXr2K5s2bo2vXrpj5+eeS\nTOPJzs7GihUr0KhRIzg5OcHf3x/Ozs6oXbs23nnnHXz99ddISkoSlPu7IjF0rMSECRMQFhqKQEdH\ni54vzQpwIGZmSehhCo8ePUKVKlXw66+/mv3YupTXsiDlaNZLly5BoVAgJiYGCoUCX375ZdFgJ3MN\niMvPz8dvv/2GwYMHw8vLCy+99BI2b95ctGBFXl4eTp8+jeXLl+Odd95BnTp14O7ujo4dO2LKlCn4\n4Ycf8ODBA6OPb+30HeEdFxeH6tWr44cffoCHTIZAR0eLnS/NCnAgZgCsI9uQLtu3b0e9evUsohmt\nvJYFKUez5uTkICoqCnZ2dtizZ0+J9005jefvv//GtGnTUL16dYSEhOCLL77Af//9p9dn7927h127\nduHjjz9G+/bt4erqiuDgYAwYMAArVqzAmTNnLKrWbKrFPXQdR9cI76SkJMjlcmzcuBEKhQL79u2z\nqpkHzysOxKyIpWcb0kWr1eLll1/G7NmzJS0HoF/LgrkHawHAhQsX0KBBA/Ts2ROTJ09G69atywyq\nYkzjefjwIVasWIHWrVtDqVRi9OjROHnypOApRxqNBomJiVi2bBn69euHWrVqwd3dHZ06dcLUqVOx\nZ88esw/uMtfiHuVJS0tDzZo1ERMTA6VSiV27dhW9Z8nzpRkHYvYMa3x6TklJgY+PD65duyZ1Ucpt\nWRA8fcmA/nitVotvvvkGcrkcK1euhFarRX5+Pl599VW89957op+7RqPB7t270aNHD3h4eODNN9/E\nzp07TT7l6O7du9i5cyc++ugjvPDCC3B1dUXdunUxcOBArFy5EmfPnjXZesnmWja0vJp2Xl4eoqKi\n0LdvX/j5+SEhIaHMfVnSfGnGgZjpYI1PzzExMXj11VelLgaAslsWzJXQIzMzEz169ECtWrWwZ8+e\nYjfc9PR01KlTB2vXrhXlfBMTEzF27Fj4+vqiRYsWWL58uaR9uRqNBqdOncLSpUvx9ttvo2bNmvDw\n8MCLL76IadOmYe/evXj48KHg45i6BcmQmvaUKVPQtGlT+Pn5IT4+XvC5MfPiQMzKZC1Pz7m5uQgO\nDsaOHTskLUdKSgqmTp0KHx8fyGxt0cbRsUTLwiYiBJBpUlzm5uZi1qxZkDs4wMnWFtVkMp037+Tk\nZMjlchw/ftyo87x16xbmzZuHBg0aICgoCFOmTMGlS5eM2pc53LlzB99//z0mT56Mdu3awdXVFfXq\n1cPgwYOxevVqnD9/3qBas6nHVBhS0x4/bhz8/f3h7++P9evXC7lMTCIciFmFceDAAQQFBRVbM9gc\ng2eysrKwbt06tGvXDgqFAqNHj8bp06eLWhaCvLzgbGdXrGWhdkAAAhwcRK1NxW3ZAi8nJ7Qg/VZz\n2r59O4KCgvSei52Tk4P4+Pii5SAHDhyIgwcPmqzZ15Q0Gg1OnjyJJUuWoG/fvqhRowY8PT3x0ksv\n4bPPPsO+fftK/b6YepaBoTVtORG83NywcuVKU10uZmIciFmF0rdvX4wbN87kg2e0Wi0OHz6MQYMG\nwdPTE6+88gq2b9+uc7+1a9fGH3/8UaJlobDWE2lvL7g/fvaMGVDquQby04H9448/Rrt27Urtxy08\nzyFDhsDLywsvvvgiNm3aVOxhp6K4ffs2duzYgUmTJqFt27aQyWQICQnBkCFDsGbNGiQnJyM/P98k\ny4YWMram7W9vbzFjNpjhOBCzCuXr5cvhYmODDjKZSQbP/Pvvv4iJiUGtWrVQr149fPHFF2Wu/nP/\n/n24ubmVOsVGpVJh/fr1UDg5wdnODpWdnCAngkulSnr3x3/++edGZ8jasnkzunTpgjFjxhTbZ0pK\nCj799FPUqFED9evXR2xsrM6c1aZmrulAuqjVapw4cQKLFy9Gnz59UL16dXh5eSHAzc0kI9+tdT4/\nE44DMaswTDV45vHjx4iLi0Pnzp3h7e2NESNG4MiRI3pNxdmzZw/at29f7nZnz56Ft7c3fvnlF2ze\nvBne3t6lrpxUKD8/HzNmzICLjY2gm/ft27dRs2ZNrFy5EqtWrUJkZCQUCgU++OADnDhxQvRVjspj\nKdOBdLl06RJc7OxMkqbUlDVtZtk4ELMKQezBM9r/a+/+g6Ks9j+Af5ZEdBWBZQEFER1umGDmj+mL\nJU7eRM2+IwpjaNdwUuyqpEPXucbUUGl670R5ucO3/ImY5S8uKVMW3Mns22iJSaJd+/qzovSmkIrj\nCkjsyr6/f2Dey1Vhd5/n4ezq+zXDP7XPs2fPOPvec57POcfpRGVlJebPnw+LxYJx48Zh69atbh08\nDwCvvPIKXnjhBZdeW1BQgMTERNjtduzatQthYWGoqKi45Wtra2sxbtw4DBw4EL/t0UPTl3dOTg4e\ne+wxmEwmPProo/jggw+UBV1nLQfylJGnlfninu+kDwYx+Tw9p/Rqa2uxYsUKJCQkIDY2FsuWLcPp\n06c9btuECRNcruR2Op2YMGECXnrpJQCto+mwsDAcOHCgzes++eQTREZGIjc3F6OGDNH85R1hNmPl\nypUoLCxE//79cfHiRY8/rxa+sKGMUUHs6jGa7f3xDGHfxSAmn6fHlN6iRYuQkpKC4OBgPP3009iz\nZ4/mKVmn04mQkBDU1NS4fM25c+cQERGBL774AgCwc+dOhIeHo6qqCg6HAy+++CIiIyOxe/duQ768\nFy9ejOTkZDgcDk2f3V2+ssWqUceG+sK54GQcBjH5PD2m9Hr36IENGzagvr5et3adPHkSMTExbl/3\n/vvvY8CAAbDZbACA0tJShIWFYejQoRg/fjxqa2sBGPPl7XA4MHbsWDz//PO69UNHfK1IyYgpZAbx\n3c1PiDqJzWaT6upqqa6uFpvNpts9Dx87Jika7pEiIvV2u6SlpUnPnj11aZeIyJdffikjR450+7rJ\nkyfLuHHjZOHChSIi4ufnJ83NzfL999/LG2+8IRERETddYxOR6ut/Wnq2S5cuUlxcLCUlJVJSUqLh\nTq4rLS2VwU6nDPfg2hEikuB0Smlpqd7Nuq2snBxZpeHfyarAQMnKyWnz30JDQ+VCc7M4NLTLISIX\n7XaxWCwa7kJKqP4lQHc2oytgvXkkkZWVhfz8fI+ubWhowL333osJEyYgJiYGFRUV2LJlC/r06YNj\nx44BaN0tKuCeezBKWk916n/9r4e0Hi6xVQTNHkyTAsChQ4dgtVpx5MgRzf3QEV8rUjJqBO9r/UD6\nYRCTYTqjAtabg3j48OG3rXruyKlTpzBw4EAEBAS0CcN33nkHUVFR+Gt+PiJ69cLDfn6371tp3de6\n2MMv702bNiE2NtbQ04x8tUjJiGfammsd3DgQhLwLg5gM0VkVsEYVz2jV2NgIs9mMpqYmt6/dvHkz\nrFYrVq5cieXLl2PMmDFtNgT5XXo6rCaT630rggIPv7yzs7MxceJEw8789eYfUh3R+9+4rz0rJ/0w\niEl3nV0B641Tep9//jkefPBBt65paGjArFmzEBcXh8OHDwNoPd5u9OjRyMvLA6Chb+XmkbErX952\nux2PPPIIcnNzPe+MdvhyEAP6HxvqK9XjpC8GMelKxa96rVN6/2Uy4YEHHkB5ebluBxisWLECCxYs\ncPn1R44cwaBBg5CRkXFT5faPP/6IsLAw7N+/X1vfyr+eGbvz5f3zzz8jOjr6lmfcat2C0ltnNNyh\n97GhvrCemvTFICZdqdimT4/wLywsxNChQxEXF4c333wTV65c0dQPU6dOxebNmzt8ndPpxJo1a2C1\nWts9wm7Lli2IjIzU1rci2Obhl3dlZSWsViuOHTumewHeyPh4r5vR8JRex4bqPdIm78YgJl2pmibW\nY0rP6XRi7969mDp1KiwWC5577jl89913Lrfh30eHUVFR+Pbbbzt8/RNPPIEhQ4bgxIkTHd4/OjhY\nc9/28fPz+Mt7w4YN6NOnD8IDA3UpwKuqqsLMmTNhNpsxyt/f8x8Yd2iRkt4jbfJeDGLSjeoKWD2n\n9E6fPo2cnBxYrVZMmjQJu3fvvuVOW7caHcaYzegq0u7o8MCBAxgwYACysrJcKujSq2+733MPzp8/\n73bfAq39G9Gli6b+dTgc2L59O5KSkhAdHY3XXnutdTcxFim1S6+RNnknBjHpxhsKb/Se0mtsbMS6\ndeuQkJCA+Ph4rFmzBo2NjW3ey53RYUtLC1asWIGwsDBs377dZ/pW64zDpUuX8Prrr6Nfv354+OGH\nUVJS0mYbTRYp0d2MQUy6UR0WvzJiSs/pdOLTTz9FSkoKQkNDkTxmDPp26+bW6PBPS5fi8ccfx8iR\nI/HDDz+49f4q+1brM/ggf38EBQXhqaeewldffXXb92GREt2tGMSkG2+sgDViSq+goAC9u3Rxe/Rm\nNZmQMmkS7Ha7R59DVd9qLcAb1bUrVq1a5dJ7sUiJ7kYMYtKVN67p1VNnLc+61bIgVX3b2e/LIiW6\n2zCISVd6rOkdNGgQNm3ahKtXr6r+ODcxcnlWR8uCFixY0OlbIKouwGOREt0NGMSkKz1GjMXFxZg4\ncSIsFguysrJw6NAh1R/rBqNGh64Ufv22Rw+YRTq1uthbnvsT3cl4DCLpKiAgQArWrpUp3bvLGTeu\nOyMiqWazFKxdK9OmTZPy8nI5fPiwRERESGpqqowYMUJWr14tly9fNqrpHdLryMVDR4+2OQbyf/Lz\nZfHs2VJ25Yp8Ul8vqSLS5d+u8ReRNBH538ZGyRWRCSIe923Xrl01tJ6IDKH6lwDdmfSsgG1pacGu\nXbuQnp6OoKAgZGRkYM+ePbdc12skvUaH/czmG6NDT5btLBGB9Xq/ae3bjnhjAR7RnYZBTIYxogL2\n/PnzyM/PR3x8POLi4pCXl4fa2lqDP0krvYLYKoIpU6agoqLC42n8P4vALGJ4dfHBgwfRLyTkji7A\nI1KNQUyGMqoC1ul0oqKiApmZmQgODkZqaio++uijNptE6E3P0eGSJUsQGhqKh/z8PL7XmB49sHDh\nwht9G2YyISogQHPfOhwOlJSUYNSoUYiOjsaTTz6JR3lOLpFhGMTUaYyqgL1y5QoKCwuRmJiIqKgo\n5ObmGlYYpGex1qghQ3S71+XLl1FWVoaQkBB8/fXXHn22uro65OXloV+/fkhKSsJ7770Hh8PBc3KJ\nDMYgpjvKkSNHkJ2dDavViuTkZBQXF+OXX37R7f6aly9dHx0atSwoPz8fDz30kFszA0ePHsXcuXMR\nHByMjIwMHDx48KbXcAtKIuMwiOmO1NTUhOLiYiQnJ8NqtSI7OxvffPON5vvqNTo0allQS0sLkpOT\nsXTp0nY/R0tLC8rKyjB+/HhERETg5ZdfRk1NTbvXcAtKImMwiOmOV11djdzcXERFRSExMRGFhYWa\nzhvWY3Ro5Prcs2fPIjw8HPv377+p7fX19XjrrbcQFxeHYcOGYePGjW7NGHALSiL9MYjprnHt2jWU\nlZUhNTUVwcHByMzMREVFhUfLoLSODo1eFrRjxw7Exsbe+MFRXV2NRYsWwWKxIC0tTdPyL25BSaQv\nEwCoXstM1Nlqa2vl3XfflfXr14u/v7/MmTNHMjIyxGq1unyPvxUXS/bcuTLY6ZSshgZJkX9txOEQ\nkZ0isiowUI6aTK0blUyf3ub60UOHyh/+8Q9J8/Az7BCRgqFDZe/hw7f8/5mZmVJTUyPdunWTvXv3\nyqxZs+TZZ5+V/v37e/iON7PZbHLp0iUREbFYLBIUFKTbvYnuGqp/CRCp5HQ6sWfPHmRkZCAoKAjp\n6en4+OOP0dLS4tL1WkaHehV+/aempia8/fbbuP/+++Hv749nnnkG9fX1mvqJiIzDETHRdZcvX5Zt\n27bJ+vXrpa6uTmbPni2zZs2S6Ohol653dXRos9mkrq5OmpubZUxiovy9vl6Gu9nWKhH571695MyF\nCze2raypqZHVq1fLunXrZNiwYZKdnS1BQUEyZcoUqaqqkr59+97UBhGR0NBQjmSJVFL9S4DIG1VV\nVSErKwsWiwUTJ07Ejh07ND33vN3JSgF+fgg3mTQVflVWVmLGjBkIDg7G/Pnzcfz48Tbv/eqrr2Ls\n2LG4evVqu6c7bd26lc92iRTgiJioHVevXpXS0lJZv369HD9+XGbOnCmZmZly3333uXyPX58l3w9I\nVn29TJK2z5Lni8iHIlIuIiM6uFeVtB7g8IclSyQqJkYKCgrkp59+koULF0pmZqaEhITcdM21a9ck\nIT5eLvzznzLC3/+WbfhQRFb17Cn/5+d3y+fZRGQg1b8EiHzFyZMnkZOTg969eyMpKQkbN25EQ0ND\nu9e4Wl1dLK17UCeKtLssKDwwEE9On46+ffti9OjR2L59e4ebdxT85S/o260b1/8SeSmOiInc5HA4\npKysTIqKimTfvn2Snp4uc+bMkREjRojJZLrxur8VF8vi2bPli6Ym6efCfe0isk5EXjGZ5Bc/Pwnr\n1k1ERC7a7RIfGyuBkZFSVVUlkydPluzsbBk+vOMny+62QaT12MQks1neKCriyJioEzCIiTQ4e/as\nbNy4UYqKiqRXr14yZ84cmTFjhpjNZokJD5fyK1c8KsSaGBgoeysrZd++fbJ582Y5ceKEzJs3T+bN\nmycREREu3ae5uVlTG/6zGIyIjMEgJtKB0+mUzz77TIqKiqS8vFwGDx4s/ocOyWdNTR7db3RAgHwX\nEiKRkZGSnZ0t06ZNk4CAALfusW3bNin6/e9ld0ODR20Y27OnPFNYKNM5KiYyFIOYSGd1dXWSNGSI\n/OncOU2bdfz5N7+Rg6dOtZnudofRG4YQkT4YxEQ6s9lsEhUWJpcdjhuVye5yiEiIv7+cvXDBozW+\n3tAGInKNn+oGEN1p6urqJCwgwOMAFBHxFxFr1643NgjxxTYQkWsYxERERAoxiIl0FhoaKheam8Wh\n4R4OaV22ZLFYfLYNROQaBjGRzoKCgmRYfLx8qOEeO0VkeEKCx89mvaENROQaBjGRAbJycmRVz54e\nX78qMFCycnJ8vg1E1DFWTRMZwBs20/CGNhBRxzgiJjJAQECAFKxdK1O6d5czblx3RloPdShYu1Zz\nAHpDG4ioYwxiIoNMmz5d/rh8uSR17y5VLry+Slr3eP7jsmW67fHsDW0govZxaprIYL8egzjY6ZSs\nhgZJkbZHEO6U1uexR00mw44g9IY2ENGtMYiJOoHdbpfS0lJZlZcnh44eFev1Kd+LdrsMT0iQrJwc\nSUtLM3Qq2BvaQEQ3YxATdTKbzXZjtyqLxaJkeZA3tIGIWjGIiYiIFGKxFhERkUIMYiIiIoUYxERE\nRAoxiImIiBRiEBMRESnEICYiIlKIQUxERKQQg5iIiEghBjEREZFCDGIiIiKFGMREREQKMYiJiIgU\nYhATEREpxCAmIiJSiEFMRESkEIOYiIhIIQYxERGRQgxiIiIihRjERERECjGIiYiIFGIQExERKcQg\nJiIiUohBTEREpBCDmIiISCEGMRERkUIMYiIiIoUYxERERAoxiImIiBRiEBMRESnEICYiIlKIQUxE\nRKQQg5iIiEghBjEREZFCDGIiIiKFGMREREQKMYiJiIgUYhATEREpxCAmIiJSiEFMRESkEIOYiIhI\nIQYxERGRQgxiIiIihRjERERECjGIiYiIFGIQExERKcQgJiIiUohBTEREpBCDmIiISCEGMRERkUIM\nYiIiIoUYxERERAoxiImIiBRiEBMRESnEICYiIlKIQUxERKQQg5iIiEghBjEREZFCDGIiIiKFGMRE\nREQKMYiJiIgUYhATEREpxCAmIiJS6P8BhjN756z+x48AAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0xe299da0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "#Imports that should really be at the top of the notebook \n",
    "#import networkx\n",
    "# Allows plots to be showed inline \n",
    "#import matplotlib\n",
    "#%matplotlib inline\n",
    "\n",
    "# Preform a cypher query to get 50 instances where a person worked on an award\n",
    "# Note, I am using %cypher here beasue that dataframe formate is easier for networkx to convert \n",
    "#results = %cypher http://neo4j:upintheA1R!!@localhost:7474/db/data MATCH d = (p) -[r]-> (a:Award) RETURN d LIMIT 50\n",
    "results = graph_db.data(\"MATCH (p) -[r]-> (a:Award) RETURN p.employeeid, a.award_num LIMIT 50\")\n",
    "\n",
    "# Convert The results to a dataframe \n",
    "results_df =pandas.DataFrame(results)\n",
    "\n",
    "# This will make  the connections between the nodes easier to see \n",
    "results_df['weight'] = .01\n",
    "\n",
    "# Uncomment this next line if you would like to see what the data looks like \n",
    "#print(pandas.DataFrame(results_df))\n",
    "\n",
    "# Convert to graph object\n",
    "#graph = results.get_graph()\n",
    "graph = networkx.from_pandas_dataframe(results_df, 'p.employeeid', 'a.award_num', ['weight'])\n",
    "\n",
    "\n",
    "# Create a Color Map so the Graph will be colored \n",
    "# color_map =[]\n",
    "# for node in graph.nodes(data =True):\n",
    "#     print node\n",
    "    # I'm going to cheat a little to create colors\n",
    "    # if the a node id is 6 or less charters long, i know its a \n",
    "    # award \n",
    "#     this_labels = node[1]['labels']\n",
    "#     if 'Employee' in this_labels:\n",
    "#         color_map.append('green')\n",
    "#     elif 'Student' in this_labels:\n",
    "#         color_map.append('yellow')\n",
    "#     elif 'Award' in this_labels:\n",
    "#         color_map.append('red')\n",
    "\n",
    "# # Draw the graph \n",
    "# networkx.draw(graph, node_color = color_map)\n",
    "networkx.draw(graph)\n",
    "\n",
    "\"\"\"\n",
    "Notes \n",
    "Green Nodes are Employees\n",
    "Yellow Nodes are Students\n",
    "Red Nodes are Awards\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Network Analysis \n",
    "The networkx module also has built in tools to analyse graphs. The following measurements are used to acess how the nodes are related to each other in the graph database.  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Network Measurments \n",
    "This is the vacab for studing a network \n",
    "\n",
    " **Degree Centrality ** - counts the number of edges that a node has \n",
    "     - Nodes with a high degree of connections usally play an important role in a network \n",
    " **Betweenness ** - indicator of a nodes centality in a network. \n",
    "     - Equal to the number of shortest paths from all vertices to all others that pass through that node \n",
    " **Diameter** - The longest shrortest path over all pairs of nodes \n",
    "     - Often we want to find the shortest distance between two nodes, the diameter is the longest of theses paths \n",
    "     - Nodes that occur on many shortest paths between other nodes in the graph have a high betweenness centrality score  \n",
    " **Cliques ** - A clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.  \n",
    "     \n",
    "     \n",
    "Lets look how these measurements look on a sample set of data.\n",
    "  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Run the Cell Below to create one of Networkx eample graphs, the Maze Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Tuttle Graph\n",
      "-------------\n",
      "Number of Nodes: 8\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3XlYlOXiPvAbdEB2ZXFfQHEBJMal3LDcygU0xVOgpadE\noYhQieL3LcsMO0dyKTvKCQgr84Ro4gK4b6VZ5hcU2dxN1DQRdZRtZmDe3x/mfOPgBszMM8Pcn+vi\nj3LemXu6urx5nvd9nsdCkiQJREREJISl6ABERETmjEVMREQkEIuYiIhIIBYxERGRQCxiIiIigVjE\nREREArGIiYiIBGIRExERCcQiJiIiEohFTEREJBCLmIiISCAWMRERkUAsYiIiIoFYxERERAKxiImI\niARiERMREQnEIiYiIhKIRUxERCQQi5iIiEggFjEREZFALGIiIiKBWMREREQCsYiJiIgEYhETEREJ\nxCImIiISiEVMREQkEIuYiIhIIBYxERGRQCxiIiIigVjEREREArGIiYiIBGIRExERCcQiJiIiEohF\nTEREJBCLmIiISCAWMRERkUAsYiIiIoFYxERERAKxiImIiARiERMREQnEIiYiIhKIRUxERCQQi5iI\niEggFjEREZFALGIiIiKBWMREREQCsYiJiIgEYhETEREJxCImIiISiEVMREQkEIuYiIhIIBYxERGR\nQCxiIiIigVjEREREArGIiYiIBGIRExERCcQiJiIiEohFTEREJFBz0QGoNoVCgdLSUgCAi4sLnJyc\nBCciIiJ94ojYCCiVSqSmpmKoXI4Obm4Y6eeHkX5+6ODmhqFyOVJTU6FSqUTHJCIiPbCQJEkSHcKc\npa1di9nh4fCVJETcuYPx+L9pCjWADAAJ9vbIt7TE8sREBIeEiAtLREQ6xyIW6PNly7Bk3jxsrKxE\nv0e8NhvAJFtbxMTFISo62hDxiIjIAFjEgqStXYu3Z8zAwcpKdH7Ma4oB+NvaYnFKCkfGRERNBItY\nAKVSiS6tW2Pr7dvoW89rswEEODqiuKQEVlZW+ohHREQGxIe1BEhPT0dvjabeJQwA/QD4aDRIT0/X\ndSwiIhKAI2IBhsrlmJubi6AGXr8BwHK5HD8eParLWEREJACL2MAUCgU6uLnhllrd4EXcagCtZDJc\nLinhOmMiIhPHqWkDKy0thZu1daN2UpEBcLWywo0bN3QVi4iIBGERExERCcQiNjAXFxeUKJVQN+I9\n1ACuq1RwdnbWVSwiIhKERWxgTk5O6OPtjYxGvMcWAH19fHh/mIioCWARCxARG4sEe/sGX5/g4ICI\n2FgdJiIiIlH41LQA3NCDiIju4YhYAGtrayxPTMREGxsU1+O6YgDPt2iB5YmJLGEioiaCRSxIcEgI\nYhYuhL+NDbIf4/XZAAZZWaGsWTP06NlT3/GIiMhAODUt2L1jEHtrNIgoK8ME1D4GcQvu3hMusLDA\n8sRENJfJEBERgR07dkAul4sLTkREOsEiNgIqlQrp6elIiI9HTkEBXP+cdr6uUqGvjw8iYmMRFBSk\nnY5ev3493nzzTezYsQN+fn4ioxMRUSOxiI2MQqHQ7pjl7Oz8wCVK69atQ1RUFHbu3IknnnjCkBGJ\niEiHGrPTIumBk5PTY60PfvHFF6HRaDB69Gjs2rULvXv3NkA6IiLSNRaxCQsJCYEkSXj22Wexe/du\n+Pj4iI5ERET1xCI2cVOmTKlVxt7e3qIjERFRPbCIm4CpU6dCo9Fg1KhR2LNnD7y8vERHIiKix8Qi\nbiJefvnlWmXcq1cv0ZGIiOgxsIibkOnTp0OSJIwcORJ79+5FT278QURk9FjETczf//53aDQabRn3\n6NFDdCQiInoIFnET9Oqrr9Yq4+7du4uORERED8AibqJCQ0MhSRJGjBiBffv2wdPTU3QkIiK6DxZx\nEzZz5kxoNBptGXfr1k10JCIi+i8s4iYuLCys1si4a9euoiMREdFfsIjNQHh4ODQaDYYPH84yJiIy\nMixiM/H6669rp6n3798Pd3d30ZGIiAgsYrPyxhtvaEfG+/fvR5cuXURHIiIyeyxiM/Pmm2/WKuPO\nnTuLjkREZNZYxGZo9uzZkCRJW8adOnUSHYmIyGyxiM3UnDlzapVxx44dRUciIjJLLGIzNnfu3FrT\n1B06dBAdiYjI7LCIzdxbb70FjUaDYcOGsYyJiARgERPefvvtWiPj9u3bi45ERGQ2WMQEAIiNja1V\nxu3atRMdiYjILLCISet//ud/apVx27ZtRUciImryWMRUy3vvvVerjNu0aSM6EhFRk8Yipjref/99\n7UERe/fuZRkTEekRi5ju64MPPoBGo8HIkSOxd+9etG7dWnQkIqImiUVMDzR//vxaZezm5iY6EhFR\nk8MipgeysLDAggULtGW8Z88eljERkY6xiOmhLCwsEBcXB41Gg1GjRmHPnj1wdXUVHYuIqMlgEdMj\nWVhY4OOPP65Vxi4uLqJjERE1CRaSJEmiQ5BpkCQJsbGx2LVrF/bs2QNnZ2fRkYiITB6LmOpFkiS8\n/fbb2Lt3L3bv3s0yJiJqJBYx1ZskSYiJicEPP/yAXbt2oVWrVqIjERGZLBYxNYgkSYiOjsbBgwex\na9cutGzZUnQkIiKTxCKmBpMkCXPmzMHPP/+MnTt3soyJiBqARUyNIkkSoqKi8Ouvv2Lnzp1wcnIS\nHYmIyKSwiKnRJElCZGQksrOzsXPnTjg6OoqORERkMljEpBOSJOGNN97AsWPHsH37dpYxEdFjYhGT\nzmg0GkRERCAvLw/bt2+Hg4OD6EhEREaPRUw6pdFo8Prrr6OgoADbtm1jGRMRPQKLmHROo9EgPDwc\nJ06cwLZt22Bvby86EhGR0WIRk15oNBrMmjULp0+fxtatW1nGREQPwCImvdFoNAgNDcX58+eRlZUF\nOzs70ZGIiIwOi5j0qqamBqGhobhw4QKysrJga2srOhIRkVFhEZPe1dTU4NVXX8Xly5eRkZHBMiYi\n+gsWMRlETU0NXnnlFVy5cgUZGRmwsbERHYmIyCiwiMlgampqMH36dJSUlGDz5s0sYyIiAJaiA5D5\naNasGb755hu4urpi4sSJqKysFB2JiEg4jojJ4Kqrq/Hyyy/j1q1b2LRpE1q0aCE6EhGRMCxiEqK6\nuhpTp07FnTt3sHHjRpYxEZktFjEJo1arMXXqVFRUVCA9PR3W1taiIxERGRyLmIRSq9UICQmBUqnE\nhg0bWMZEZHZYxCScWq1GcHAwqqur8f3338PKykp0JCIig2ERk1FQqVQIDg6GJElYt24dy5iIzAaX\nL5FRsLKyQlpaGiRJQnBwMFQqlehIREQGwRExGRWVSoW//e1vaN68OdLS0iCTyeq8RqFQoLS0FADg\n4uICJycnQ8ckItIZjojJqFhZWWH9+vVQqVSYMmUK1Go1AECpVCI1NRVD5XJ0cHPDSD8/jPTzQwc3\nNwyVy5GamspRNBGZJI6IySgplUoEBQXB1tYWEydOxFsREfCVJETcuYPxAJr/+To1gAwACfb2yLe0\nxPLERASHhIgLTkRUTyxiMlpVVVXoL5fj+pkzyKqpQb9HvD4bwCRbW8TExSEqOtoQEYmIGq35o19C\nJMbmTZtwu7gYv9bUoPNjvL4fgIMVFfB//320ad+eI2MiMgkcEZNRUiqV6NK6Nbbevo2+9bw2G0CA\noyOKS0q4DIqIjB4f1iKjlJ6ejt4aTb1LGLg7MvbRaJCenq7rWEREOscRMRmloXI55ubmIqiB128A\nsFwux49Hj+oyVpPHpWFEhsciJqOjUCjQwc0Nt9TqBj/EoAbQSibD5ZISlskjKJVKpKenIyE+HkcL\nC+H2537fJUol+nh7IyI2FpMnT+Y0P5GecGqajE5paSncrK0b9SShDICrlRVu3Lihq1hNUtratejS\nujVWhYcjOjcXt9RqnC8rw/myMtxUqzE3NxcpYWHo7OaGtLVrRcclapL41DSRmfp82TIsmTcPWZWV\n910aJgMQBCCorOzu0rDQUPzx++9cGkakY5yaJqNzb2r6plqNuhtcPh5OTT9c2tq1eHvGDBysrHys\npWEAUAzA39YWi1NSuDSMSIdYxGSUdPGwVlzXrsg+dQrNmjXTZTSTx6VhRMaF94jJKEXExiLB3r7B\n1y+3tsYdAF27dkVcXBwuX76su3AmjkvDiIwLi5iMUlBQEPItLZHTgGuzAZyytkZRURE2btyI33//\nHb6+vnj++eeRlZWFmpoaXcc1KQnx8YgoK2vw9RFlZUiIj9dhIiLzxqlpMlq6vI9ZVlaGtLQ0JCYm\n4urVq5g5cyZmzJiBjh076iW7seLSMCLjwxExGa3gkBDELFwIfxsbZD/G67Nxt4Rj4uLqPExkb2+P\n0NBQ/Prrr9i8eTOuXr2KJ554AhMmTDCrUTKXhhEZHxYxGbWo6GgsXrUKAY6OGGVvj3QA1X/5czXu\nPpg10sEBAY6OWJyS8sjlNX369EFCQgKKi4vx/PPP46OPPoKHhwcWLFiAS5cu6fHbEBHVxSImoxcc\nEoLikhLMTE7GZ3I5HCws0NHaGu52dmglk2G5XI5ZSUkoLimp17Kae6Pkw4cPY8uWLbh27Zp2lJyZ\nmdmkRsk3b97EgQMHsGnTJlytqIC6Ee+lBnBdpYKzs7Ou4hGZNd4jJpPTvn17pKWloWPHjnB2dtbp\nfcry8nKkpaUhKSkJly9fRmhoKEJDQ9GpUyedfYY+lZeXo7CwEPn5+bV+7ty5Ax8fH/j6+uJAVhY+\n/v137uNNZCRYxGRS/vjjD3h5eaG0tBQWFhZ6/azc3FwkJSUhNTUVQ4YMQVhYGMaOHYvmzcVvSKdS\nqXDq1KlaZZuXl4crV66gZ8+e6N27d62fzp07a/97paamIiUsDLsb+OT0SAcHzEpKQgg39SDSCRYx\nmZTt27dj8eLF2LNnj8E+s7y8HOvWrUNSUhIuXbpk0FFyTU0Nzp8/X2eEe/bsWbi7u9cp3G7duj3y\nFwVu6EFkXFjEZFL+8Y9/4ObNm1i8eLGQz8/NzUVycjK+++47DB48GGFhYRg3blyjR8mSJOHy5ct1\nCreoqAhubm7w9fWtVbg9e/ZEixYtGvx5DV0aNsjKCsu++YZbXBLpEIuYTMrf/vY3TJ48GVOmTBGa\no7y8HOvXr0diYiIuXryoHSV37vzoWistLa1TuPn5+bC2tq4zwvX29oajo6NevsO9Qx82PuDQh7/K\nBvC8tTUqrKzwj08+wWuvvaaXTETmiEVMJqVr167Ytm0bevbsKTqK1vHjx7Wj5IEDByI8PBzjxo1D\nZWXlfR+cqqysrFO4Pj4+cHNzM3j2tLVrMTs8HL01GkSUlWEC/u9INjWALQASHBxQYGGB5YmJ6P/k\nkxgzZgyCg4MRFxen9/v0ROaARUwm4+bNm+jcuTMUCgUsLY1n5Z1SqcSJEyeQnZ2N9PR0HDp0CLdv\n34aFhQV69uyJfv361Zpa7tChg1EVmEqlQnp6OhLi45FTUADXP+/9Xlep0NfHBxGxsQgKCtLeEy4p\nKUFgYCC8vLyQnJwMmayhZ2QREcAiJhOyd+9ezJ8/HwcOHBDy+TU1NTh79mydJ5V/++03dO3atdYI\nVyaTYceOHfjuu+8wYMAAhIeHIyAgwCieuH4YhUKh3THrYUvDysvLERISArVaje+//x72jTigg8jc\nsYjJZCxZsgQXL17E8uXL9fo5kiTh4sWLdaaUT5w4gXbt2tWZVu7Rowesra3v+14VFRVYv349kpKS\n8Ntvv2HGjBmYOXMmunTpotfvYAjV1dWIiIhAdnY2srKy0LZtW9GRiEwSi5hMxtSpUzF69Gj8/e9/\n19l7Xrt2rU7hFhQUwM7ODr179641pezl5dWokV9+fj6Sk5OxZs0aDBgwAGFhYQgICDDpqV1JkhAX\nF4evv/4a27dvR48ePURHIjI5LGIyGb169cL69evh6+tb72tv376NgoKCWlPK+fn5UKvVdZYG+fj4\nwMXFRQ/f4K6Kigp8//33SEpKwrlz57SjZHd3d719pr6lpKTgvffew6ZNmzBw4EDRcYhMCouYTEJZ\nWRnatGkDhULx0PuslZWVOHHiRJ1RbmlpKby9vetMK7dr107og1MFBQVISkrCmjVr8NRTTyEsLAyB\ngYEmOUrOysrCK6+8glWrVmH8+PGi4xCZDBYxmYSffvoJc+fOxa+//grg7v3J06dP1ync4uJieHp6\n1plWdnd3N6onrf9bZWWldpR89uxZkx0lHzlyBBMmTMCHH36I8PBw0XGITAKLmIyaRqNBcXEx/vnP\nf+LYsWPo3r078vLycOrUKXTs2LHOCLd79+4mv/ViQUGB9l5y//79ERYWhvHjx5vMKPnMmTMYM2YM\npk6digULFhjVUi0iY8QiJqMgSRL++OOP+z441bJlS0iSBG9vb7z00kvaB6dsbW1Fx9aryspKbNiw\nAYmJiThz5ox2lOzh4SE62iNdu3YNAQEB8PX1RWJiosn8EkEkAouYDO7mzZu1Hpy69wOgzpSyj48P\nWrZsCT8/P6SkpKB///6C04tRWFiI5ORkfPvtt+jXrx/Cw8ONfpRcVlaG4OBgSJKEdevWca0x0QOw\niI2MQqFAaWkpAMDFxUWnZ+0aWkVFBYqKiuo8qaxQKODj41NnWrlNmzb3ncasqqqCs7Mzbty40aiD\nDpqCqqoq7Sj59OnTePXVVzFz5kx07dpVdLT7qq6uxmuvvYZjx44hKysLbdq0ER2JyOiwiI2AUqnU\nbjF4tLAQbn9uDlGiVKKPtzciYmMxefJko733qVar65yNm5+fj8uXL6NHjx73PRu3Pg9OHTlyBLNm\nzcKxY8f0+C1MT1FRkXaU3KdPH4SHh2PChAlGN0qWJAkLFizAt99+i+3bt6N79+6iIxEZFRaxYPc2\n3feVJETcuYPxqL3pfgaABHt75FtaYnliotDj5zQazX3Pxj1z5gw6d+5cZ1rZ09NTJ1s6JiYm4vDh\nw1i1apUOvkXTc2+UnJSUhJMnT2pHyd26dRMdrZbk5GR88MEH2Lx5M5566inRcYiMBotYoPoeQzfJ\n1hYxcXGIio7Way5JknDlypU6hVtYWAgXF5c6I9xevXrBxsZGb3nCw8Ph6+uLyMhIvX1GU3HixAkk\nJydj9erV6NOnD8LCwjBhwgSjmU3JzMzEjBkzsGrVKgQGBoqOQ2QUWMSCNPRgdn9bWyxOSdHZyPjG\njRv3PRtXJpPd92xcEfesn3zySSxfvhyDBw82+GebqqqqKqSnpyMpKQknTpzAK6+8glmzZhnFKPnw\n4cOYOHEi4uLiMHPmTNFxiIRjEQugVCrRpXVrbL19G33reW02gABHRxSXlNRrlFNWVnbfs3HLysq0\nRXtvWtnHxwetW7euZzL9UKvVcHJyQklJCezs7ETHMUl/HSXL5XKEhYXh+eefFzpKPn36NMaMGYNp\n06Zh/vz5XGtMZo1FLEBqaipSwsKwu6ysQdePtLfHrORkhNxnVKxSqXDy5Mk6TypfvXoVvXr1qjPK\n7dSpk1H/JXj8+HEEBwejqKhIdBSTV1VVhY0bNyIpKQlFRUV45ZVXMHPmTHh6egrJ88cffyAgIABy\nuRxffPGF0R8RSaQvLGIBhsrlmJubi6AGXr8BwGd+fli1fn2dEe65c+fg4eFRp3C7deuGZs2a6fJr\nGMTXX3+NXbt24T//+Y/oKE3KyZMntaPkJ554AmFhYZg4caLBR8llZWV44YUXYGlpiXXr1nHWg8wS\ni9jAFAoFOri54ZZajYb+/q8GYA+gbefOeOKJJ2pNK/fs2fOBZ+OaoqioKHTp0gVvvfWW6ChNklKp\nxMaNG5GYmIjCwkLtvWRDjpLVajXCwsJQUFCAzMxMo7ktQmQoLGIDO3fuHEb6+eF8A6el73G3s8O+\nvDyT2O6wMfz9/REXF4fhw4eLjtLknTp1CsnJyfjmm2/g6+uL8PBwg42SJUnC/PnzkZqaim3btgmb\nLicSwXiPoyGzV1NTg9zcXPTp00d0FLPQo0cPLF68GBcvXkRYWBi++OILdOrUCe+88w5Onz6t18+2\nsLDARx99hJiYGAwdOhRHjhzR6+cRGRMWsYG5uLigRKmEuhHvoQZwXaWCs7OzrmIZpdOnT6N169Zo\n2bKl6ChmxdraGsHBwdi7dy8OHDgAABgyZAhGjBiBtLQ0KJVKvX12eHg4EhMTMW7cOGzdulVvn0Nk\nTFjEBubk5IQ+3t7IaMR7bAHQ18fHpPehfhw5OTno27e+C7xIl3r06IFPPvkEFy9eRHh4OJKSktCp\nUye8/fbbOHXqlF4+c8KECdiyZYt24w+ipo5FLEBEbCwSGnESTYKDAyJiY3WYyDixiI3HvVHynj17\n8NNPP8HS0hJDhw7FiBEjsHbtWp2PkgcNGoQff/wRCxcuxEcffQQ+ykJNGR/WEqCxG3qMtbfHpdJS\no9m2UF9GjBiB2NhYjB49WnQUug+lUonNmzcjKSkJx48fx/Tp0xEWFoYePXro7DOuXr2KgIAA9OvX\nDwkJCVxrTE0SR8QCWFtbY3liIiba2KC4HtcVAxgvk6HKwgKZmZn6imcUJElCTk4OH9QyYtbW1njx\nxRexe/duHDp0CM2aNcPQoUMxfPhwpKam6mSU3LZtW+zfvx8XLlzApEmTUF5eroPkRMaFRSxIcEgI\nYhYuhL+NDbIf4/XZuLvP9P9btAi7du1CTEwM3njjDVRVVek7qhDnz5+Hvb0915SaCE9PT8THx+Pi\nxYuIiIjAqlWr0KlTJ8TExODkyZONem8HBwdkZmbC2dkZI0eORElJiY5SExkHFrFAUdHRWLxqFQIc\nHTHK3h7pAKr/8udq3N1Fa6SDAwIcHbE4JQVR0dEYMGAAcnJyUFJSgoEDBzb6LzpjxPvDpsnKygov\nvPACdu3ahUOHDqF58+Z45plnMGzYsEaNkmUyGb7++muMHDkSQ4YMwdmzZ3WcnEggiYRTKpVSamqq\nNFQul+xkMqmLnZ3Uxc5OspPJpKFyuZSamioplco612k0GikxMVFydXWVvv76awHJ9efdd9+V5s+f\nLzoG6YBSqZTWr18vjRo1SnJ1dZWio6OloqKiBr9fQkKC1K5dO+nIkSM6TEkkDh/WMjIKhQI3btwA\nADg7Oz/WEqW8vDwEBwejf//+WLlyJRwcHPQdU+/Gjh2L119/HRMmTBAdhXTo7Nmz+PLLL/HVV1+h\nV69eCAsLQ1BQEFq0aFGv99m0aRNmzZqFb7/9FmPGjNFTWiLDYBE3EeXl5Zg9ezYOHDiAtLQ0yOVy\n0ZEaTJIktGnTBjk5OejYsaPoOKQHKpUKGRkZSExMxNGjRzFt2jSEhYWhV69ej/0ehw4dQlBQEBYt\nWoRXXnlFf2GJ9Iz3iJsIOzs7fPnll/jwww/x7LPPYsWKFSa79vL3338HAHTo0EFwEtIXKysrTJ48\nGTt37sThw4fRokULDB8+HM888wz+85//PNZDiIMHD8b+/fuxYMECLFy40GT/fyfiiLgJOnPmDIKD\ng9G5c2ekpKSY3FaYGRkZWLlyJbZv3y46ChmQWq3Gli1bkJSUhJycHEybNg2zZs2Cl5fXQ6+7cuUK\nxo0bhwEDBmDFihUPXGusUChQWloK4O5Ws019ZzoyHRwRN0Genp44dOgQ3N3d0adPH/z000+iI9UL\nn5g2TzKZDJMnT8aOHTtw+PBh2NjYYMSIEXj66aexZs2aB46S27Vrhx9++AHnzp3D5MmTUVFRof0z\npVKJ1NRUDJXL0cHNDSP9/DDSzw8d3NwwVC5HamoqVCqVob4i0f0Je0yMDGLLli1SmzZtpI8//liq\nqakRHeexTJgwQVq/fr3oGGQEVCqVtGHDBmn06NGSi4uLNGfOHKmgoOC+r1UqldLLL78sDRw4UCop\nKZHWpqZKbRwdpVEODlI6IKkBSfrzRwVIGwBppL291MbRUVqbmmrgb0b0fzg1bQYuXbqEqVOnwtra\nGt9++y3atm0rOtJDderUCT/88AO6du0qOgoZkfPnz+PLL7/EqlWr4OnpifDwcEyePBk2Njba10iS\nhHfffRdff/klmpeVYVNVFfo94n2zAUyytUVMXByioqP1+h2I7odT02agY8eO2Lt3LwYNGoS+ffti\n586doiM90LVr13Dnzh14eHiIjkJGxsPDAx9//DGKi4sRHR2NNWvWoFOnTpgzZw4KCwsB3D3XWO7n\nBwuFAj89RgkDQD8ABysqsOT995G2dq1evwPR/XBEbGb27duHadOmYdq0afjoo48gk8lER6plx44d\nWLRoEfbt2yc6CpmA8+fPIyUlBatWrULXrl0xY8YMvDt3boMPVAlwdERxSUmTP1CFjAtHxGZm+PDh\nyMnJwbFjx/DMM8/gwoULoiPVwge1qD48PDywcOFCXLhwAW+99RaWL18O9waUMHB3ZOyj0SA9PV3X\nMYkeikVshlq3bo2srCwEBQXhySefNKq/eI4ePcoipnqTyWSYNGkSHC0s8E4j3ieirAwJ8fE6y0X0\nODg1beYOHz6MKVOmYOzYsVi6dGm9txrUNU9PT2RkZDxy7SjRf1MoFOjg5oZbajUaemqxGkArmQyX\nS0q4zpgMhiNiM2dMJzndunULV69e1enB8mQ+SktL4WZt3eASBgAZAFcrK+1+70SGwCImtGzZEmlp\naYiIiIC/vz+++eYbITmOHTsGPz8/NGvWTMjnExGJwCImAHeXfYSFhWHv3r2Ij4/H9OnTcefOHYNm\n4INa1BguLi4oUSqhbsR7qAFcV6lMbltYMm0sYqrF19cXR44cgZWVFfr374+jR48a7LNZxNQYTk5O\n6OPtjYxGvMcWAH19fHh/mAyKRUx1/PUkp+eeew7/+te/DHKyDYuYGisiNhYJ9vYNvn6ZTIa/R0bq\nMBHRo/GpaXooQ53kVF5eDjc3NygUCqPbZIRMh1KpRJfWrRu8occImQw2zs5YtGgRpk+fDktLjlVI\n//h/GT2UoU5yys3Nhbe3N0uYGsXa2hrLExMx0cYGxfW4rhh395tOWr0aGRkZ+Pe//w1/f3/k5OTo\nKyqRVrMPP/zwQ9EhyLg1b94cY8aMgaenJ15++WWoVCoMGTIEFhYWOvuMzZs3w9LSEuPHj9fZe5J5\n6t27N5raBQsNAAASzUlEQVTZ2GDmgQN4uroa7R/x+mwAo/889CF01ix06NABoaGhsLCwQGhoKM6e\nPYvBgwfXOlyCSJc4IqbHNn78ePzv//4vtm/fjtGjR+Pq1as6e2/eHyZdioqOxuJVqzDOwQEDAaQD\nqP7Ln6sBbAAw0sEBAY6OWJySUuvkJUtLS4SGhqKoqAjNmzeHl5cXkpKSUFNTY9gvQmaBRUz1cu8k\np8GDB+v0JCdubUm6FhwSgqjYWMj8/fGZXI6WMhnc7ezgbmeHVjIZlsvlmJWUhOKSEgSHhNz3PVq1\naoV//etf2LFjB1avXo2BAwfi8OHDBv4m1NTxYS1qMF2d5KRUKtGqVSuUlpZy+o90RqVSoWvXrsjK\nyoKfnx8UCoV2xyxnZ+d6L1GSJAlr1qxBbGwsxo4di0WLFsHNzU0f0cnMcERMDaark5zy8/Ph6enJ\nEiadWrt2LXr16gU/Pz8Ad9cZe3h4wMPDo0HrhC0sLDBt2jScOHECLVu2hI+PD1asWIHq6upHX0z0\nECxiapSGnuSkUChw7tw5nDt3DgcPHuS0NOmUJElYunQpYmJidP7ejo6OWLp0Kfbt24f09HT0798f\nBw8e1PnnkPng1DTpzKNOclIqlUhPT0dCfDyOFhbCzdoaAHC1ogLubdvigyVLMHnyZB7KTo22e/du\nzJkzB3l5eTp9uv+/SZKEdevWISYmBsOGDcMnn3yCdu3a6e3zqGniiJh05mEnOaWtXYsurVtjVXg4\nonNzcUutxvmyMpwvK8NtjQYf//47UsLC0NnNDWlr1wr8FtQULF26FNHR0XotYeDudHVwcDCKiorQ\nsWNH+Pr6YtmyZVCrG7PjNZkbjohJ5yRJQnJyMt577z0sWbIEitJSLJk3DxsrK9HvEddm4+7GCjFx\ncbWWkxA9rvz8fDz77LP47bffYP3nrIuhnDx5ElFRUbh48SJWrFiBESNGGPTzyTSxiElv8vLyMHbM\nGFT/8Qd+ralB58e8rhiAv60tFqekPHBZCdGDzJgxA127dsW8efOEfL4kSdi0aRPmzp2LAQMGYMmS\nJejUqZOQLGQaWMSkN43d9zfA0RHFJSW8Z0yP7erVq/D29sbp06fh4uIiNEtFRQXi4+OxcuVKxMTE\nYO7cuQYfoZNp4D1i0pv09HT01mjqXcIA0A+Aj0bz2E9hEwHAihUrMGXKFOElDAC2trZYsGABDh8+\njEOHDsHX1xfbt28XHYuMEEfEpDdD5XLMzc1FUAOv3wBguVyOHw14JjKZrvLycri7u+Pnn3+Gp6en\n6Dh1ZGVlYfbs2fD19cWnn34Kd3d30ZHISHBETHqhUChwtLAQExrxHhMA5BQUQKFQ6CoWNWFff/01\n/P39jbKEASAgIAD5+fno168f+vXrh48++giVlZWiY5ERYBGTXpSWlsLN2hrNG/EeMgCuVlbabQmJ\nHqSmpgaffvqpXjbw0KUWLVpg3rx5yMnJwfHjx+Hj44MtW7aAE5PmjUVMRCZvy5YtcHV1xeDBg0VH\neSxdunTB999/jy+++ALvvPMOAgMDcebMGdGxSBAWMemFi4sLSpRKNGZbAzWA60olnJ2ddRWLmqil\nS5firbfe0vsGHrr23HPP4fjx43jmmWcwcOBAzJs3D+Xl5aJjkYGxiEkvnJyc0MfbGxmNeI8tAGSS\nhGHDhuH999/H4cOHodFodBWRmohffvkFly9fxqRJk0RHaRArKyu88847yM3Nxblz5+Dt7Y0NGzZw\nutqM8Klp0pvU1FSkhIVhd1lZg64f6eCAGf/+Nzp37ozMzExkZmbi+vXrGDduHAIDA/Hss8/C0dFR\nx6nJ1Lzwwgvw9/fH7NmzRUfRif379yMyMhLt2rXD559/Di8vL9GRSM9YxKQ3+tjQ4/z588jKykJm\nZiZ++uknDBw4EIGBgQgICDDap2VJf86fP48nn3wS58+fh4ODg+g4OqNWq7Fy5UosXLgQM2bMwPvv\nv9+kvh/Vxqlp0htra2ssT0zERBsbFNfjumLc3W96eWJinV21PDw8EBkZie3bt+PKlSt44403kJeX\nh6FDh6JXr16IiYnB/v37uem+mfjss88wc+bMJldSMpkMc+bMQX5+Pq5duwYvLy+kpqZyurqJ4oiY\n9O7zZcv0fuiDRqNBTk6Odgr77NmzGD16NAIDAzF27Fij2GmJdOvmzZvo1q0b8vLy0KFDB9Fx9OrQ\noUOIjIyEg4MDVqxYAV9fX9GRSIdYxGQQaWvXYnZ4OHprNIgoK8MEQLvGWI27D2YlODigwMICyxMT\nG33Yw5UrV7B161ZkZmZi79698PX1RWBgIAIDA+Hj42NyT9dSXYsWLUJhYSFWr14tOopB1NTUICkp\nCfPnz8fUqVPx4YcfomXLlqJjkQ6wiMlgVCoV0tPTkRAfj5yCArj+Oe18XaVCXx8fRMTGIigoSOeH\nPFRVVeGHH35AZmYmMjLuPsd9r5SHDRuGFi1a6PTzSP9UKhU8PDywdetW+Pn5iY5jUNevX8e7776L\njIwMLFq0CNOmTYOlJe8ymjIWMQmhUCi0O2Y5OzvDycnJIJ8rSRIKCwu1U9jHjx/H8OHDERgYiHHj\nxqF9+/YGyUGNs3r1anz77bfYtWuX6CjCHDlyBJGRkWjWrBlWrFiBvn0bcrwKGQMWMZm10tJSbN++\nHZmZmdixYwc8PDy0o+V+/fpxpGGEJEmCXC5HfHw8xowZIzqOUBqNBl999RXee+89BAUFYeHChdwA\nxwTxbxkyay4uLnjppZeQmpqKP/74A8uWLUNFRQWmT5+O9u3bIzQ0FBs3bsSdO3dER6U/7d69GzU1\nNRg9erToKMJZWloiNDQUhYWFsLS0hJeXF5KTk1FTUyM6GtUDR8RED3D27FntmuWff/4ZgwcP1q5Z\n7tq1q+h4ZmvMmDF48cUXMWPGDNFRjM6xY8cQGRkJpVKJlStX4qmnnhIdiR4Di5joMdy5cwe7du1C\nZmYmsrKy4Orqqp3CHjRoEJo3b8w5U/S48vPz8eyzz+K3336DtbW16DhGSZIkrFmzBrGxsRg3bhz+\n+c9/ws3NTXQseghOTRM9BgcHBwQFBWHVqlW4cuUKvvrqK1hbW2P27Nlo06YNXnrpJXz33Xc8slHP\nli1bhsjISJbwQ1hYWGDatGkoKiqCo6MjfHx8sHLlSlRXV4uORg/AETFRI126dEm7Znn//v2Qy+Xa\n0bKXlxfXLOvIlStX4O3tjTNnznCDlnooKChAZGQkbt68iRUrVsDf3190JPovLGIiHaqsrMS+ffu0\ny6OaN2+uLeVnnnmGI7lGeO+993Dr1i2sXLlSdBSTI0kS1q1bh5iYGAwbNgyffPIJ2rVrJzoW/YlF\nTKQnkiQhLy9P+8BXfn4+Ro4cqV2z3LZtW9ERTUZ5eTnc3d3x888/83CPRigrK8PChQvx5Zdf4t13\n38Wbb74JmUwmOpbZYxETGUhJSYl2zfLOnTvRvXt37Wi5T58+nMJ+iJUrV2LPnj1IT08XHaVJOHny\nJKKionDp0iWsWLECw4cPFx3JrLGIiQRQq9U4ePCgdgq7rKwMAQEBCAgIwKhRo2BnZyc6otGoqalB\nz5498c0332DIkCGi4zQZkiRh06ZNmDt3LgYMGIClS5eiY8eOomOZJT41TSSATCbD8OHDsXTpUpw8\neRL79u2Dl5cXPv/8c7Rt2xZjx47FypUrceHCBdFRhdu8eTNcXV0xePBg0VGaFAsLC0yaNAmFhYXo\n2bMn5HI5Fi1aBKVSKTqa2eGImMjIKBQK7Ny5E1lZWdi6dSvatGmjncIeOHAgmjVrJjqiQQ0ZMgRz\n5szBCy+8IDpKk3b27FnMmTMHp06dwueff86dywyIRUxkxGpqanDkyBHtFPalS5cwduxYBAYGYvTo\n0U3+GLxffvkFU6ZMwenTp7lpioFkZmZi9uzZeOKJJ/Dpp5/C3d1ddKQmj0VMZEIuXryofQr7xx9/\nRL9+/bSj5R49ejS5B75eeOEFDB06FFFRUaKjmJWqqiosWbIEn376KWbPno133nmHx4XqEYuYyERV\nVFRg79692tGyjY0NAgICEBgYiKefflrn5zob2rlz5/DUU0/ht99+g729veg4ZunChQuIjo7GsWPH\n8Nlnn2H8+PGiIzVJLGKiJkCSJOTm5mr3wi4qKsKoUaO0a5Zbt24tOmK9RUVFwdbWFosWLRIdxezt\n3LkTUVFR8PT0xGeffVavtdwKhQKlpaUA7p52Zqizx00Ji5ioCbp27Rq2bduGzMxM7Nq1C7169dJO\nYfv5+Rn9FPbNmzfRrVs35OXloUOHDqLjEACVSoXPPvsMn3zyCV577TW8++67sLW1ve9rlUol0tPT\nkRAfj6OFhXD7c0e5EqUSfby9EREbi8mTJ5v8rI2usIiJmjiVSoUDBw4gMzMTGRkZqKqq0pbyiBEj\nHviXqUiLFi1CYWEhVq9eLToK/ZdLly7h7bffxqFDh7Bs2TIEBQXV+sUube1azA4Ph68kIeLOHYwH\ncO8xOzWADAAJ9vbIt7TE8sREBIeECPgWxoVFTGRGJEnCqVOntPeVs7Oz8fTTT2vPWe7UqZNB89xv\n2lKlUsHDwwNbt26Fn5+fQfPQ49u/fz8iIyPRvn17fP755+jVqxc+X7YMS+bNw8bKSvR7xPXZACbZ\n2iImLg5R0dGGiGy0WMREZuzWrVvYsWMHMjMzsW3bNnTs2FH7wNdTTz2llzXLj5q27D1oEE6dOoU9\ne/bo/LNJt9RqNVauXImPP/4YgwYOxLE9e3CwshKdH/P6YgD+trZYnJJi1iNjFjERAbi7ZvmXX37R\nPvB19epV7Zrl5557TicP2TzOtOViS0ucbtECK838L2dTcuHCBTzRvTv2qdXoW89rswEEODqiuKTE\nbO8Zs4iJ6L4uXLigXbN88OBBPPnkk9p7y927d6/3+3HasulKTU1FSlgYdpeVNej6kfb2mJWcjBAz\n/cWLRUxEj1ReXo49e/Zo7y07ODhoS9nf3/+RR+mlrV2Lt2fM4LRlEzVULsfc3FwENfD6DQCWy+X4\n8ehRXcYyGSxiIqoXSZJw9OhRbSmfPn0azz33HAIDAzF27Fi4urrWer1SqUSX1q2x9fZtTls2QQqF\nAh3c3HBLrUZDNyFVA2glk+FySYlZrjPm5q1EVC8WFhbo27cv+vbtiw8++ABXr17F1q1bsXHjRkRG\nRqJ3797aB758fX2Rnp6O3hpNvUsYAPoB8NFokJ6ebrbTloYiSRKqq6uhVCpRVVVV5+dB//7SpUto\naWHRqDKRAXC1ssKNGzfMsog5IiYinVEqlfjhhx+QlZWFjIwMVFdXo1lFBZaWlnLa8hE0Gs0Dy+5h\nRajLawDAxsYGLVq00P5YW1vX+uf//vcqlQp7163D72p1o76/u50d9uXlwcPDQxf/OU0Ki5iI9EKS\nJBw5cgTDBg3CbY3GqKctJUmCSqUySNk96M/UavUDy+5hRajLaxpywtW9qembajUe/qTAg3FqmohI\nDywsLODq6oo2trZo3sCnaYG705atmjXDhg0b0LJlS70UpFKpRPPmzRtddi1btmxwQVpZWRn91qP3\n4+TkhD7e3shoxMNaWwD09fExyxIGWMREZAJUKhVWr14NZ2fnBxbaw/7sUaVqbW2tl81LzEVEbCwS\nwsIQ1MBfuBIcHBARG6vjVKaDU9NEpDectjQPfDK+cSxFByCipks7bdmI9zD3aUtTYG1tjeWJiZho\nY4PielxXjLsbtyxPTDTbEgZYxESkZxGxsUiwt2/w9eY+bWkqgkNCELNwIfxtbJD9GK/Pxt0NW2Li\n4sx+wxZOTRORXnHa0rzc20+8t0aDiLIyTEDt/cS34O4vVwUWFjwG8U8cERORXnHa0rwEh4SguKQE\nM5OT8ZlcjpYyGdzt7OBuZ4dWMhmWy+WYlZSE4pISlvCfOCImIoPgoQ/mSaFQ4MaNGwAAZ2dn3uu/\nDxYxERkMpy2J6mIRE5FBqVQqpKenIyE+HjkFBXD9c9r5ukqFvj4+iIiNRVBQEKejyWywiIlIGE5b\nErGIiYiIhOJT00RERAKxiImIiARiERMREQnEIiYiIhKIRUxERCQQi5iIiEggFjEREZFALGIiIiKB\nWMREREQCsYiJiIgEYhETEREJxCImIiISiEVMREQkEIuYiIhIIBYxERGRQCxiIiIigVjEREREArGI\niYiIBGIRExERCcQiJiIiEohFTEREJBCLmIiISCAWMRERkUAsYiIiIoFYxERERAKxiImIiARiERMR\nEQnEIiYiIhKIRUxERCQQi5iIiEggFjEREZFALGIiIiKBWMREREQCsYiJiIgEYhETEREJxCImIiIS\niEVMREQkEIuYiIhIIBYxERGRQCxiIiIigVjEREREArGIiYiIBGIRExERCcQiJiIiEohFTEREJBCL\nmIiISCAWMRERkUAsYiIiIoFYxERERAKxiImIiARiERMREQn0/wEowM++my1pMQAAAABJRU5ErkJg\ngg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0xe85a8d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Create The graph\n",
    "maze=networkx.sedgewick_maze_graph()\n",
    "\n",
    "# Draw the graph\n",
    "networkx.draw(maze)\n",
    "\n",
    "print( \"Tuttle Graph\" )\n",
    "print( \"-------------\" )\n",
    "print( \"Number of Nodes: \" + str( maze.number_of_nodes() ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Degree and Centrality\n",
    "\n",
    "- Counts the number of edges that a node has \n",
    "- Nodes with a high degree of connections usally play an important role in a network "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Maximum number of Edges is 4\n",
      "The Minimum number of Edges is 1\n",
      "The Average number of Edges is 2.5\n",
      "The Median number of Edges is 2.5\n"
     ]
    }
   ],
   "source": [
    "# Calulate the degree of each node \n",
    "maze_degree = maze.degree().values()\n",
    "\n",
    "# Maxinum number of connections  \n",
    "print( \"The Maximum number of Edges is \" + str( max(maze_degree) ) )\n",
    "\n",
    "# Lowest Number of Connections \n",
    "print( \"The Minimum number of Edges is \" + str( min(maze_degree) ) )\n",
    "\n",
    "# Average Number of Connections \n",
    "print( \"The Average number of Edges is \" + str( numpy.mean(maze_degree) ) )\n",
    "\n",
    "\n",
    "# median number of connections \n",
    "print( \"The Median number of Edges is \" + str( numpy.median(maze_degree ) ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Maximum Degree Centrality is 0.571428571429\n",
      "The Minimum Degree Centrality is 0.142857142857\n",
      "The Average Degree Centrality is 0.357142857143\n",
      "The Median Degree Centrality is 0.357142857143\n"
     ]
    }
   ],
   "source": [
    "# The Degree is is divided by the maximum possible number of connections \n",
    "# The bigger the number the more connections \n",
    "\n",
    "# Calulate the degree centrality for all the modes in the maze graph \n",
    "maze_degree_cen = networkx.degree_centrality(maze).values()\n",
    "\n",
    "# Maxinum number of Normalized Degree Centrality   \n",
    "print( \"The Maximum Degree Centrality is \" + str( max(maze_degree_cen) ) )\n",
    "\n",
    "\n",
    "# Lowest Number of Normalized Degree Centrality  \n",
    "print( \"The Minimum Degree Centrality is \" + str( min(maze_degree_cen) ) )\n",
    "\n",
    "# Average Number of Normalized Degree Centrality  \n",
    "print( \"The Average Degree Centrality is \" + str( numpy.mean(maze_degree_cen) ) )\n",
    "\n",
    "\n",
    "# median number of Normalized Degree Centrality  \n",
    "print( \"The Median Degree Centrality is \" + str( numpy.median(maze_degree_cen) ) )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Centrility of this graph is 0.285714285714\n"
     ]
    }
   ],
   "source": [
    "# Centralization: How equal are the nodes \n",
    "# How much variation is ther in the centrality scroes amoung thenodes?\n",
    "# http://cs.brynmawr.edu/Courses/cs380/spring2013/section02/slides/05_Centrality.pdf\n",
    "# The closer to 1, there are popular nodes that interacts with many nodes\n",
    "# the closer to zero, the interactions between nodes are more evenly distributed \n",
    "\n",
    "# Calulate the centralization for all the nodes \n",
    "all_degrees = maze.degree().values()\n",
    "\n",
    "# Get the Maximum degree number \n",
    "max_degree = max(all_degrees)\n",
    "# Get the number of nodes in the maze graph\n",
    "nodes_num = maze.number_of_nodes()\n",
    "\n",
    "# Calculate the centraliy using the max degree, the number of nodes, and the degrees of all then node\n",
    "centrality = sum([max_degree - x for x in all_degrees]) / float(((nodes_num - 1)*(nodes_num - 2)))\n",
    "print( \"The Centrility of this graph is \" + str( centrality ) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Betweenness\n",
    "- Equal to the number of shortes paths from all vertices to all others that pass through that node "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {
    "collapsed": false,
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Maximum Betweenness measure is 0.357142857143\n",
      "The Minimum Betweenness measure is 0.0\n",
      "The Average Betweenness measure is 0.136904761905\n",
      "The Median Betweenness measure is 0.0833333333333\n"
     ]
    }
   ],
   "source": [
    "# Calulate Betweenness Centrality scores for all the nodes\n",
    "btw_cen = networkx.betweenness_centrality(maze).values()\n",
    "\n",
    "print( \"The Maximum Betweenness measure is \" + str(max(btw_cen)))\n",
    "\n",
    "print( \"The Minimum Betweenness measure is \" + str(min(btw_cen)))\n",
    "\n",
    "print( \"The Average Betweenness measure is \" + str(numpy.mean(btw_cen)))\n",
    "\n",
    "print( \"The Median Betweenness measure is \" + str(numpy.median(btw_cen)))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Diameter\n",
    "- Often we want to find the shortest distance between two nodes, the diameter is the longest of theses paths \n",
    "- Nodes that occur on many shortest paths between other nodes in the graph have a high betweenness centrality score  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Diameter of this graph is 3\n"
     ]
    }
   ],
   "source": [
    "diameter_size = networkx.diameter(maze)\n",
    "print( \"The Diameter of this graph is \" + str(diameter_size) )\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cliques\n",
    "\n",
    "- A clique is a subset of vertices of an undirected graph such that every two distinct vertices in the clique are adjacent.  "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Cliques in the Maze graph are, [[0, 2], [0, 5], [0, 7], [1, 7], [2, 6], [4, 3, 5], [4, 6], [4, 7]]\n"
     ]
    }
   ],
   "source": [
    "maze_cliques =  list(networkx.find_cliques(maze))\n",
    "print( \"The Cliques in the Maze graph are, \" + str(maze_cliques) )"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### The above list of cliques are a little unintresting.\n",
    "Run the code cell below to see the clique list of another built-in graph, the lolipop graph\n",
    "\n",
    "You can see that the lollipop graph has a cluster of 10 nodes that make up the \"candy\" part of the lollipop while the \"stem\" of the lollipop is a line of nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The Cliques in the Lollipop graph are, [[9, 0, 1, 2, 3, 8, 4, 5, 6, 7], [9, 10], [11, 10], [11, 12], [12, 13], [13, 14], [14, 15], [15, 16], [16, 17], [17, 18], [18, 19], [19, 20], [20, 21], [21, 22], [22, 23], [23, 24], [24, 25], [25, 26], [26, 27], [27, 28], [28, 29]]\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3X101NW97/HPBCZDHibBhICIKHhaH0DIQFqltzxUqNVq\npRhOS7Tn1BYVPKlHhIWmxdjbUzj2pCA2tjc1INqjXias1rHFKtV6dR3A1qohpRp0VQlLFJSGSMaM\nSWZGZt8/Jok8JDCZp99k5v1aK4tA5jf5ziTMZ/b+/fZ324wxRgAAwBJZVhcAAEAmI4gBALAQQQwA\ngIUIYgAALEQQAwBgIYIYAAALEcQAAFiIIAYAwEIEMQAAFiKIAQCwEEEMAICFCGIAACxEEAMAYCGC\nGAAACxHEAABYiCAGAMBCBDEAABYiiAEAsBBBDACAhQhiAAAsRBADAGAhghgAAAsRxAAAWIggBgDA\nQgQxAAAWIogBALAQQQwAgIUIYgAALEQQAwBgIYIYAAALEcQAAFiIIAYAwEIEMQAAFiKIAQCwEEEM\nAICFCGIAACw03OoCAKQur9ertrY2SVJxcbEKCwstrghIP4yIARzH7/fL7XZrlsulcSUlmldaqnml\npRpXUqJZLpfcbrcCgYDVZQJpw2aMMVYXASA1bGlo0LKlSzXFGFV2dOgafTptFpT0pKS6/Hy9npWl\n2vp6LaqosK5YIE0QxAAkSfevX6911dV6oqtLZae5baOka3NztXL1at22YkUyygPSFkEMQFsaGnTH\n4sXa2dWlcyI8Zr+kmbm5Wrtpk6UjY85jY6gjiIEM5/f7de7o0Xr6o480fZDHNkq6uqBA+1tblZ2d\nnYjy+uX3++XxeFRXU6OmPXtU4nBIklr9fk2bNEmVVVVauHBhUmsCosXFWkCG83g8ujgUGnQIS1KZ\npMmhkDweT7zLGtCWhgadO3q0Hlq6VCt271Z7MKh9Pp/2+Xw6Egxq+e7d2rRkic4pKdGWhoak1QVE\nixExkOFmuVxavnu3yqM8/nFJtS6Xtjc1xbOsfnEeG+mIIAYsZPX5Ta/Xq3ElJWoPBqNuKhCUdIbd\nrgOtrQmtfyifxwZOhalpIMlSaZ1uW1ubShyOmDr72CUV2+1677334lXWSfx+v5YtXarfDiKEJekc\nSU90dmrZ0qWsfUbKorMWkETHrtNd0btONxiU1LNOd/du1S1ZouW33JKUdbodHR06+sknMd9PV1eX\npk+fruzsbI0dO1Znnnmmxo4dO+DnxcXFysqKfBwQr/PYFYyKkYKYmgaSxOrzm+3t7dq1a5caGxv7\n/jxw4ICOdnWpwxjZo7zf3qnp9/7xD9lsNr3//vt6//339cEHHxz357Gfd3R0aPTo0QMG9bF/OhyO\nIXUeGxgsghhIgmSf3zxy5Ehf2PZ+HDp0SKWlpSorK1NZWZmmT5+uCy+8UJd97nNJDzm/369Dhw4N\nGNS9nx86dEh5eXnqam+XT9FP4SXrPDYQDYIYSLBEr9Nta2s7KXQPHz4sl8ul6dOn9wXvBRdcoGHD\nhp10vNvt1qYlS/Sczzf4BydpntOpmzdsSMi0bygU0q5du7Rw9my909UV031NyMvTC6+9pokTJ8ap\nOiA+OEcMJFg8z28ePnz4uMDdtWuX2traNG3aNJWVlWnBggVavXq1PvvZz/Ybuv0pLy/X8ltu0S4p\nqjcKzTabysujHU+fWlZWloqKipQV4WMBhiJGxECCxeP85u2FhcoqLFR7e/txo9yysjJ95jOfGdSF\nT/1J5aVBvUusjgSDMZ/HZmoaqYgRMZBAXq9XTXv2aH4M9zFf0r/6fNr5/PNyuVwxh25/FlVU6NDB\ng5oZxcVkib6yu7CwUNMmTdKTMbyZ2SrprOJidXd3E8RIOawjBhIoXut0R48YoTPOOCMhIdzrthUr\ntPahh3R1QYG+nJ8vj6RjFzYFFR6dz3M6dXVBgdZu2pS0jlWVVVWqy8+P+vhf5OZq/KRJuvDCC/Wd\n73xHTVw9jRRCEAPos6iiQvtbW3XTxo36mculkXa7JuTlaUJens6w21XrcunmDRu0v7U1qZ2qysvL\n9XpWlnZFcWyjpDeGD9e2bdv09ttv68ILL9T8+fM1Z84ceTweHT16NN7lAoPCOWIggYb6+U2v16sP\nP/xQklRUVGTptG48z2MHg0F5PB7V1tbq/fff16233qobb7xRI0eOjLlOq9uWYuhhRAwkUN/5zRju\nY6uk6ZMnW/KCXlhYqIkTJ2rixImWB8qiigqtXLNGM3Ny1BjB7RsVDuH+zmPb7XYtWrRIf/rTn7Rl\nyxbt2rVL5513nm699Vb9/e9/H3RtqdS2FEOQAZAwhw4dMpdffrm5VDImyo+5Tqdxu91WP5SU0eB2\nmzEFBWZefr55XDLBY56rgGR+0/OcjSkoMA2DeN4OHDhg7rrrLlNSUmKuuuoq88wzz5hQKBRxPV92\nOo2nn3oel8y8/PxB14PMQRADCdDR0WH+4z/+wxQVFZnKykoz2uk0jVGE8KuSGVNQYPx+v9UPKaX4\n/X7jdrvNLJfL5Nnt5ty8PHNuXp7Js9vNLJfLuN3uqJ+zzs5Os2nTJjNlyhRz0UUXmQceeMB8/PHH\n/d629t57zficHPNqhD/L8bm5pvbee2N56EhDBDEQR4FAwPzyl780Y8eONdddd53Zu3evMSY8ahqf\nk2PeGUQIv9Pzws0o6tTa29tNS0uLaWlpMe3t7XG731AoZJ5//nnz9a9/3YwaNcrceeed5p133un7\nOj9TxAtBDMRBKBQyHo/HnH/++Wbu3Lnm1VdfPek2jJ6GrrffftvcfvvtpqioyHzjG98wzz//vBlT\nUMAsB+KCq6aBGL344ou688475fP5VFNToyuuuEI2m63f2/Zug3hxKKRKn0/z9WlXnaDCF2bVOZ1q\nttmSsg0iBqejo0O/+tWvtGbNGp13+LD+HApFdT/z8vN188aNbMsISSxfAqL2xhtv6Ac/+IGampq0\nevVqfetb34qov3MgEJDH41FdTY12NTdrVM9mDocDAU2fPFmVVVUqLy8fcJMHWG9WaamW/+1vbMuI\nuCCIkXFiXed58OBB/ehHP9ITTzyhqqoq3XrrrRoxYkTUtaTKOl1EpndteHswyLaMiAvWESMjxGOd\n50cffaTq6mpNmTJFI0eO1N///netXLky6hCWUmudLiITr7alo7Kz+96EIbMRxEh7WxoadO7o0Xpo\n6VKt2L1b7cGg9vl82ufz6UgwqOW7d2vTkiU6p6REWxoaTjo+EAjo/vvv1/nnn6/33ntPTU1N+ulP\nf6ozzjjDgkcDIN2w+xLS2v3r12tddbWeGmBHIbukcknlPl94R6Ebb9Shgwd124oVCoVC+vWvf61V\nq1bp/PPP17PPPqupU6cm9wEg5RQXF6vV71dQiqlt6eFAQEVFRXGsDEMVQYy0taWhQeuqqyPuTVwm\naWdnp2befbcOHzmibX/4g4wx2rhxo+bOnZvocjFExGtbRqvaliL1cLEW0pLf79e5o0fr6Y8+0vRB\nHtsoaY7NpgceeUTXX399QrcexNDkdru1ackSPefzRXX8PKdTN2/YwPIlSOIcMdKUx+PRxaHQoENY\nCo+ML83L0/Dhwwlh9CvWbRmbbTaVl0c7nka64VUGaamupkaVUY5WJKnS51NdTU0cK0I6cTgcqq2v\n14KcHO0fxHH7JX3VZtP//slPWCeOPkxNI+2wzhPJ0nsx4BMDXAx4rEZJ1+bmavpll2l3c7OeffZZ\nffazn01GmUhxjIiRdljniWS5bcUKrX3oIV1dUKAv5+fLI+mTY74eVLiL1jynU1cXFGjtpk367e9/\nr+rqas2ZM0dNdNaCCGIAiMmiigrtb23VTRs36mcul0ba7ZqQl6cJeXk6w25Xrculmzds0P7W1r7e\n4TfeeKN+8Ytf6IorrtD27dstfgSwGlPTSDu9U9NHgsGY1nkyNY1oDKZt6fPPP6+Kigo9+OCDmj9/\nfrJKRIphHTHSDus8YaXCwsKIf2/mzp2rp59+Wtdcc42OHDmiG264IcHVIRUxNY20VFlVpbr8/KiP\nr3M6VVlVFceKgP597nOf0wsvvKAf/vCHWr9+vdXlwAJMTSMtxdrQ4+qCAu1vbWWJCZLm3Xff1Ve+\n8hWVl5drzZo1A+5pjfTDiBhpyeFw6Cf33acrbbZBr/O8NjdXtfX1hDCSavz48dqxY4eeffZZ3XLL\nLTp69KjVJSFJGBEjLXV0dOiKK65QdlaWWnbtGtQ6z5WrV+u2FSuSUSZwko6ODi1YsEBFRUV67LHH\n5HA4rC4JCcaIGGnH5/Ppqquu0tSpU/XCjh2DXudJCMNKTqdTTz/9tEKhkK655hr5TtEhzuv1qqWl\nRS0tLfJ6vUmsEvHEiBhppbOzU1dffbX+6Z/+SRs2bOjrFR0IBOTxeFRXU6Ndzc0a1TPtfDgQ0PTJ\nk1VZVaXy8nKmo5Eyjh49qltuuUV/+9vf9PTTT6u4uFhS+PqH3t/lpj17VNIzYm71+zVt0iRVVlVp\n4cKF/C4PIQQx0kZXV5euueYajRs3Tg8//PCAGzYMZp0nYCVjjFatWqXf/e53evbZZ/Xizp1atnSp\nphijyo4OXaNP16AGJT0pqS4/X69nZam2vr6vgQhSG0GMtNDd3a0FCxaouLhYjzzyiIYNG2Z1SUDc\nrFu3Tj+95x45urr02+5urndIMzT0wJDn9/u1cOFCFRYW6r//+78JYaSd8WefreEff6wXAwGdE8Ht\nyyTt7OzUzLvv1pizzmJknOIYEWNICwQC+sY3viG73S632y27PdqmlkBqYk18+uOqaQxZwWBQ1113\nnSRp8+bNhDDSksfj0cWh0KBDWAqPjCeHQvJ4PPEuC3HEiBhD0ieffKJvfetb8vl88ng8rLVE2prl\ncml5DH3TH5dU63JpO1supiyCGEPO0aNH9e1vf1uHDx/W7373O40YMcLqkoCE6N1JrD0YjPqCHnYS\nS31crIWU4PV61dbWJkkqLi4e8AXj6NGjWrx4sQ4dOqQnn3ySEEZaa2trU4nDoeHBYNT3YZc0Kjtb\nH374IUGcojhHDMv4/X653W7Ncrk0rqRE80pLNa+0VONKSjTL5ZLb7VYgEOi7fSgU0pIlS7R//35t\n3bpVOTk5FlYPAPHB1DQssaWhYVCNCb65aJH+7d/+Tc3Nzdq2bZvyY9jiEBgqeqemjwSDivZSRKam\nUx9BjKS7f/16rauuHtRGDOdNm6ZAKKRnnnlGTqczGWUCKYGLtdIfU9NIqi0NDVpXXa2dEYSw9Glj\ngj1//rNuvukmQhgZp7KqSnUxzADVOZ2qrKqKY0WIN0bESBoaEwCDx/+b9MeIGElDYwJg8BwOh2rr\n67UgJ0f7B3HcfoVP69TW1xPCKY4gRtLU1dSo8hR7q55Opc+nupqaOFYEDA2LKiq0cs0azczJUWME\nt2+UNLNn0wf6TKc+pqaRFDQmAGLXu9rg4lBIlT6f5uv41QZbJa0fPlx7hg3TA7/6FSE8RDAiRlL0\nNSaI4T6ObUwAZKJFFRXa39qqmzZu1M9cLo202zUhL08T8vJ0ht2uWpdL31y3Tll5ebryq1+1ulxE\niM5aADCEZGdnq6KiQhUVFfJ6vX1vTIuKivpmihobG/Xzn/9c1dXVVpaKCDE1jaSgMQGQPG+++aZm\nz56tvXv3suRvCGBqGklRWFioaZMm6ckY7mOrpOmTJxPCwGlceOGFmjt3rh544AGrS0EECGIkDY0J\ngOS56667tH79enV2dlpdCk6DqWkkDY0JgOQqLy/XnDlztGzZMqtLwSkwIkbS0JgASK7q6mqtXbtW\n3d3dVpeCUyCIkVQ0JgCSZ/r06XK5XHr44YetLgWnwNQ0LPF/H3tMS2+4QWXZ2VrW3d1vY4I6p1PN\nNptq6+sJYSBKf/nLX/TNb35Tb731FjNKKYoRMSzx9t69mnPllbrloYcGbExw84YN2t/aSggDMbj0\n0kt1wQUX6NFHH7W6FAyAETGS7vXXX9dll12mv/71rxo3bpwkDdiYAKnF6/Wqra1NklRcXMzPaYjY\nsWOHvvvd7+rNN9/U8OH0cUo1jIiRVJ988okWL16se+65py+EpfA644kTJ2rixIm8uKcYv98vt9ut\nWS6XxpWUaF5pqeaVlmpcSYlmuVxyu90KBAJWl4lTmDVrlsaNGye32211KegHI2Ik1bp167Rt2zY9\n99xzstlsVpeD0+jdZGCKMars6NA1Ov5c/pOS6vLz9XpWFufyU9xzzz2nW2+9Vc3NzRo2bBizGymE\nIEbSvPXWW/rCF76gl19+Weedd57V5eA07l+/Xuuqq/VEV5fKTnPbRoWXmK1cvVq3rViRjPIwSMYY\nzZgxQ5deeqmatm9X0549KnE4JEmtfr+mTZqkyqoqLVy4kIu6kowgRlKEQiFddtlluvbaa3X77bdb\nXQ4G0DtK+v3vf6913/++dnZ16ZwIj90vaWZOjlb+13/pa1/7GqOsFLOloUHfu/FGnd/drTtCIWY3\nUghBjKT45S9/qUcffVQ7duzQsGHDrC4Hx/D7/fJ4PKqrqVHTnj0alZ2t1o8/1g6p3w5oXkltPZ8X\nSzo2ahslzZZUkpenw4EAo6wUwexGijNAgr3zzjtm1KhRZs+ePVaXghM0uN1mTEGB+bLTaTySCUpm\ns2TmScYc89Hd8+8zJZMnmQk9H3k9/7ZZMv6e286VjFsyAck8Lpl5+flmTEGBaXC7rX64GanB7Tbj\nc3LMOyf8TE/18Y5kxufm8jNLEkbESChjjK666irNnDlTd911l9Xl4BgDjZJmSVouqbzn71skLZM0\nRVKl1P+UpqTXJdX2fK1W0vZj7pNRljXo7z40sHwJCfXII4/ogw8+0J133ml1KTjGloYGrauu1s4T\nQtgrqUnS/J6/3y/pDklPSfqjpGv1aQhLkl3hwH6u5zZ3KHyueFfPffUqk7Szs1Pr7r5bWxoaEvCI\n0B+Px6OLQ6FBh7AU/plNDoXk8XjiXRZOwIgYCfPBBx9o6tSpeuaZZzRt2jSry8l4vRdi+f1+zbn0\nUv2ho+OkF+gWSfMk7VN4JHyHpJ3S4C7YktQl6WVJE0/4OqOs5Jrlcmn57t19sxuD9bikWpdL25ua\n4lkWTsCIGAnzve99TzfddBMhbKH+mnF8Zdo0fdTRoWWS3JL6a8XhV3g6+rcKX4zV0vPh7ee2xzpH\n0hOSOiXt7ecYRlnJ4/V61bRnT9/sRjTmS9rV3Cyv93Q/ecSCIEbUvF6vWlpa1NLSctJ/1N/85jfa\ns2ePfvjDH1pUXWKd6rGnii0NDTp39Gg9tHSpVuzerfZgUPt8Pr3r96tD4fPAmxQOzy09xxRLapX0\nfyWNUjiMxyk8Sp7X8/ksDRzgUk/YSqoY4JhKn091NTVxf7w4Xltbm0ocDsXS0NIuaVR2dl/7WSSI\npZeKYcjp7u42mzdvNjNLS02e3W4m5OebCfn5Js9uNzNLS83mzZvNwYMHzZlnnmlefPFFq8uNq0ge\nu9/vt7pMY4wxtffea8bn5JhXI7hC9lXJjJdMbc/fL+i5GvpLUt+V1L237bsSWjJjJNMwwH3+RjKz\nBjjmMcnk2e2mvb3d6qcpre3du9dMyM+P+ErpgT7OzcszLS0tVj+ctEYQI2L9LXU56QU6P98U2O3m\nq1deaXW5cRXpY0+FZTpRL1eRzA2SGdsTzoMN8GM/Aj1h3j7AMSV2Oy/uCdbe3m7y7HYTiCGEA7xp\nSgqCGBEZ9AgrJ8fU3ntvVN+rvb3d7N271+zduzclXgAG/dhzc6N+7LHq7u42YwoKTGMUL7qvSiZX\nMm9FEeD9jYzPlUzLAMeMksz9tbWWPEeZZGZpqXk8hiD+jWRmuVxWP4y0RxDjtJLRECBVp32HWjOE\nzZs3m3kxTEfOUbgZx2ADvEQyb0hmrz4dBQ8UxL3HjHY6U2YqP13F+vsw1+k0bpp6JBxBjFOKdYQ1\npqDgtC+2qTrtm4zHHm9xGQFFeNtju205JHO2Pu229cWef/vHqV7k8/N5kU+wofg7nIkIYpxSzO+o\nT/Nim8rTvol+7PHWe04wGGW9vW98+ju3a3r+bW/Px0MKX3j1ZQ18QdcXFMEFXUx7JtxQm9XJRARx\nhor0PGwizzGl+gvEUDu/FrerZPXplHJ/PaZLFD7HG5cLurgQKClS+Q0v6DWdUU7cZed0e5F6vV6N\nKylRezAY9VrEoKQz7HYdaG09bku8VO+Bm8jH3p9AICCfz6eOjg75fL6TPj/d3zs6OvThhx+qY98+\n/SPG/9ITJL2gcGesE3tMP67ou22tlbToxO+Vl6cXXntNEyee2IML8baloUHLli7VxaGQKn0+zdfx\nPcO3SqpzOtVss7ENYpIRxBmi9z/hFGNU2dER0V6kLS0tmldaqn0+X0zfu78XW7fbrU1Llui5KO97\nXn6+bt64URUJerGI12M/y27Xl/75n5WVlTVggPp8PoVCITmdTjmdTuXn5ys/P/+4z0/8e39fM8Zo\n3syZOvLJJ7JHWW9Q0hmS7pb0fxTuktXbi9ov6VxJT6v/7RFPpVHS1QqH8rFvnQji5AoEAn1vxnc1\nN2tUdra6u7vVIalsyhRVVlWpvLyc9qNJFkvTFQwRvbvsPDXAXqS9jfvLfb7wLjk33qhDBw/qawsW\nJKymupoaLY8h5Cp9PtXW1EQcxMYYdXZ26qOPPlJHR8dxf/b3bwcOHFB3V1fU9fWy2Wy66KKLNGHC\nhFOGa3Z2tmw2W8zfb9rkyXoyht7CWyWdp3AInzjq9Ui6WIMPYenTblsehTtuSeHQPxwIqKioKMpq\nMVjZ2dmqqKhQRUWFvF6vPvzwQ/3gBz/QjBkzdPvtt1tdXsYiiNPcsbvsRDKV2LtLzsy775Zz5Ei1\n+v0KSjGNsE58sY1XD9x/fe01/fjHP1YwGOw3VI/93OfzKTs7WwUFBSooKJDT6Tzp894/zzzzTF10\n0UV6ZuvWmB+71xjddtttp52ajpfKqirVLVmi8ijf5NQpPGp9XidPPdcp3BYz6toU3h6xN4i3Spo+\neXLSnhscr7CwUIWFhTr//PPV3t5udTkZjSBOY36/X8uWLtXTEYZwr3MkPdHZqauXL5frwgv15Guv\nxTTCOvHF9vDhwxqVna3hwWCU9xoOx0KbTe+++67Gjx+vCRMmnDJcnU6nhg8f3K+7e8OGmEeXyQ6a\n8vJyLb/lFu1SdNPHf+057sRjT9weMRrzJd3Qc1+FCp+PrKyqiuEeEQ9jx47VX//6V6vLyGgEcRqL\nx16kk+bMUd2+fVGPsH7mcKjgrLNUUVGhAwcO6ODBg3rvvfdUGBhoy4DIORwOrVq1KmHnF2MeXVoQ\nNA6HQ7X19VqweHHEsyBSeBR8pcIBeWs/X2+TVKLYXjDsCm8k8aGktyU122wqL4/2bQ7iZezYsdq2\nbZvVZWQ0dl9KY3U1NaqM8Txs0/btej0rS7uiOL5R0mvGaPbs2fr617+uNWvW6JlnntG+ffvUabcr\n+vFwcs4vlpeXx/TYrQqaRRUVWrlmjWbm5Kgxgts3KnxV8xWSDiq2UW8kDki6NjdXtfX1XBSUAsaO\nHauDBw9aXUZms3LtVKZLZE/leDV3cNhsxul0muKeNbzxWu87VNbopvpa59PVPqagwMzLzzeP6+Sm\nG7+RzFx92nRjr2TGDfCY2nvWEce6gUCuZMbF0Icc8bd//35z1llnWV1GRiOIkyxZPZXj1dxhfE6O\neemll8yPqqvNKJstbg0BhlIP3KHcDMHv9xu3221muVwmz2435+blmXEOh3Eo3MrSLRl/T+17FW7Y\nMdBjmynF/ObpjKwsy9+g4Hh+v9/Y7XbzySefWF1KxiKIkyiZPZXjuRdpc3OzKSsrM9dVVJx+hOV0\nRlT/UOuBG9HoMsLHbpX29nbT0tJi3njjDVPidJ703J9u1LtZ4T2Fo/1dmjVihHn00UetfhrQj1Gj\nRpkPPvjA6jIyFkGcJMkaVX388cfmj3/8o1m+fLlx2Gxx2Yt0wYIF5l/+5V9MKBTqd4R1bl6eybPb\nzSyXy7jd7ogDcqhN+8bzsVttoOf+VKPeboWnsYfKmydEbsqUKWbXrl1Wl5GxCOIkSGTgdHd3m//5\nn/8xP/rRj8zs2bNNXl6e+eIXv2juvvtu4zrvvJinEj975plmxowZpqur66Tv3TvCamlpifoc91Cd\n9o3HY7daf8/96Ua9DQr3jh4qb54QmSuuuMI89dRTVpeRsQjiBIv3FGwwGDQvvfSSueeee8zll19u\n8vPzzec+9zlz5513mm3btpmOjo6+28Z6Hnb2iBGmuLjYvP/++wl9jtJh2neoOvG590Uw6q3tCeOh\n9uYJA/vOd75jHnzwQavLyFj0mk6wePRUvvyuu5Sdna0XXnhBO3bs0DnnnKO5c+dq7ty5mj17tkaO\nHNnvsbFurDDbZtMLL72kSy65JKraB6O/HrhSeInS9MmT6YGbQCc+9zk2mxQIqFEDb+ywReENIS5W\nuGMWGwgMbatWrVJubq6qq6utLiUjEcQJNsvl0vIYujM9LukWh0P//N3vau7cufrSl76kkpKSiI/f\n0tCgO6Jo7lBms+lfly3T+vvui6bsmPT2wJWkoqIiWiAmUe9z/6sHH9TD992nJwboTy5JAYV7R6+T\n9Lqk4uxs2e123jwNQT//+c/1xhtvqK6uzupSMhJBnEDJ3kpvIL2bPpzqRbVXo6SvZmXpkssv1+//\n8Ieovh/Sw2C2zfvJfffpS5ddJok3T0PRI488oscee0wPPPCAiouL+fklm5Xz4ukunkuIWlpaYqol\n0vOwBXa7+V9f+IIJhUJxehYwlKXTleI43rE9DXKHDzdjsrIS0tMAp8eIOIESuZ9vNFpbW7V582Y9\nVl+vPW+9pRKHQ9Kn52HPuuACvfXWW9q5c6dycnJi+l5IP5wySB/R7E+OxGHThwQqLi5OyDaCg+H3\n+/suxGnas6cvfG02m8acc46uX7pU119/vV588UX9+7//u/7yl78QwuhX77Z5GNqi3Z/8thUrklto\nBmFEnGDxuFir1uXS9qamQR8b6bvevxmjbptN/+/55/X5z38+ykoBpLpoL96cmZurtZs2MTJOEHZf\nSrDKqionIoICAAANLUlEQVTV5edHfXy0W+ndv3697li8WE999JH+2NGha3X89Efvu97nfD5t+/hj\nOQMB/XnHjqjrBJDaevcn/22U+5MvW7pUgThsX4qTEcQJZsVWelsaGrSuulo7I7hKWgrvPfznQEDr\n7r5bWxoaoqgUQKqLx/7kHo8n3mVBTE3HhdfrVVtbmyT1e+n/loYGrbjhBv05EEj4dFCsTTyuLijQ\n/tZW1n4CacbK02Q4NUbEUfL7/XK73ZrlcmlcSYnmlZZqXmmpxpWUaJbLJbfb3TeNU1RcrI/tdn1x\nxIjIN2rPzdXK1asHfU6Gd70ATuT1etW0Z4/mx3Af8yXtam6W1+uNV1noZeXaqaFqMNsZ3vOf/2lK\nSkrM9u3bk9JTeWZpacwbPcxyueL8jAGwUir1NMDJmJoepMF2qbpS0oLvfEcbH35YUmJ7KqdKJy8A\nqSXVehrgeATxIMT70v94N0jgPxuA/vS+ST8SDMbU04A36YnBOeIIJeLS/8LCQk2cOFETJ07kFxtA\nwhQWFmrapEl6Mob72Cpp+uTJvFYlAEEcoaFwEdSxnbyiFWsnLwCpyaqeBjg9gjhCdTU1qoxhyrfS\n51NdTU0cKzoZ73oBDMSKngaIDEEcgWRc+u/1etXS0qKWlpaolwccOHBA9qIi/TSGOnnXC6Qnh8Oh\n2vp6LcjJ0f5BHLdf0rW5uaqtr6e/QIIQxBFoa2tTicMR0w4ZdkmjsrP7Ls6SBrcW+VSOHDmi73//\n+5o6daqmTZumfU4n73oBnGRRRYVWrlmjmTk5Ce9pgEGwdvXU0JCINXiDWYs80Jrizs5OU1NTY0aN\nGmVuuukm8+677/bd9/icHPPOIGp7RzLjc3OjXr8MYOhIRk8DRI4gjkB7e7vJs9tNIIYQDkgmz243\n7e3tpvbee834nBzzagTHvdoTkLX33ttXTzAYNA8++KA5++yzTXl5uXnjjTdOqjnW7wEgvfn9fuN2\nu820z3zGOGw2c25enjk3L8/k2e1mlstl3G638fv9VpeZEdiPOAJ9F0HF0Ke19yKoP2zb1rchQyTL\noMok7ezs1My779bosWPlGDFCq1at0pgxY/TrX/9aM2bM6Pe421as0JizztLVS5fq4lBIlT6f5uv4\nbRC3KnxOuNlmY/NvIMNkZ2eroqJCBw4c0JtvvqlVq1ZJik9PAwwODT0i5Ha7tWnJEj0X5ZXTl9ps\n+njSJH2wb5+e7eyMakOGLw0bpomTJqmmpkZXXnmlbDbbaY9LZCcvAENfRUWFrrrqKn3729+2upSM\nRRBHKB67Gn29okJ/e/BB/TkUiqqG2SNG6JZNm3T99ddHdXy8O3kBGPrOO+88PfXUU7rooousLiVj\ncdV0hOJx6f+ev/xFd0QZwpK0rLtbD6xdG/XxdPICcKzDhw+rra1NF1xwgdWlZDSCeBBiufT/yq9+\nlW3IAKSUV155RWVlZcrKIgqsxLM/SLetWKG1Dz2kqwsK9OX8fHkkfXLM14MKb6A9z+nU1QUFWrtp\nk25bsSJha5EBIFqvvPKKLrnkEqvLyHgEcRQWVVRof2urbtq4UT9zuTTSbteEvDxNyMvTGXa7al0u\n3bxhg/a3tnIlMoCU9fLLL+vzn/+81WVkPC7WioNILoJiGzIAqcQYozPPPFOvvvqqxo8fb3U5GY11\nxHFQWFh42mCM51pkQhhArN59913ZbDadffbZVpeS8ZiaTiK2IQOQKl5++WVdcsklEfUjQGIRxEnE\nNmQAUsUrr7zC+eEUQRAnEduQAbDSsdut/ulPfyKIUwTniJNsUUWFDh08qJnV1Xqiq0tlp7l9o8Ih\nzDZkAKLh9/v72tw27dmjEodDMkYHP/5YP165UkeOHNHChQt5k28hrpq2yJaGBi1jQwYACdT7OjPF\nGFV2dOgaHf8686Skuvx8vZ6VxeuMhQhiC7EhA4BEuX/9eq2LYubtthUrklEejkEQpwg2ZAAQL1sa\nGnTH4sURb7cqha9FmZmbq7WbNjEyTjKCGADSSDx2itvf2spMXBJx1TQApBGPx6OLQ6FBh7AklUma\nHArJ4/HEuyycAiNiAEgjs1wuLY+hg9/jkmpdLm1vaopnWTgFghgA0kRvT/v2YDDqtan0tE8+pqYB\nIE2w3erQRBADAGAhghgA0kRxcbFa/X4FY7iPoMK9DIqKiuJVFk6DIAaANNG33WoM98F2q8lHEANA\nGmG71aGHq6YBII3Q0GPoYUQMAGmE7VaHHoIYANLMoooKrVyzRjNzctQYwe0bFe4zzXar1mBqGgDS\nFNutDg0EMQCksYG2W/2gs1MXnXeeqtasYbtVixHEAJAhjt1u9Wc/+5lKSkpUXV1tcVWIpRMaAGAI\nKSws7FsfPGfOHD300EMWVwSJETEAZKSDBw9q6tSpam1tlc1ms7qcjMZV0wCQgc466yzl5eXp7bff\ntrqUjEcQA0CGmjFjhl566SWry8h4BDEAZCiCODUQxACQoWbMmKEXX3xRLS0tamlpkdfrtbqkjEQQ\nA0CG8fv9crvdWrl0qd7YvVvzpk7VvNJSjSsp0SyXS263W4FAwOoyMwZXTQNABunttjXFGFV2dOga\nHd9t60lJdfn5ej0ri25bSUIQA0CGuH/9eq2rrtYTXV0qO81tGxXeBGLl6tW6bcWKZJSXsQhiAMgA\nWxoadMfixdrZ1aVzIjxmv8KbQazdtImRcQIRxACQ5tijOLVxsRYApDmPx6OLQ6FBh7AklUmaHArJ\n4/HEuyz0YEQMAGlulsul5bt3qzzK4x+XVOtyaXtTUzzLQg+CGADSmNfr1biSErUHg1Hv8hOUdIbd\nrgOtrX2bRiB+mJoGgDTW1tamEocjpq327JJGZWf3baGI+CKIAQCwEEEMAGmsuLhYrX6/gjHcR1DS\n4UBARUVF8SoLxyCIASCNFRYWatqkSXoyhvvYKmn65MmcH04QghgA0lxlVZXq8vOjPr7O6VRlVVUc\nK8KxuGoaANIcDT1SGyNiAEhzDodDtfX1WpCTo/2DOG6/wv2ma+vrCeEEIogBIAMsqqjQyjVrNDMn\nR40R3L5R4T7TK1evps90gjE1DQAZpHcbxItDIVX6fJqv47dB3Crppzab9uXl6ecbNxLCSUAQA0CG\nCQQC8ng8qqup0a7mZo3qmXY+HAho+uTJGjVxokpKSlRfX29xpZmBIAaADOb1evs6ZhUVFamwsFDv\nv/++Jk2apH379mnkyJHyer1qa2uTFF6XzDKm+CKIAQAnue666zRs2DC98/rratqzRyUOhySp1e/X\ntEmTVFlVpYULF3IRVxwQxACA42xpaNCtN92kz3R26k5jdI2OP4/8pKS6/Hy9npWl2vp6ziPHiCAG\nAPS5f/16rauu1hNdXSo7zW0bFV7etHL1at22YkUyyktLBDEAQFJ4JHzH4sXa2dWlcyI8Zr/Cy5zW\nbtrEyDhKBDEAgO5bFqKhBwBAHo9HF4dCgw5hSSqTNDkUksfjiXdZGYERMQBAs1wuLd+9W+VRHv+4\npFqXS9ubmuJZVkYgiAEgw3m9Xo0rKVF7MNh3dfRgBSWdYbfrQGsr64wHialpAMhwbW1tKnE4og5h\nSbJLGpWd3dccBJEjiAEAsBBBDAAZrri4WK1+v4Ix3EdQ4V7VRUVF8SorYxDEAJDhCgsLNW3SJD0Z\nw31slTR98mTOD0eBIAYAqLKqSnX5+VEfX+d0qrKqKo4VZQ6umgYA0NDDQoyIAQByOByqra/Xgpwc\n7R/EcfsV7jddW19PCEeJIAYASJIWVVRo5Zo1mpmTo8YIbt+ocJ/platX02c6BkxNAwCOs6WhQcuW\nLtXFoZAqfT7N1/HbIG5V+Jxws83GNohxQBADAE4SCATk8XhUV1OjXc3NGtUz7Xw4END0yZNVWVWl\n8vJypqPjgCAGAJyS1+vt65hVVFTEEqU4I4gBALAQF2sBAGAhghgAAAsRxAAAWIggBgDAQgQxAAAW\nIogBALAQQQwAgIUIYgAALEQQAwBgIYIYAAALEcQAAFiIIAYAwEIEMQAAFiKIAQCwEEEMAICFCGIA\nACxEEAMAYCGCGAAACxHEAABYiCAGAMBCBDEAABYiiAEAsBBBDACAhQhiAAAsRBADAGAhghgAAAsR\nxAAAWIggBgDAQgQxAAAWIogBALAQQQwAgIUIYgAALEQQAwBgIYIYAAALEcQAAFiIIAYAwEIEMQAA\nFiKIAQCwEEEMAICFCGIAACxEEAMAYCGCGAAACxHEAABYiCAGAMBCBDEAABYiiAEAsBBBDACAhQhi\nAAAsRBADAGAhghgAAAsRxAAAWIggBgDAQgQxAAAWIogBALAQQQwAgIUIYgAALEQQAwBgIYIYAAAL\nEcQAAFiIIAYAwEIEMQAAFiKIAQCwEEEMAICFCGIAACxEEAMAYCGCGAAACxHEAABYiCAGAMBCBDEA\nABYiiAEAsBBBDACAhQhiAAAsRBADAGAhghgAAAsRxAAAWIggBgDAQgQxAAAWIogBALAQQQwAgIUI\nYgAALEQQAwBgIYIYAAALEcQAAFjo/wPb/dtZyO9ziwAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0xe7898d0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Create the Graph \n",
    "lolli_g = lollipop=networkx.lollipop_graph(10,20)\n",
    "\n",
    "# Get the cliques of the graph \n",
    "lolli_cliques = list(networkx.find_cliques(lolli_g))\n",
    "\n",
    "print( \"The Cliques in the Lollipop graph are, \" + str(lolli_cliques) )\n",
    "\n",
    "# Draw the Graph\n",
    "networkx.draw(lolli_g)"
   ]
  }
 ],
 "metadata": {
  "anaconda-cloud": {},
  "kernelspec": {
   "display_name": "Python 2",
   "language": "python",
   "name": "python2"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
